[Killed] ConditionalExpression
controllers/Auth.js:19:13
         // }
 
         const existingUser = await UserModel.findOne({ email });
-        if (existingUser) {
+        if (true) {
             if (existingUser.isAccountVerified == false) {
                 const hashedPass = await bcrypt.hash(password, 10);
killedBy: register() controller registers a new user and sends verification email (happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/Auth.js:19:13
         // }
 
         const existingUser = await UserModel.findOne({ email });
-        if (existingUser) {
+        if (false) {
             if (existingUser.isAccountVerified == false) {
                 const hashedPass = await bcrypt.hash(password, 10);
killedBy: register() controller updates data and re-sends verification email for an existing but unverified user (200)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/Auth.js:20:17
 
         const existingUser = await UserModel.findOne({ email });
         if (existingUser) {
-            if (existingUser.isAccountVerified == false) {
+            if (true) {
                 const hashedPass = await bcrypt.hash(password, 10);
                 existingUser.name = name;
killedBy: register() controller returns 409 when an existing verified user tries to register again
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/Auth.js:20:17
 
         const existingUser = await UserModel.findOne({ email });
         if (existingUser) {
-            if (existingUser.isAccountVerified == false) {
+            if (false) {
                 const hashedPass = await bcrypt.hash(password, 10);
                 existingUser.name = name;
killedBy: register() controller updates data and re-sends verification email for an existing but unverified user (200)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ArithmeticOperator
controllers/Auth.js:25:43
                 existingUser.name = name;
                 existingUser.password = hashedPass;
                 const verifyToken = crypto.randomUUID();
-                const expireAt = new Date(Date.now() + 1000 * 60 * 15);
+                const expireAt = new Date(Date.now() - 1000 * 60 * 15);
                 existingUser.verifyToken = verifyToken;
                 existingUser.verifyTokenExpireAt = expireAt;

[Survived] ArithmeticOperator
controllers/Auth.js:25:56
                 existingUser.name = name;
                 existingUser.password = hashedPass;
                 const verifyToken = crypto.randomUUID();
-                const expireAt = new Date(Date.now() + 1000 * 60 * 15);
+                const expireAt = new Date(Date.now() + 1000 * 60 / 15);
                 existingUser.verifyToken = verifyToken;
                 existingUser.verifyTokenExpireAt = expireAt;

[Survived] ObjectLiteral
controllers/Auth.js:32:37
                 await existingUser.save();
 
                 const { subject, html } = verificationEmail(email, verifyUrl);
-                const mailOptions = {
-                    from: process.env.SENDGRID_SENDER_EMAIL,
-                    to: email,
-                    subject,
-                    html,
-                };
+                const mailOptions = {};
                 try {
                     await transporter.sendMail(mailOptions);

[Killed] BlockStatement
controllers/Auth.js:38:21
                     subject,
                     html,
                 };
-                try {
-                    await transporter.sendMail(mailOptions);
-                } catch (emailError) {
+                try {} catch (emailError) {
                     console.error('Error sending email:', emailError);
                 }
killedBy: register() controller updates data and re-sends verification email for an existing but unverified user (200)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BlockStatement
controllers/Auth.js:40:38
                 };
                 try {
                     await transporter.sendMail(mailOptions);
-                } catch (emailError) {
-                    console.error('Error sending email:', emailError);
-                }
+                } catch (emailError) {}
                 return res.status(200).json({
                     success: true,

[Killed] BooleanLiteral
controllers/Auth.js:48:52
                     message: 'Please check your email to verify your account.',
                 });
             }
-            return res.status(409).json({ success: false, message: 'User already exists' });
+            return res.status(409).json({ success: true, message: 'User already exists' });
         }
 
killedBy: register() controller returns 409 when an existing verified user tries to register again
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User already exists",
-   "success": false,

[Killed] ObjectLiteral
controllers/Auth.js:48:41
                     message: 'Please check your email to verify your account.',
                 });
             }
-            return res.status(409).json({ success: false, message: 'User already exists' });
+            return res.status(409).json({});
         }
 
killedBy: register() controller returns 409 when an existing verified user tries to register again
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "User already exists",
-   "success": false,

[Survived] ArithmeticOperator
controllers/Auth.js:54:48
         const hashedPass = await bcrypt.hash(password, 10);
         const verifyToken = crypto.randomUUID();
 
-        const expireAt = new Date(Date.now() + 1000 * 60 * 15);
+        const expireAt = new Date(Date.now() + 1000 / 60 * 15);
 
         const user = new UserModel({

[Survived] ArithmeticOperator
controllers/Auth.js:54:48
         const hashedPass = await bcrypt.hash(password, 10);
         const verifyToken = crypto.randomUUID();
 
-        const expireAt = new Date(Date.now() + 1000 * 60 * 15);
+        const expireAt = new Date(Date.now() + 1000 * 60 / 15);
 
         const user = new UserModel({

[Killed] BlockStatement
controllers/Auth.js:76:13
             html,
         };
 
-        try {
-            await transporter.sendMail(mailOptions);
-        } catch (emailError) {
+        try {} catch (emailError) {
             console.error('Error sending email:', emailError);
         }
killedBy: register() controller registers a new user and sends verification email (happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
controllers/Auth.js:85:17
         return res.status(201).json({
             success: true,
             message:
-                'User registered successfully. Please check your email to verify your account.',
+                "",
         });
     } catch (error) {
killedBy: register() controller registers a new user and sends verification email (happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": StringContaining "User registered successfully", "success": true}
Received: {"message": "", "success": true}

Number of calls: 1

[Killed] BlockStatement
controllers/Auth.js:87:21
             message:
                 'User registered successfully. Please check your email to verify your account.',
         });
-    } catch (error) {
-        console.error('Registration error:', error);
-        console.error('Error stack:', error.stack);
-        return res.status(500).json({
-            success: false,
-            message: 'Internal server error',
-            error: process.env.NODE_ENV === 'development' ? error.message : undefined,
-        });
-    }
+    } catch (error) {}
 };
 
killedBy: register() controller returns 500 when findOne throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/Auth.js:88:23
                 'User registered successfully. Please check your email to verify your account.',
         });
     } catch (error) {
-        console.error('Registration error:', error);
+        console.error("", error);
         console.error('Error stack:', error.stack);
         return res.status(500).json({

[Survived] EqualityOperator
controllers/Auth.js:93:20
         return res.status(500).json({
             success: false,
             message: 'Internal server error',
-            error: process.env.NODE_ENV === 'development' ? error.message : undefined,
+            error: process.env.NODE_ENV !== 'development' ? error.message : undefined,
         });
     }

[Survived] ConditionalExpression
controllers/Auth.js:93:20
         return res.status(500).json({
             success: false,
             message: 'Internal server error',
-            error: process.env.NODE_ENV === 'development' ? error.message : undefined,
+            error: false ? error.message : undefined,
         });
     }

[Killed] BooleanLiteral
controllers/Auth.js:104:13
         const todayUTC = Date.UTC(today.getUTCFullYear(), today.getUTCMonth(), today.getUTCDate());
         const todayMid = new Date(todayUTC);
 
-        if (!user.lastLoginDate) {
+        if (user.lastLoginDate) {
             user.streakCount = 1;
         } else {
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] BlockStatement
controllers/Auth.js:104:34
         const todayUTC = Date.UTC(today.getUTCFullYear(), today.getUTCMonth(), today.getUTCDate());
         const todayMid = new Date(todayUTC);
 
-        if (!user.lastLoginDate) {
-            user.streakCount = 1;
-        } else {
+        if (!user.lastLoginDate) {} else {
             const last = new Date(user.lastLoginDate);
             const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
killedBy: isAuthenticated() controller covers missing lastLoginDate (streakCount = 1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 10

[Killed] BlockStatement
controllers/Auth.js:106:16
 
         if (!user.lastLoginDate) {
             user.streakCount = 1;
-        } else {
-            const last = new Date(user.lastLoginDate);
-            const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
-            const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
-            if (diffDays === 0) {
-            } else if (diffDays === 1) {
-                user.streakCount = user.streakCount + 1;
-            } else {
-                user.streakCount = 1;
-            }
-        }
+        } else {}
 
         user.lastLoginDate = today;
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] ArithmeticOperator
controllers/Auth.js:109:42
         } else {
             const last = new Date(user.lastLoginDate);
             const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
-            const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
+            const diffDays = Math.floor((todayUTC + lastUTC) / (1000 * 60 * 60 * 24));
             if (diffDays === 0) {
             } else if (diffDays === 1) {
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] ArithmeticOperator
controllers/Auth.js:109:65
         } else {
             const last = new Date(user.lastLoginDate);
             const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
-            const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
+            const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 / 24));
             if (diffDays === 0) {
             } else if (diffDays === 1) {
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] EqualityOperator
controllers/Auth.js:110:17
             const last = new Date(user.lastLoginDate);
             const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
             const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
-            if (diffDays === 0) {
+            if (diffDays !== 0) {
             } else if (diffDays === 1) {
                 user.streakCount = user.streakCount + 1;
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] ConditionalExpression
controllers/Auth.js:110:17
             const last = new Date(user.lastLoginDate);
             const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
             const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
-            if (diffDays === 0) {
+            if (false) {
             } else if (diffDays === 1) {
                 user.streakCount = user.streakCount + 1;
killedBy: signIn() controller covers maxStreak update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Killed] BlockStatement
controllers/Auth.js:111:40
             const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
             const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
             if (diffDays === 0) {
-            } else if (diffDays === 1) {
-                user.streakCount = user.streakCount + 1;
-            } else {
+            } else if (diffDays === 1) {} else {
                 user.streakCount = 1;
             }
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] EqualityOperator
controllers/Auth.js:111:24
             const lastUTC = Date.UTC(last.getUTCFullYear(), last.getUTCMonth(), last.getUTCDate());
             const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
             if (diffDays === 0) {
-            } else if (diffDays === 1) {
+            } else if (diffDays !== 1) {
                 user.streakCount = user.streakCount + 1;
             } else {
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] ArithmeticOperator
controllers/Auth.js:112:36
             const diffDays = Math.floor((todayUTC - lastUTC) / (1000 * 60 * 60 * 24));
             if (diffDays === 0) {
             } else if (diffDays === 1) {
-                user.streakCount = user.streakCount + 1;
+                user.streakCount = user.streakCount - 1;
             } else {
                 user.streakCount = 1;
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 2

[Killed] BlockStatement
controllers/Auth.js:113:20
             if (diffDays === 0) {
             } else if (diffDays === 1) {
                 user.streakCount = user.streakCount + 1;
-            } else {
-                user.streakCount = 1;
-            }
+            } else {}
         }
 
killedBy: updateLoginStreak() via signIn() covers diffDays > 1 (reset streak)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 10

[Killed] ConditionalExpression
controllers/Auth.js:119:13
         }
 
         user.lastLoginDate = today;
-        if ((user.maxStreak) < (user.streakCount)) {
+        if (false) {
             user.maxStreak = user.streakCount;
         }
killedBy: signIn() controller covers maxStreak update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Killed] BlockStatement
controllers/Auth.js:119:52
         }
 
         user.lastLoginDate = today;
-        if ((user.maxStreak) < (user.streakCount)) {
-            user.maxStreak = user.streakCount;
-        }
+        if ((user.maxStreak) < (user.streakCount)) {}
 
         if (!Array.isArray(user.loginDates)) {
killedBy: signIn() controller covers maxStreak update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Killed] ConditionalExpression
controllers/Auth.js:123:13
             user.maxStreak = user.streakCount;
         }
 
-        if (!Array.isArray(user.loginDates)) {
+        if (false) {
             user.loginDates = [];
         }
killedBy: isAuthenticated() controller initializes loginDates if it is not an array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
controllers/Auth.js:123:13
             user.maxStreak = user.streakCount;
         }
 
-        if (!Array.isArray(user.loginDates)) {
+        if (true) {
             user.loginDates = [];
         }
killedBy: signIn() controller covers loginDates > 730
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 730
Received: 1

[Killed] BlockStatement
controllers/Auth.js:126:52
         if (!Array.isArray(user.loginDates)) {
             user.loginDates = [];
         }
-        const hasToday = user.loginDates.some(d => {
-            const dd = new Date(d);
-            return dd.getUTCFullYear() === today.getUTCFullYear() && dd.getUTCMonth() === today.getUTCMonth() && dd.getUTCDate() === today.getUTCDate();
-        });
+        const hasToday = user.loginDates.some(d => {});
         if (!hasToday) {
             user.loginDates.push(todayMid);
killedBy: signIn() controller covers hasToday === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Survived] MethodExpression
controllers/Auth.js:126:26
         if (!Array.isArray(user.loginDates)) {
             user.loginDates = [];
         }
-        const hasToday = user.loginDates.some(d => {
-            const dd = new Date(d);
-            return dd.getUTCFullYear() === today.getUTCFullYear() && dd.getUTCMonth() === today.getUTCMonth() && dd.getUTCDate() === today.getUTCDate();
-        });
+        const hasToday = user.loginDates.every(d => {
+  const dd = new Date(d);
+  return dd.getUTCFullYear() === today.getUTCFullYear() && dd.getUTCMonth() === today.getUTCMonth() && dd.getUTCDate() === today.getUTCDate();
+});
         if (!hasToday) {
             user.loginDates.push(todayMid);

[Killed] ConditionalExpression
controllers/Auth.js:128:20
         }
         const hasToday = user.loginDates.some(d => {
             const dd = new Date(d);
-            return dd.getUTCFullYear() === today.getUTCFullYear() && dd.getUTCMonth() === today.getUTCMonth() && dd.getUTCDate() === today.getUTCDate();
+            return false;
         });
         if (!hasToday) {
killedBy: signIn() controller covers hasToday === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
controllers/Auth.js:128:20
         }
         const hasToday = user.loginDates.some(d => {
             const dd = new Date(d);
-            return dd.getUTCFullYear() === today.getUTCFullYear() && dd.getUTCMonth() === today.getUTCMonth() && dd.getUTCDate() === today.getUTCDate();
+            return true;
         });
         if (!hasToday) {
killedBy: signIn() controller covers loginDates > 730
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 730
Received: 800

[Killed] BooleanLiteral
controllers/Auth.js:130:13
             const dd = new Date(d);
             return dd.getUTCFullYear() === today.getUTCFullYear() && dd.getUTCMonth() === today.getUTCMonth() && dd.getUTCDate() === today.getUTCDate();
         });
-        if (!hasToday) {
+        if (hasToday) {
             user.loginDates.push(todayMid);
             if (user.loginDates.length > 730) {
killedBy: updateLoginStreak() via signIn() covers loginDates > 730 trimming
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 730
Received: 800

[Killed] ConditionalExpression
controllers/Auth.js:130:13
             const dd = new Date(d);
             return dd.getUTCFullYear() === today.getUTCFullYear() && dd.getUTCMonth() === today.getUTCMonth() && dd.getUTCDate() === today.getUTCDate();
         });
-        if (!hasToday) {
+        if (true) {
             user.loginDates.push(todayMid);
             if (user.loginDates.length > 730) {
killedBy: signIn() controller covers hasToday === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
controllers/Auth.js:132:47
         });
         if (!hasToday) {
             user.loginDates.push(todayMid);
-            if (user.loginDates.length > 730) {
-                user.loginDates = user.loginDates.slice(-730);
-            }
+            if (user.loginDates.length > 730) {}
         }
 
killedBy: updateLoginStreak() via signIn() covers loginDates > 730 trimming
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 730
Received: 801

[Killed] EqualityOperator
controllers/Auth.js:132:17
         });
         if (!hasToday) {
             user.loginDates.push(todayMid);
-            if (user.loginDates.length > 730) {
+            if (user.loginDates.length <= 730) {
                 user.loginDates = user.loginDates.slice(-730);
             }
killedBy: signIn() controller covers loginDates > 730
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 730
Received: 801

[Killed] MethodExpression
controllers/Auth.js:133:35
         if (!hasToday) {
             user.loginDates.push(todayMid);
             if (user.loginDates.length > 730) {
-                user.loginDates = user.loginDates.slice(-730);
+                user.loginDates = user.loginDates;
             }
         }
killedBy: updateLoginStreak() via signIn() covers loginDates > 730 trimming
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 730
Received: 801

[Killed] UnaryOperator
controllers/Auth.js:133:57
         if (!hasToday) {
             user.loginDates.push(todayMid);
             if (user.loginDates.length > 730) {
-                user.loginDates = user.loginDates.slice(-730);
+                user.loginDates = user.loginDates.slice(+730);
             }
         }
killedBy: updateLoginStreak() via signIn() covers loginDates > 730 trimming
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 730
Received: 71

[Killed] BlockStatement
controllers/Auth.js:139:19
 
         await user.save();
         return user;
-    } catch (err) {
-        console.error('updateLoginStreak error:', err);
-        return user;
-    }
+    } catch (err) {}
 }
 
killedBy: isAuthenticated() controller handles updateLoginStreak error gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/Auth.js:148:9
 export const verifyAccount = async (req, res) => {
     const { token } = req.validatedData;
 
-    try {
-        const user = await UserModel.findOne({ verifyToken: token });
-        if (!user) {
-            return res.status(404).json({ success: false, message: 'Link is not valid' });
-        }
-        const matched = user.verifyToken === token;
-        if (!matched) {
-            return res.status(400).json({ success: false, message: 'Link in not valid' });
-        }
-        if (user.verifyTokenExpireAt < Date.now()) {
-            return res.status(400).json({ success: false, message: 'Link is Expired' });
-        }
-        const update = await UserModel.updateOne(
-            { verifyToken: token },
-            {
-                isAccountVerified: true,
-                verifyToken: '',
-                verifyTokenExpireAt: new Date('9999-12-31'),
-            }
-        );
-
-        return res.status(200).json({ success: true, message: 'Account verified' });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: verifyAccount() controller returns 404 when token is not found (no user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"verifyToken": "mock-token"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/Auth.js:150:13
 
     try {
         const user = await UserModel.findOne({ verifyToken: token });
-        if (!user) {
+        if (true) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
killedBy: verifyAccount() controller returns 400 when token does not match user.verifyToken
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:150:13
 
     try {
         const user = await UserModel.findOne({ verifyToken: token });
-        if (!user) {
+        if (user) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
killedBy: verifyAccount() controller returns 404 when token is not found (no user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:151:52
     try {
         const user = await UserModel.findOne({ verifyToken: token });
         if (!user) {
-            return res.status(404).json({ success: false, message: 'Link is not valid' });
+            return res.status(404).json({ success: true, message: 'Link is not valid' });
         }
         const matched = user.verifyToken === token;
killedBy: verifyAccount() controller returns 404 when token is not found (no user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Link is not valid",
-   "success": false,

[Killed] ConditionalExpression
controllers/Auth.js:153:25
         if (!user) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
-        const matched = user.verifyToken === token;
+        const matched = false;
         if (!matched) {
             return res.status(400).json({ success: false, message: 'Link in not valid' });
killedBy: verifyAccount() controller returns 400 when token is expired
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Link is Expired",
+   "message": "Link in not valid",

[Killed] EqualityOperator
controllers/Auth.js:153:25
         if (!user) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
-        const matched = user.verifyToken === token;
+        const matched = user.verifyToken !== token;
         if (!matched) {
             return res.status(400).json({ success: false, message: 'Link in not valid' });
killedBy: verifyAccount() controller returns 400 when token does not match user.verifyToken
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:154:13
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
         const matched = user.verifyToken === token;
-        if (!matched) {
+        if (matched) {
             return res.status(400).json({ success: false, message: 'Link in not valid' });
         }
killedBy: verifyAccount() controller returns 400 when token does not match user.verifyToken
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/Auth.js:154:23
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
         const matched = user.verifyToken === token;
-        if (!matched) {
-            return res.status(400).json({ success: false, message: 'Link in not valid' });
-        }
+        if (!matched) {}
         if (user.verifyTokenExpireAt < Date.now()) {
             return res.status(400).json({ success: false, message: 'Link is Expired' });
killedBy: verifyAccount() controller returns 400 when token does not match user.verifyToken
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1
