[Killed] BlockStatement
controllers/ChatController.js:13:13
 
         const response = await generateWithGemini(getTitlePrompt(userMessage));
         let json_rsp;
-        try {
-            const cleanedText = response
-                .trim()
-                .replace(/^```json\s*|\s*```$/g, '')
-                .trim();
-            json_rsp = JSON.parse(cleanedText);
-        } catch (parseError) {
+        try {} catch (parseError) {
             console.error('JSON Parse Error:', parseError);
             return res.status(500).json({
killedBy: createChat() method should create a chat successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "test@example.com", "messages": [{"content": "Hello, AI!", "role": "user", "time": Any<Number>}], "moduleId": "module123", "roadmapId": "roadmap123", "title": "AI Title"}

Number of calls: 0

[Survived] MethodExpression
controllers/ChatController.js:14:33
         const response = await generateWithGemini(getTitlePrompt(userMessage));
         let json_rsp;
         try {
-            const cleanedText = response
-                .trim()
+            const cleanedText = response
                 .replace(/^```json\s*|\s*```$/g, '')
                 .trim();

[Survived] MethodExpression
controllers/ChatController.js:14:33
         const response = await generateWithGemini(getTitlePrompt(userMessage));
         let json_rsp;
         try {
-            const cleanedText = response
-                .trim()
-                .replace(/^```json\s*|\s*```$/g, '')
-                .trim();
+            const cleanedText = response.trim().replace(/^```json\s*|\s*```$/g, '');
             json_rsp = JSON.parse(cleanedText);
         } catch (parseError) {

[Survived] Regex
controllers/ChatController.js:16:26
         try {
             const cleanedText = response
                 .trim()
-                .replace(/^```json\s*|\s*```$/g, '')
+                .replace(/^```json\s*|\s*```/g, '')
                 .trim();
             json_rsp = JSON.parse(cleanedText);

[Survived] Regex
controllers/ChatController.js:16:26
         try {
             const cleanedText = response
                 .trim()
-                .replace(/^```json\s*|\s*```$/g, '')
+                .replace(/^```json\s*|\s```$/g, '')
                 .trim();
             json_rsp = JSON.parse(cleanedText);

[Killed] BlockStatement
controllers/ChatController.js:19:30
                 .replace(/^```json\s*|\s*```$/g, '')
                 .trim();
             json_rsp = JSON.parse(cleanedText);
-        } catch (parseError) {
-            console.error('JSON Parse Error:', parseError);
-            return res.status(500).json({
-                success: false,
-                message: 'Failed to parse roadmap response. The AI response was not valid JSON.',
-            });
-        }
+        } catch (parseError) {}
 
         const newChat = new ChatModel({
killedBy: createChat() method should handle JSON parse error gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Failed to parse roadmap response. The AI response was not valid JSON.",
-   "success": false,

[Survived] StringLiteral
controllers/ChatController.js:20:27
                 .trim();
             json_rsp = JSON.parse(cleanedText);
         } catch (parseError) {
-            console.error('JSON Parse Error:', parseError);
+            console.error("", parseError);
             return res.status(500).json({
                 success: false,

[Killed] StringLiteral
controllers/ChatController.js:23:26
             console.error('JSON Parse Error:', parseError);
             return res.status(500).json({
                 success: false,
-                message: 'Failed to parse roadmap response. The AI response was not valid JSON.',
+                message: "",
             });
         }
killedBy: createChat() method should handle JSON parse error gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Failed to parse roadmap response. The AI response was not valid JSON.",
+   "message": "",

[Killed] ObjectLiteral
controllers/ChatController.js:27:39
             });
         }
 
-        const newChat = new ChatModel({
-            email,
-            roadmapId,
-            moduleId,
-            title: json_rsp.title,
-            messages: [{ role: "user", content: userMessage, time: Date.now() }],
-        });
+        const newChat = new ChatModel({});
         newChat.messages.push({ role: "ai", content:json_rsp.response, time: Date.now() });
         await newChat.save();
killedBy: createChat() method should create a chat successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "test@example.com",
-   "messages": Array [

[Killed] StringLiteral
controllers/ChatController.js:34:39
             title: json_rsp.title,
             messages: [{ role: "user", content: userMessage, time: Date.now() }],
         });
-        newChat.messages.push({ role: "ai", content:json_rsp.response, time: Date.now() });
+        newChat.messages.push({ role: "", content:json_rsp.response, time: Date.now() });
         await newChat.save();
         res.status(201).json({ message: "Chat created successfully", data: json_rsp, chatId: newChat._id });
killedBy: createChat() method should create a chat successfully with valid inputs
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "content": "AI Response",
-   "role": "ai",

[Killed] StringLiteral
controllers/ChatController.js:36:41
         });
         newChat.messages.push({ role: "ai", content:json_rsp.response, time: Date.now() });
         await newChat.save();
-        res.status(201).json({ message: "Chat created successfully", data: json_rsp, chatId: newChat._id });
+        res.status(201).json({ message: "", data: json_rsp, chatId: newChat._id });
         
     } catch (error) {
killedBy: createChat() method should create a chat successfully with valid inputs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "chatId": Anything,
+   "chatId": "mocked-chat-id",

[Killed] BlockStatement
controllers/ChatController.js:38:21
         await newChat.save();
         res.status(201).json({ message: "Chat created successfully", data: json_rsp, chatId: newChat._id });
         
-    } catch (error) {
-        res.status(500).json({ message: "Error creating chat", error });
-    }
+    } catch (error) {}
 };
 
killedBy: createChat() method should handle errors during chat creation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:43:48
     }
 };
 
-export const getResponse = async (req, res) => {
-    try {
-        const { chatId, userMessage } = req.body;
-        const chat = await ChatModel.findOne({ _id: chatId });
-        
-        if(!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        const context = chat.messages.slice(-8).map(m => `${m.role}: ${m.content}`).join("\n");
-
-        const response = await generateWithGemini(getResponsePrompt(userMessage, context));
-
-        chat.messages.push({ role: "user", content: userMessage, time: Date.now() });
-        chat.messages.push({ role: "ai", content: response, time: Date.now() });
-        await chat.save();
-
-        res.status(200).json({ message: "AI response generated", data: response });
-    } catch (error) {
-        res.status(500).json({ message: "Error generating AI response", error });
-    }
-}
+export const getResponse = async (req, res) => {}
 
 
killedBy: getResponse() controller should generate AI response and update chat successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "testChatId"}

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:44:9
 };
 
 export const getResponse = async (req, res) => {
-    try {
-        const { chatId, userMessage } = req.body;
-        const chat = await ChatModel.findOne({ _id: chatId });
-        
-        if(!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        const context = chat.messages.slice(-8).map(m => `${m.role}: ${m.content}`).join("\n");
-
-        const response = await generateWithGemini(getResponsePrompt(userMessage, context));
-
-        chat.messages.push({ role: "user", content: userMessage, time: Date.now() });
-        chat.messages.push({ role: "ai", content: response, time: Date.now() });
-        await chat.save();
-
-        res.status(200).json({ message: "AI response generated", data: response });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: "Error generating AI response", error });
     }
killedBy: getResponse() controller should generate AI response and update chat successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "testChatId"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/ChatController.js:48:12
         const { chatId, userMessage } = req.body;
         const chat = await ChatModel.findOne({ _id: chatId });
         
-        if(!chat) {
+        if(true) {
             return res.status(404).json({ message: "Chat not found" });
         }
killedBy: getResponse() controller should generate AI response and update chat successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Hello, AI!", Any<String>

Number of calls: 0

[Killed] ConditionalExpression
controllers/ChatController.js:48:12
         const { chatId, userMessage } = req.body;
         const chat = await ChatModel.findOne({ _id: chatId });
         
-        if(!chat) {
+        if(false) {
             return res.status(404).json({ message: "Chat not found" });
         }
killedBy: getResponse() controller should return 404 if chat is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Survived] UnaryOperator
controllers/ChatController.js:51:45
         if(!chat) {
             return res.status(404).json({ message: "Chat not found" });
         }
-        const context = chat.messages.slice(-8).map(m => `${m.role}: ${m.content}`).join("\n");
+        const context = chat.messages.slice(+8).map(m => `${m.role}: ${m.content}`).join("\n");
 
         const response = await generateWithGemini(getResponsePrompt(userMessage, context));

[Survived] ArrowFunction
controllers/ChatController.js:51:53
         if(!chat) {
             return res.status(404).json({ message: "Chat not found" });
         }
-        const context = chat.messages.slice(-8).map(m => `${m.role}: ${m.content}`).join("\n");
+        const context = chat.messages.slice(-8).map(() => undefined).join("\n");
 
         const response = await generateWithGemini(getResponsePrompt(userMessage, context));

[Survived] ObjectLiteral
controllers/ChatController.js:55:28
 
         const response = await generateWithGemini(getResponsePrompt(userMessage, context));
 
-        chat.messages.push({ role: "user", content: userMessage, time: Date.now() });
+        chat.messages.push({});
         chat.messages.push({ role: "ai", content: response, time: Date.now() });
         await chat.save();

[Survived] ObjectLiteral
controllers/ChatController.js:56:28
         const response = await generateWithGemini(getResponsePrompt(userMessage, context));
 
         chat.messages.push({ role: "user", content: userMessage, time: Date.now() });
-        chat.messages.push({ role: "ai", content: response, time: Date.now() });
+        chat.messages.push({});
         await chat.save();
 

[Survived] StringLiteral
controllers/ChatController.js:56:36
         const response = await generateWithGemini(getResponsePrompt(userMessage, context));
 
         chat.messages.push({ role: "user", content: userMessage, time: Date.now() });
-        chat.messages.push({ role: "ai", content: response, time: Date.now() });
+        chat.messages.push({ role: "", content: response, time: Date.now() });
         await chat.save();
 

[Killed] BlockStatement
controllers/ChatController.js:60:21
         await chat.save();
 
         res.status(200).json({ message: "AI response generated", data: response });
-    } catch (error) {
-        res.status(500).json({ message: "Error generating AI response", error });
-    }
+    } catch (error) {}
 }
 
killedBy: getResponse() controller should return 500 if AI generation fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/ChatController.js:61:30
 
         res.status(200).json({ message: "AI response generated", data: response });
     } catch (error) {
-        res.status(500).json({ message: "Error generating AI response", error });
+        res.status(500).json({});
     }
 }
killedBy: getResponse() controller should return 500 if AI generation fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": [Error: AI generation error],
-   "message": "Error generating AI response",

[Killed] BlockStatement
controllers/ChatController.js:66:45
 }
 
 
-export const getChats = async (req, res) => {
-    try {
-        const { email } = req;
-        const { roadmapId, moduleId } = req.body;
-        const chats = await ChatModel.find({ email, roadmapId, moduleId });
-        res.status(200).json({ message: "Chats retrieved successfully", data: chats });
-    } catch (error) {
-        res.status(500).json({ message: "Error retrieving chats", error });
-    }
-};
+export const getChats = async (req, res) => {};
 
 export const getChat = async (req, res) => {
killedBy: getChats() getChats method Happy paths should retrieve chats successfully when chats exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:67:9
 
 
 export const getChats = async (req, res) => {
-    try {
-        const { email } = req;
-        const { roadmapId, moduleId } = req.body;
-        const chats = await ChatModel.find({ email, roadmapId, moduleId });
-        res.status(200).json({ message: "Chats retrieved successfully", data: chats });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: "Error retrieving chats", error });
     }
killedBy: getChats() getChats method Happy paths should retrieve chats successfully when chats exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:72:21
         const { roadmapId, moduleId } = req.body;
         const chats = await ChatModel.find({ email, roadmapId, moduleId });
         res.status(200).json({ message: "Chats retrieved successfully", data: chats });
-    } catch (error) {
-        res.status(500).json({ message: "Error retrieving chats", error });
-    }
+    } catch (error) {}
 };
 
killedBy: getChats() getChats method Edge cases should handle errors gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/ChatController.js:73:30
         const chats = await ChatModel.find({ email, roadmapId, moduleId });
         res.status(200).json({ message: "Chats retrieved successfully", data: chats });
     } catch (error) {
-        res.status(500).json({ message: "Error retrieving chats", error });
+        res.status(500).json({});
     }
 };
killedBy: getChats() getChats method Edge cases should handle errors gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": Any<Error>,
-   "message": "Error retrieving chats",

[Killed] StringLiteral
controllers/ChatController.js:73:41
         const chats = await ChatModel.find({ email, roadmapId, moduleId });
         res.status(200).json({ message: "Chats retrieved successfully", data: chats });
     } catch (error) {
-        res.status(500).json({ message: "Error retrieving chats", error });
+        res.status(500).json({ message: "", error });
     }
 };
killedBy: getChats() getChats method Edge cases should handle errors gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "error": Any<Error>,
-   "message": "Error retrieving chats",

[Killed] BlockStatement
controllers/ChatController.js:77:44
     }
 };
 
-export const getChat = async (req, res) => {
-    try {
-        const { chatId } = req.body;
-        const chat = await ChatModel.findById(chatId);
-        if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        res.status(200).json({ message: "Chat retrieved successfully", data: chat });
-    } catch (error) {
-        res.status(500).json({ message: "Error retrieving chat", error });
-    }   
-};
+export const getChat = async (req, res) => {};
 
 export const deleteChat = async (req, res) => {
killedBy: getChat() getChat method Happy paths should retrieve a chat successfully when a valid chatId is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:78:9
 };
 
 export const getChat = async (req, res) => {
-    try {
-        const { chatId } = req.body;
-        const chat = await ChatModel.findById(chatId);
-        if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        res.status(200).json({ message: "Chat retrieved successfully", data: chat });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: "Error retrieving chat", error });
     }   
killedBy: getChat() getChat method Happy paths should retrieve a chat successfully when a valid chatId is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
controllers/ChatController.js:81:13
     try {
         const { chatId } = req.body;
         const chat = await ChatModel.findById(chatId);
-        if (!chat) {
+        if (false) {
             return res.status(404).json({ message: "Chat not found" });
         }
killedBy: getChat() getChat method Edge cases should return 404 when the chat is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/ChatController.js:81:13
     try {
         const { chatId } = req.body;
         const chat = await ChatModel.findById(chatId);
-        if (!chat) {
+        if (true) {
             return res.status(404).json({ message: "Chat not found" });
         }
killedBy: getChat() getChat method Happy paths should retrieve a chat successfully when a valid chatId is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] StringLiteral
controllers/ChatController.js:82:52
         const { chatId } = req.body;
         const chat = await ChatModel.findById(chatId);
         if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
+            return res.status(404).json({ message: "" });
         }
         res.status(200).json({ message: "Chat retrieved successfully", data: chat });
killedBy: getChat() getChat method Edge cases should return 404 when the chat is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Chat not found",
+   "message": "",

[Killed] BlockStatement
controllers/ChatController.js:85:21
             return res.status(404).json({ message: "Chat not found" });
         }
         res.status(200).json({ message: "Chat retrieved successfully", data: chat });
-    } catch (error) {
-        res.status(500).json({ message: "Error retrieving chat", error });
-    }   
+    } catch (error) {}   
 };
 
killedBy: getChat() getChat method Edge cases should handle errors gracefully and return 500
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/ChatController.js:86:30
         }
         res.status(200).json({ message: "Chat retrieved successfully", data: chat });
     } catch (error) {
-        res.status(500).json({ message: "Error retrieving chat", error });
+        res.status(500).json({});
     }   
 };
killedBy: getChat() getChat method Edge cases should handle errors gracefully and return 500
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "error": Any<Error>,
-   "message": "Error retrieving chat",

[Killed] BlockStatement
controllers/ChatController.js:90:47
     }   
 };
 
-export const deleteChat = async (req, res) => {
-    try {
-        const { chatId } = req.body;
-        const chat = await ChatModel.findByIdAndDelete(chatId);
-        if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        res.status(200).json({ message: "Chat deleted successfully", data: chat });
-    } catch (error) {
-        res.status(500).json({ message: "Error deleting chat", error });
-    }
-};
+export const deleteChat = async (req, res) => {};
 
 export const renameChat = async (req, res) => {
killedBy: deleteChat() deleteChat method Happy Paths should delete a chat successfully when chat exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:91:9
 };
 
 export const deleteChat = async (req, res) => {
-    try {
-        const { chatId } = req.body;
-        const chat = await ChatModel.findByIdAndDelete(chatId);
-        if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        res.status(200).json({ message: "Chat deleted successfully", data: chat });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: "Error deleting chat", error });
     }
killedBy: deleteChat() deleteChat method Happy Paths should delete a chat successfully when chat exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
controllers/ChatController.js:94:13
     try {
         const { chatId } = req.body;
         const chat = await ChatModel.findByIdAndDelete(chatId);
-        if (!chat) {
+        if (true) {
             return res.status(404).json({ message: "Chat not found" });
         }
killedBy: deleteChat() deleteChat method Happy Paths should delete a chat successfully when chat exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] BlockStatement
controllers/ChatController.js:94:20
     try {
         const { chatId } = req.body;
         const chat = await ChatModel.findByIdAndDelete(chatId);
-        if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
+        if (!chat) {}
         res.status(200).json({ message: "Chat deleted successfully", data: chat });
     } catch (error) {
killedBy: deleteChat() deleteChat method Edge Cases should return 404 when chat does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/ChatController.js:98:21
             return res.status(404).json({ message: "Chat not found" });
         }
         res.status(200).json({ message: "Chat deleted successfully", data: chat });
-    } catch (error) {
-        res.status(500).json({ message: "Error deleting chat", error });
-    }
+    } catch (error) {}
 };
 
killedBy: deleteChat() deleteChat method Edge Cases should handle errors gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:103:47
     }
 };
 
-export const renameChat = async (req, res) => {
-    try {
-        const { chatId, newTitle } = req.body;
-        const chat = await ChatModel.findById(chatId);
-        if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        chat.title = newTitle;
-        await chat.save();
-        res.status(200).json({ message: "Chat renamed successfully", data: chat });
-    } catch (error) {
-        res.status(500).json({ message: "Error renaming chat", error });
-    }
-};
+export const renameChat = async (req, res) => {};
 
killedBy: renameChat() controller Happy paths should rename the chat successfully when valid chatId and newTitle are provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "validChatId"

Number of calls: 0

[Killed] BlockStatement
controllers/ChatController.js:104:9
 };
 
 export const renameChat = async (req, res) => {
-    try {
-        const { chatId, newTitle } = req.body;
-        const chat = await ChatModel.findById(chatId);
-        if (!chat) {
-            return res.status(404).json({ message: "Chat not found" });
-        }
-        chat.title = newTitle;
-        await chat.save();
-        res.status(200).json({ message: "Chat renamed successfully", data: chat });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ message: "Error renaming chat", error });
     }
killedBy: renameChat() controller Happy paths should rename the chat successfully when valid chatId and newTitle are provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "validChatId"

Number of calls: 0

[Killed] BooleanLiteral
controllers/ChatController.js:107:13
     try {
         const { chatId, newTitle } = req.body;
         const chat = await ChatModel.findById(chatId);
-        if (!chat) {
+        if (chat) {
             return res.status(404).json({ message: "Chat not found" });
         }
killedBy: renameChat() controller Happy paths should rename the chat successfully when valid chatId and newTitle are provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Chat Title"
Received: "Old Title"

[Killed] BlockStatement
controllers/ChatController.js:113:21
         chat.title = newTitle;
         await chat.save();
         res.status(200).json({ message: "Chat renamed successfully", data: chat });
-    } catch (error) {
-        res.status(500).json({ message: "Error renaming chat", error });
-    }
+    } catch (error) {}
 };
 
killedBy: renameChat() controller Edge cases should handle database errors and return 500
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
