[Survived] StringLiteral
controllers/CodeController.js:13:8
   python: "3.10.0",
   java: "15.0.2",
   c: "10.2.0",
-  cpp: "10.2.0",
+  cpp: "",
   csharp: "6.12.0",
   go: "1.16.2",

[Survived] StringLiteral
controllers/CodeController.js:17:9
   csharp: "6.12.0",
   go: "1.16.2",
   rust: "1.68.2",
-  ruby: "3.0.1",
+  ruby: "",
   php: "8.2.3",
   swift: "5.3.3",

[Survived] StringLiteral
controllers/CodeController.js:20:11
   ruby: "3.0.1",
   php: "8.2.3",
   swift: "5.3.3",
-  kotlin: "1.8.20",
+  kotlin: "",
   r: "4.1.1",               
   scala: "3.2.2",

[Survived] StringLiteral
controllers/CodeController.js:22:10
   swift: "5.3.3",
   kotlin: "1.8.20",
   r: "4.1.1",               
-  scala: "3.2.2",
+  scala: "",
   perl: "5.36.0",
   haskell: "9.0.1",

[Survived] StringLiteral
controllers/CodeController.js:23:9
   kotlin: "1.8.20",
   r: "4.1.1",               
   scala: "3.2.2",
-  perl: "5.36.0",
+  perl: "",
   haskell: "9.0.1",
   lua: "5.4.4",

[Survived] StringLiteral
controllers/CodeController.js:25:8
   scala: "3.2.2",
   perl: "5.36.0",
   haskell: "9.0.1",
-  lua: "5.4.4",
+  lua: "",
   dart: "2.19.6",
   bash: "5.2.0"

[Killed] StringLiteral
controllers/CodeController.js:34:53
 
 export const executeCode = async (req, res) => {
     try {
-        const { language, files, args = [], stdin = '' } = req.validatedData;
+        const { language, files, args = [], stdin = "Stryker was here!" } = req.validatedData;
         const filesArray = files
             .filter(file => !file.name.endsWith("/")&&(file.language==language))   
killedBy: executeCode() controller should default stdin to empty string when undefined
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: "Stryker was here!"

[Killed] MethodExpression
controllers/CodeController.js:35:28
 export const executeCode = async (req, res) => {
     try {
         const { language, files, args = [], stdin = '' } = req.validatedData;
-        const filesArray = files
-            .filter(file => !file.name.endsWith("/")&&(file.language==language))   
+        const filesArray = files   
             .map(file => ({
                 name: file.name.startsWith("/") ? file.name.slice(1) : file.name,
killedBy: executeCode() controller should ignore files whose name ends with '/'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -2,9 +2,13 @@
    Object {
      "content": "console.log('A')",

[Killed] ConditionalExpression
controllers/CodeController.js:36:29
     try {
         const { language, files, args = [], stdin = '' } = req.validatedData;
         const filesArray = files
-            .filter(file => !file.name.endsWith("/")&&(file.language==language))   
+            .filter(file => true)   
             .map(file => ({
                 name: file.name.startsWith("/") ? file.name.slice(1) : file.name,
killedBy: executeCode() controller should ignore files whose name ends with '/'
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 4

@@ -2,9 +2,13 @@
    Object {
      "content": "console.log('A')",

[Killed] EqualityOperator
controllers/CodeController.js:36:56
     try {
         const { language, files, args = [], stdin = '' } = req.validatedData;
         const filesArray = files
-            .filter(file => !file.name.endsWith("/")&&(file.language==language))   
+            .filter(file => !file.name.endsWith("/")&&(file.language != language))   
             .map(file => ({
                 name: file.name.startsWith("/") ? file.name.slice(1) : file.name,
killedBy: executeCode() controller should execute code successfully with valid input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  undefined,
  Object {
    "args": Array [],

[Killed] ArrowFunction
controllers/CodeController.js:37:18
         const { language, files, args = [], stdin = '' } = req.validatedData;
         const filesArray = files
             .filter(file => !file.name.endsWith("/")&&(file.language==language))   
-            .map(file => ({
-                name: file.name.startsWith("/") ? file.name.slice(1) : file.name,
-                content: file.code
-            }));
+            .map(() => undefined);
 
         const payload = {
killedBy: executeCode() controller should execute code successfully with valid input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  undefined,
  Object {
    "args": Array [],

[Killed] MethodExpression
controllers/CodeController.js:38:51
         const filesArray = files
             .filter(file => !file.name.endsWith("/")&&(file.language==language))   
             .map(file => ({
-                name: file.name.startsWith("/") ? file.name.slice(1) : file.name,
+                name: file.name.startsWith("/") ? file.name : file.name,
                 content: file.code
             }));
killedBy: executeCode() controller should remove leading '/' in filenames
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "content": "X",

[Killed] MethodExpression
controllers/CodeController.js:38:23
         const filesArray = files
             .filter(file => !file.name.endsWith("/")&&(file.language==language))   
             .map(file => ({
-                name: file.name.startsWith("/") ? file.name.slice(1) : file.name,
+                name: file.name.endsWith("/") ? file.name.slice(1) : file.name,
                 content: file.code
             }));
killedBy: executeCode() controller should remove leading '/' in filenames
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    Object {
      "content": "X",

[Killed] ConditionalExpression
controllers/CodeController.js:47:20
             version : LANGUAGE_VERSIONS[language],
             files: filesArray,
             args: Array.isArray(args) ? args : [],
-            stdin: stdin || '',
+            stdin: true,
         };
 
killedBy: executeCode() controller should execute code successfully with valid input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  undefined,
@@ -5,8 +5,8 @@
        "content": "console.log(\"Hello, World!\");",

[Killed] LogicalOperator
controllers/CodeController.js:47:20
             version : LANGUAGE_VERSIONS[language],
             files: filesArray,
             args: Array.isArray(args) ? args : [],
-            stdin: stdin || '',
+            stdin: stdin && '',
         };
 
killedBy: executeCode() controller should default stdin to empty string when null
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: ""
Received: null

[Killed] ObjectLiteral
controllers/CodeController.js:50:80
             stdin: stdin || '',
         };
 
-        const response = await axios.post(process.env.PISTON_API_URL, payload, {
-            headers: {
-                'Content-Type': 'application/json',
-            },
-            timeout: 10000,
-        });
+        const response = await axios.post(process.env.PISTON_API_URL, payload, {});
 
         return res.status(200).json({
killedBy: executeCode() controller should execute code successfully with valid input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  undefined,
  {"args": [], "files": [{"content": "console.log(\"Hello, World!\");", "name": "main.js"}], "language": "javascript", "stdin": "", "version": "18.15.0"},
- Object {

[Killed] ObjectLiteral
controllers/CodeController.js:51:22
         };
 
         const response = await axios.post(process.env.PISTON_API_URL, payload, {
-            headers: {
-                'Content-Type': 'application/json',
-            },
+            headers: {},
             timeout: 10000,
         });
killedBy: executeCode() controller should execute code successfully with valid input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  undefined,
  {"args": [], "files": [{"content": "console.log(\"Hello, World!\");", "name": "main.js"}], "language": "javascript", "stdin": "", "version": "18.15.0"},
  Object {

[Killed] StringLiteral
controllers/CodeController.js:60:22
         return res.status(200).json({
             success: true,
             data: response.data,
-            message: 'Code executed successfully',
+            message: "",
         });
     } catch (error) {
killedBy: executeCode() controller should execute code successfully with valid input
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,8 +3,8 @@
      "run": Object {
        "stdout": "Hello, World!

[Killed] BlockStatement
controllers/CodeController.js:62:21
             data: response.data,
             message: 'Code executed successfully',
         });
-    } catch (error) {
-        console.error('Error executing code:', error);
-        return res.status(500).json({
-            success: false,
-            message: error.message,
-        });
-    }
+    } catch (error) {}
 };
 
killedBy: executeCode() controller should return 500 when axios throws error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/CodeController.js:73:44
 
 
 
-export const analyse = async (req, res) => {
-    try {
-        const code = req.body.content;
-        const prompt = getAnalysePrompt(code);
-        let response = await generateWithGemini(prompt);
-        response = response.trim().replace(/^```json\s*|\s*```$/g, '').trim();
-        const responseJson = JSON.parse(response);
-        return res.status(200).json({
-            success: true,
-            data : responseJson,
-            message : 'Analysis successful'
-        });
-    }catch (error){
-        return res.status(500).json({
-            success: false,
-            message: error.message,
-        })
-    }
-};
+export const analyse = async (req, res) => {};
 
killedBy: analyse() CodeController method should analyse code successfully and return parsed JSON
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "console.log('Hello')"

Number of calls: 0

[Killed] BlockStatement
controllers/CodeController.js:74:9
 
 
 export const analyse = async (req, res) => {
-    try {
-        const code = req.body.content;
-        const prompt = getAnalysePrompt(code);
-        let response = await generateWithGemini(prompt);
-        response = response.trim().replace(/^```json\s*|\s*```$/g, '').trim();
-        const responseJson = JSON.parse(response);
-        return res.status(200).json({
-            success: true,
-            data : responseJson,
-            message : 'Analysis successful'
-        });
-    }catch (error){
+    try {}catch (error){
         return res.status(500).json({
             success: false,
killedBy: analyse() CodeController method should analyse code successfully and return parsed JSON
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "console.log('Hello')"

Number of calls: 0

[Survived] MethodExpression
controllers/CodeController.js:78:20
         const code = req.body.content;
         const prompt = getAnalysePrompt(code);
         let response = await generateWithGemini(prompt);
-        response = response.trim().replace(/^```json\s*|\s*```$/g, '').trim();
+        response = response.replace(/^```json\s*|\s*```$/g, '').trim();
         const responseJson = JSON.parse(response);
         return res.status(200).json({

[Survived] MethodExpression
controllers/CodeController.js:78:20
         const code = req.body.content;
         const prompt = getAnalysePrompt(code);
         let response = await generateWithGemini(prompt);
-        response = response.trim().replace(/^```json\s*|\s*```$/g, '').trim();
+        response = response.trim().replace(/^```json\s*|\s*```$/g, '');
         const responseJson = JSON.parse(response);
         return res.status(200).json({

[Killed] ObjectLiteral
controllers/CodeController.js:80:37
         let response = await generateWithGemini(prompt);
         response = response.trim().replace(/^```json\s*|\s*```$/g, '').trim();
         const responseJson = JSON.parse(response);
-        return res.status(200).json({
-            success: true,
-            data : responseJson,
-            message : 'Analysis successful'
-        });
+        return res.status(200).json({});
     }catch (error){
         return res.status(500).json({
killedBy: analyse() CodeController method should analyse code successfully and return parsed JSON
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": Object {
-     "issues": Array [],

[Killed] BlockStatement
controllers/CodeController.js:85:19
             data : responseJson,
             message : 'Analysis successful'
         });
-    }catch (error){
-        return res.status(500).json({
-            success: false,
-            message: error.message,
-        })
-    }
+    }catch (error){}
 };
 
killedBy: analyse() CodeController method should return 500 when Gemini returns invalid JSON
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
