[Killed] BooleanLiteral
controllers/Auth.js:155:52
         }
         const matched = user.verifyToken === token;
         if (!matched) {
-            return res.status(400).json({ success: false, message: 'Link in not valid' });
+            return res.status(400).json({ success: true, message: 'Link in not valid' });
         }
         if (user.verifyTokenExpireAt < Date.now()) {
killedBy: verifyAccount() controller returns 400 when token does not match user.verifyToken
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Link in not valid",
-   "success": false,

[Killed] EqualityOperator
controllers/Auth.js:157:13
         if (!matched) {
             return res.status(400).json({ success: false, message: 'Link in not valid' });
         }
-        if (user.verifyTokenExpireAt < Date.now()) {
+        if (user.verifyTokenExpireAt >= Date.now()) {
             return res.status(400).json({ success: false, message: 'Link is Expired' });
         }
killedBy: verifyAccount() controller returns 400 when token is expired
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/Auth.js:157:52
         if (!matched) {
             return res.status(400).json({ success: false, message: 'Link in not valid' });
         }
-        if (user.verifyTokenExpireAt < Date.now()) {
-            return res.status(400).json({ success: false, message: 'Link is Expired' });
-        }
+        if (user.verifyTokenExpireAt < Date.now()) {}
         const update = await UserModel.updateOne(
             { verifyToken: token },
killedBy: verifyAccount() controller returns 400 when token is expired
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:158:52
             return res.status(400).json({ success: false, message: 'Link in not valid' });
         }
         if (user.verifyTokenExpireAt < Date.now()) {
-            return res.status(400).json({ success: false, message: 'Link is Expired' });
+            return res.status(400).json({ success: true, message: 'Link is Expired' });
         }
         const update = await UserModel.updateOne(
killedBy: verifyAccount() controller returns 400 when token is expired
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Link is Expired",
-   "success": false,

[Killed] BooleanLiteral
controllers/Auth.js:163:36
         const update = await UserModel.updateOne(
             { verifyToken: token },
             {
-                isAccountVerified: true,
+                isAccountVerified: false,
                 verifyToken: '',
                 verifyTokenExpireAt: new Date('9999-12-31'),
killedBy: verifyAccount() controller verifies account successfully (200) and calls update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"verifyToken": "mock-token"},
  Object {
-   "isAccountVerified": true,

[Killed] BooleanLiteral
controllers/Auth.js:169:48
             }
         );
 
-        return res.status(200).json({ success: true, message: 'Account verified' });
+        return res.status(200).json({ success: false, message: 'Account verified' });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: verifyAccount() controller verifies account successfully (200) and calls update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Account verified",
-   "success": true,

[Killed] StringLiteral
controllers/Auth.js:169:63
             }
         );
 
-        return res.status(200).json({ success: true, message: 'Account verified' });
+        return res.status(200).json({ success: true, message: "" });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: verifyAccount() controller verifies account successfully (200) and calls update
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Account verified",
+   "message": "",

[Killed] BlockStatement
controllers/Auth.js:170:21
         );
 
         return res.status(200).json({ success: true, message: 'Account verified' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: verifyAccount() controller returns 500 when findOne throws (catch block)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] ObjectLiteral
controllers/Auth.js:178:46
 export const signIn = async (req, res) => {
     const { email, password } = req.validatedData;
     try {
-        const user = await UserModel.findOne({ email });
+        const user = await UserModel.findOne({});
         if (!user) {
             return res.status(404).json({ success: false, message: 'User not found' });

[Killed] BlockStatement
controllers/Auth.js:179:20
     const { email, password } = req.validatedData;
     try {
         const user = await UserModel.findOne({ email });
-        if (!user) {
-            return res.status(404).json({ success: false, message: 'User not found' });
-        }
+        if (!user) {}
         if (user.password === null) {
             return res
killedBy: signIn() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:179:13
     const { email, password } = req.validatedData;
     try {
         const user = await UserModel.findOne({ email });
-        if (!user) {
+        if (user) {
             return res.status(404).json({ success: false, message: 'User not found' });
         }
killedBy: updateLoginStreak() via signIn() covers diffDays === 0 (same UTC day)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/Auth.js:182:13
         if (!user) {
             return res.status(404).json({ success: false, message: 'User not found' });
         }
-        if (user.password === null) {
+        if (false) {
             return res
                 .status(400)
killedBy: signIn() controller returns 400 if password is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/Auth.js:182:37
         if (!user) {
             return res.status(404).json({ success: false, message: 'User not found' });
         }
-        if (user.password === null) {
-            return res
-                .status(400)
-                .json({ success: false, message: 'User exists, No password found' });
-        }
+        if (user.password === null) {}
         const isMatch = await bcrypt.compare(password, user.password);
         if (!isMatch) {
killedBy: signIn() controller returns 400 if password is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Survived] BooleanLiteral
controllers/Auth.js:185:34
         if (user.password === null) {
             return res
                 .status(400)
-                .json({ success: false, message: 'User exists, No password found' });
+                .json({ success: true, message: 'User exists, No password found' });
         }
         const isMatch = await bcrypt.compare(password, user.password);

[Survived] ObjectLiteral
controllers/Auth.js:185:23
         if (user.password === null) {
             return res
                 .status(400)
-                .json({ success: false, message: 'User exists, No password found' });
+                .json({});
         }
         const isMatch = await bcrypt.compare(password, user.password);

[Survived] BooleanLiteral
controllers/Auth.js:189:52
         }
         const isMatch = await bcrypt.compare(password, user.password);
         if (!isMatch) {
-            return res.status(400).json({ success: false, message: 'Incorrect password' });
+            return res.status(400).json({ success: true, message: 'Incorrect password' });
         }
         if (user.isAccountVerified == false) {

[Killed] ConditionalExpression
controllers/Auth.js:191:13
         if (!isMatch) {
             return res.status(400).json({ success: false, message: 'Incorrect password' });
         }
-        if (user.isAccountVerified == false) {
+        if (true) {
             return res
                 .status(401)
killedBy: signIn() controller signs in successfully (basic happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/Auth.js:191:13
         if (!isMatch) {
             return res.status(400).json({ success: false, message: 'Incorrect password' });
         }
-        if (user.isAccountVerified == false) {
+        if (false) {
             return res
                 .status(401)
killedBy: signIn() controller returns 401 for unverified account
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 200

Number of calls: 1

[Survived] StringLiteral
controllers/Auth.js:200:20
                 });
         }
         const token = jwt.sign({ id: user._id, email: user.email}, process.env.JWT_SECRET, { expiresIn: '7d' });
-        res.cookie('token', token, {
+        res.cookie("", token, {
             httpOnly: true,
             secure: true,

[Survived] BooleanLiteral
controllers/Auth.js:201:23
         }
         const token = jwt.sign({ id: user._id, email: user.email}, process.env.JWT_SECRET, { expiresIn: '7d' });
         res.cookie('token', token, {
-            httpOnly: true,
+            httpOnly: false,
             secure: true,
             sameSite: "None",

[Survived] ArithmeticOperator
controllers/Auth.js:204:21
             httpOnly: true,
             secure: true,
             sameSite: "None",
-            maxAge: 7 * 24 * 60 * 60 * 1000,
+            maxAge: 7 * 24 / 60 * 60 * 1000,
         });
 

[Survived] ArithmeticOperator
controllers/Auth.js:204:21
             httpOnly: true,
             secure: true,
             sameSite: "None",
-            maxAge: 7 * 24 * 60 * 60 * 1000,
+            maxAge: 7 * 24 * 60 * 60 / 1000,
         });
 

[Killed] BlockStatement
controllers/Auth.js:207:13
             maxAge: 7 * 24 * 60 * 60 * 1000,
         });
 
-        try {
-            await updateLoginStreak(user);
-        } catch (e) {
+        try {} catch (e) {
             console.error('Streak update failed during signin:', e);
         }
killedBy: signIn() controller covers diffDays === 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Survived] BlockStatement
controllers/Auth.js:209:21
 
         try {
             await updateLoginStreak(user);
-        } catch (e) {
-            console.error('Streak update failed during signin:', e);
-        }
+        } catch (e) {}
 
         return res.status(200).json({ success: true, message: 'Signin successful', user: user });

[Survived] StringLiteral
controllers/Auth.js:210:27
         try {
             await updateLoginStreak(user);
         } catch (e) {
-            console.error('Streak update failed during signin:', e);
+            console.error("", e);
         }
 

[Survived] BooleanLiteral
controllers/Auth.js:213:48
             console.error('Streak update failed during signin:', e);
         }
 
-        return res.status(200).json({ success: true, message: 'Signin successful', user: user });
+        return res.status(200).json({ success: false, message: 'Signin successful', user: user });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });

[Killed] BlockStatement
controllers/Auth.js:214:21
         }
 
         return res.status(200).json({ success: true, message: 'Signin successful', user: user });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: signIn() controller returns 500 if findOne throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/Auth.js:219:43
     }
 };
 
-export const logout = async (req, res) => {
-    try {
-        res.clearCookie('token', {
-            httpOnly: true,
-            secure: true,
-            sameSite: "None",
-        });
-        return res.status(200).json({ success: true, message: 'Logged out' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-};
+export const logout = async (req, res) => {};
 
 export const isAuthenticated = async (req, res) => {
killedBy: logout() controller clears token cookie and returns 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", {"httpOnly": true, "sameSite": "None", "secure": true}

Number of calls: 0

[Killed] BlockStatement
controllers/Auth.js:220:9
 };
 
 export const logout = async (req, res) => {
-    try {
-        res.clearCookie('token', {
-            httpOnly: true,
-            secure: true,
-            sameSite: "None",
-        });
-        return res.status(200).json({ success: true, message: 'Logged out' });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: logout() controller clears token cookie and returns 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", {"httpOnly": true, "sameSite": "None", "secure": true}

Number of calls: 0

[Killed] BooleanLiteral
controllers/Auth.js:222:23
 export const logout = async (req, res) => {
     try {
         res.clearCookie('token', {
-            httpOnly: true,
+            httpOnly: false,
             secure: true,
             sameSite: "None",
killedBy: logout() controller clears token cookie and returns 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "token",
  Object {
-   "httpOnly": true,

[Killed] BooleanLiteral
controllers/Auth.js:226:48
             secure: true,
             sameSite: "None",
         });
-        return res.status(200).json({ success: true, message: 'Logged out' });
+        return res.status(200).json({ success: false, message: 'Logged out' });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: logout() controller clears token cookie and returns 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Logged out",
-   "success": true,

[Killed] BlockStatement
controllers/Auth.js:227:21
             sameSite: "None",
         });
         return res.status(200).json({ success: true, message: 'Logged out' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: logout() controller returns 500 if clearCookie throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/Auth.js:233:9
 };
 
 export const isAuthenticated = async (req, res) => {
-    try {
-        const userId = req.userId;
-        let user = await UserModel.findById(userId);
-
-        if (!user) return res.status(404).json({ success: false, message: 'User not found' });
-
-        try {
-            user = await updateLoginStreak(user);
-        } catch (err) {
-            console.error('Streak update failed during isAuthenticated:', err);
-        }
-
-        const safe = {
-            name: user.name,
-            email: user.email,
-            streakCount: user.streakCount,
-            lastLoginDate: user.lastLoginDate,
-            maxStreak: user.maxStreak,
-            loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
-        };
-        return res.status(200).json({ success: true, user: safe });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: signIn() controller covers error inside isAuthenticated BEFORE updateLoginStreak runs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/Auth.js:237:59
         const userId = req.userId;
         let user = await UserModel.findById(userId);
 
-        if (!user) return res.status(404).json({ success: false, message: 'User not found' });
+        if (!user) return res.status(404).json({ success: true, message: 'User not found' });
 
         try {
killedBy: isAuthenticated() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User not found",
-   "success": false,

[Killed] ConditionalExpression
controllers/Auth.js:237:13
         const userId = req.userId;
         let user = await UserModel.findById(userId);
 
-        if (!user) return res.status(404).json({ success: false, message: 'User not found' });
+        if (false) return res.status(404).json({ success: false, message: 'User not found' });
 
         try {
killedBy: isAuthenticated() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/Auth.js:239:13
 
         if (!user) return res.status(404).json({ success: false, message: 'User not found' });
 
-        try {
-            user = await updateLoginStreak(user);
-        } catch (err) {
+        try {} catch (err) {
             console.error('Streak update failed during isAuthenticated:', err);
         }
killedBy: isAuthenticated() controller initializes loginDates if it is not an array
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] BlockStatement
controllers/Auth.js:241:23
 
         try {
             user = await updateLoginStreak(user);
-        } catch (err) {
-            console.error('Streak update failed during isAuthenticated:', err);
-        }
+        } catch (err) {}
 
         const safe = {

[Survived] StringLiteral
controllers/Auth.js:242:27
         try {
             user = await updateLoginStreak(user);
         } catch (err) {
-            console.error('Streak update failed during isAuthenticated:', err);
+            console.error("", err);
         }
 

[Killed] BooleanLiteral
controllers/Auth.js:253:48
             maxStreak: user.maxStreak,
             loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
         };
-        return res.status(200).json({ success: true, user: safe });
+        return res.status(200).json({ success: false, user: safe });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: isAuthenticated() controller returns user info successfully (200)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "success": true,

[Killed] BlockStatement
controllers/Auth.js:254:21
             loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
         };
         return res.status(200).json({ success: true, user: safe });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: signIn() controller covers error inside isAuthenticated BEFORE updateLoginStreak runs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/Auth.js:262:17
 export const sendResetToken = async (req, res) => {
     const { email } = req.validatedData;
 
-    if (!email) {
-        return res.json({ success: false, message: 'Email required' });
-    }
+    if (!email) {}
     try {
         const user = await UserModel.findOne({ email });
killedBy: sendResetToken() controller returns { success: false, message: 'Email required' } if email missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Email required",
+   "message": "User not found",

[Killed] BooleanLiteral
controllers/Auth.js:263:36
     const { email } = req.validatedData;
 
     if (!email) {
-        return res.json({ success: false, message: 'Email required' });
+        return res.json({ success: true, message: 'Email required' });
     }
     try {
killedBy: sendResetToken() controller returns { success: false, message: 'Email required' } if email missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Email required",
-   "success": false,

[Killed] StringLiteral
controllers/Auth.js:263:52
     const { email } = req.validatedData;
 
     if (!email) {
-        return res.json({ success: false, message: 'Email required' });
+        return res.json({ success: false, message: "" });
     }
     try {
killedBy: sendResetToken() controller returns { success: false, message: 'Email required' } if email missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Email required",
+   "message": "",

[Killed] ConditionalExpression
controllers/Auth.js:267:13
     }
     try {
         const user = await UserModel.findOne({ email });
-        if (!user) {
+        if (false) {
             return res.status(404).json({ success: false, message: 'User not found' });
         }
killedBy: sendResetToken() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Survived] ArithmeticOperator
controllers/Auth.js:273:72
         const resetToken = crypto.randomUUID();
         const update = await UserModel.updateOne(
             { email },
-            { resetToken: resetToken, resetTokenExpireAt: Date.now() + 1000 * 60 * 15 }
+            { resetToken: resetToken, resetTokenExpireAt: Date.now() + 1000 * 60 / 15 }
         );
 

[Survived] ArithmeticOperator
controllers/Auth.js:273:59
         const resetToken = crypto.randomUUID();
         const update = await UserModel.updateOne(
             { email },
-            { resetToken: resetToken, resetTokenExpireAt: Date.now() + 1000 * 60 * 15 }
+            { resetToken: resetToken, resetTokenExpireAt: Date.now() - 1000 * 60 * 15 }
         );
 

[Survived] ObjectLiteral
controllers/Auth.js:280:29
 
         const { subject, html } = passwordResetEmail(email, resetUrl);
 
-        const mailOptions = {
-            from: process.env.SENDGRID_SENDER_EMAIL,
-            to: email,
-            subject,
-            html,
-        };
+        const mailOptions = {};
 
         try {

[Killed] BooleanLiteral
controllers/Auth.js:295:26
         return res
             .status(200)
             .json({
-                success: true,
+                success: false,
                 message: 'Password reset token sent. Please check your email.',
             });
killedBy: sendResetToken() controller sends reset token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Password reset token sent. Please check your email.",
-   "success": true,

[Killed] StringLiteral
controllers/Auth.js:296:26
             .status(200)
             .json({
                 success: true,
-                message: 'Password reset token sent. Please check your email.',
+                message: "",
             });
     } catch (error) {
killedBy: sendResetToken() controller sends reset token successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Password reset token sent. Please check your email.",
+   "message": "",

[Killed] BlockStatement
controllers/Auth.js:307:9
     const { token: resetToken } = req.validatedData;
 
     // console.log(email);
-    try {
-        const user = await UserModel.findOne({ resetToken });
-        if (!user) {
-            return res.status(404).json({ success: false, message: 'Link is not valid' });
-        }
-        if (user.resetToken === '' || user.resetToken !== resetToken) {
-            return res.status(400).json({ success: false, message: 'Link is not valid' });
-        }
-        if (user.resetTokenExpireAt < Date.now()) {
-            user.resetToken = null;
-            user.resetTokenExpireAt = 0;
-            await user.save();
-            return res.json({ success: false, message: 'Link expired' });
-        }
-
-        return res
-            .status(200)
-            .json({ success: true, message: 'Enter new password', email: user.email });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: verifyResetToken() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404

Number of calls: 0

[Killed] ConditionalExpression
controllers/Auth.js:309:13
     // console.log(email);
     try {
         const user = await UserModel.findOne({ resetToken });
-        if (!user) {
+        if (false) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
killedBy: verifyResetToken() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:309:13
     // console.log(email);
     try {
         const user = await UserModel.findOne({ resetToken });
-        if (!user) {
+        if (user) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
killedBy: verifyResetToken() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ObjectLiteral
controllers/Auth.js:310:41
     try {
         const user = await UserModel.findOne({ resetToken });
         if (!user) {
-            return res.status(404).json({ success: false, message: 'Link is not valid' });
+            return res.status(404).json({});
         }
         if (user.resetToken === '' || user.resetToken !== resetToken) {
killedBy: verifyResetToken() controller returns 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Link is not valid",
-   "success": false,

[Killed] EqualityOperator
controllers/Auth.js:312:39
         if (!user) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
-        if (user.resetToken === '' || user.resetToken !== resetToken) {
+        if (user.resetToken === '' || user.resetToken === resetToken) {
             return res.status(400).json({ success: false, message: 'Link is not valid' });
         }
killedBy: verifyResetToken() controller returns 400 if token mismatch
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/Auth.js:312:39
         if (!user) {
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
-        if (user.resetToken === '' || user.resetToken !== resetToken) {
+        if (user.resetToken === '' || false) {
             return res.status(400).json({ success: false, message: 'Link is not valid' });
         }
killedBy: verifyResetToken() controller returns 400 if token mismatch
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:313:52
             return res.status(404).json({ success: false, message: 'Link is not valid' });
         }
         if (user.resetToken === '' || user.resetToken !== resetToken) {
-            return res.status(400).json({ success: false, message: 'Link is not valid' });
+            return res.status(400).json({ success: true, message: 'Link is not valid' });
         }
         if (user.resetTokenExpireAt < Date.now()) {
killedBy: verifyResetToken() controller returns 400 if resetToken === ''
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Link is not valid",
-   "success": false,
