[Killed] ConditionalExpression
controllers/Roadmap.js:21:25
         console.log(`Validating topic: ${userDescription}`);
         const guardPrompt = getTopicGuardPrompt(userDescription);
         const validationResponse = await generateWithGemini(guardPrompt);
-        const isValid = validationResponse.trim().toLowerCase() === 'true';
+        const isValid = false;
 
         if (!isValid) {
killedBy: generateRoadmap() generates a roadmap successfully (full happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
controllers/Roadmap.js:21:25
         console.log(`Validating topic: ${userDescription}`);
         const guardPrompt = getTopicGuardPrompt(userDescription);
         const validationResponse = await generateWithGemini(guardPrompt);
-        const isValid = validationResponse.trim().toLowerCase() === 'true';
+        const isValid = true;
 
         if (!isValid) {
killedBy: generateRoadmap() returns 400 for invalid topic
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/Roadmap.js:23:13
         const validationResponse = await generateWithGemini(guardPrompt);
         const isValid = validationResponse.trim().toLowerCase() === 'true';
 
-        if (!isValid) {
+        if (isValid) {
             console.warn(`Invalid topic rejected: ${userDescription}`);
             return res.status(400).json({
killedBy: generateRoadmap() generates a roadmap successfully (full happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] StringLiteral
controllers/Roadmap.js:24:26
         const isValid = validationResponse.trim().toLowerCase() === 'true';
 
         if (!isValid) {
-            console.warn(`Invalid topic rejected: ${userDescription}`);
+            console.warn(``);
             return res.status(400).json({
                 success: false,

[Killed] BlockStatement
controllers/Roadmap.js:45:13
 
    
         let roadmapData;
-        try {
-            const cleanedText = responseText
-                .trim()
-                .replace(/^```json\s*|\s*```$/g, '')
-                .trim();
-            roadmapData = JSON.parse(cleanedText);
-        } catch (parseError) {
+        try {} catch (parseError) {
             console.error('JSON Parse Error:', parseError);
             return res.status(500).json({
killedBy: generateRoadmap() generates a roadmap successfully (full happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Survived] MethodExpression
controllers/Roadmap.js:46:33
    
         let roadmapData;
         try {
-            const cleanedText = responseText
-                .trim()
-                .replace(/^```json\s*|\s*```$/g, '')
-                .trim();
+            const cleanedText = responseText.trim().replace(/^```json\s*|\s*```$/g, '');
             roadmapData = JSON.parse(cleanedText);
         } catch (parseError) {

[Survived] MethodExpression
controllers/Roadmap.js:46:33
    
         let roadmapData;
         try {
-            const cleanedText = responseText
-                .trim()
+            const cleanedText = responseText
                 .replace(/^```json\s*|\s*```$/g, '')
                 .trim();

[Killed] BlockStatement
controllers/Roadmap.js:51:30
                 .replace(/^```json\s*|\s*```$/g, '')
                 .trim();
             roadmapData = JSON.parse(cleanedText);
-        } catch (parseError) {
-            console.error('JSON Parse Error:', parseError);
-            return res.status(500).json({
-                success: false,
-                message: 'Failed to parse roadmap response. The AI response was not valid JSON.',
-            });
-        }
+        } catch (parseError) {}
 
         console.log(`Fetching articles... ${new Date().toLocaleString()}`);
killedBy: generateRoadmap() returns 500 if Gemini returns invalid JSON
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": StringContaining "Failed to parse", "success": false}
Received: {"message": "Cannot set properties of undefined (setting 'articles')", "success": false}

Number of calls: 1

[Survived] StringLiteral
controllers/Roadmap.js:59:21
             });
         }
 
-        console.log(`Fetching articles... ${new Date().toLocaleString()}`);
+        console.log(``);
         const articles = await getArticles(roadmapData);
         roadmapData.articles = articles;

[Survived] StringLiteral
controllers/Roadmap.js:63:21
         const articles = await getArticles(roadmapData);
         roadmapData.articles = articles;
 
-        console.log(`Fetching videos... ${new Date().toLocaleString()}`);
+        console.log(``);
         const videos = await getVideos(roadmapData);
         roadmapData.videos = videos;

[Survived] BooleanLiteral
controllers/Roadmap.js:69:52
 
         const user = await UserModel.findById(userId);
         if (!user) {
-            return res.status(404).json({ success: false, message: 'User not found' });
+            return res.status(404).json({ success: true, message: 'User not found' });
         }
         const newRoadmap = new RoadmapModel({

[Survived] ObjectLiteral
controllers/Roadmap.js:69:41
 
         const user = await UserModel.findById(userId);
         if (!user) {
-            return res.status(404).json({ success: false, message: 'User not found' });
+            return res.status(404).json({});
         }
         const newRoadmap = new RoadmapModel({

[Survived] ObjectLiteral
controllers/Roadmap.js:71:45
         if (!user) {
             return res.status(404).json({ success: false, message: 'User not found' });
         }
-        const newRoadmap = new RoadmapModel({
-            email: user.email,
-            roadmapData: roadmapData,
-            roadmapPhoto: Math.floor(Math.random() * 5) + 1,
-        });
+        const newRoadmap = new RoadmapModel({});
         await newRoadmap.save();
 

[Survived] ArithmeticOperator
controllers/Roadmap.js:74:27
         const newRoadmap = new RoadmapModel({
             email: user.email,
             roadmapData: roadmapData,
-            roadmapPhoto: Math.floor(Math.random() * 5) + 1,
+            roadmapPhoto: Math.floor(Math.random() * 5) - 1,
         });
         await newRoadmap.save();

[Survived] ArithmeticOperator
controllers/Roadmap.js:74:38
         const newRoadmap = new RoadmapModel({
             email: user.email,
             roadmapData: roadmapData,
-            roadmapPhoto: Math.floor(Math.random() * 5) + 1,
+            roadmapPhoto: Math.floor(Math.random() / 5) + 1,
         });
         await newRoadmap.save();

[Survived] ArithmeticOperator
controllers/Roadmap.js:80:36
 
         console.log('Roadmap generated successfully');
         const endTime = new Date().toLocaleString();
-        console.log("total time ", new Date(endTime) - new Date(initTime));
+        console.log("total time ", new Date(endTime) + new Date(initTime));
 
         return res.status(200).json({

[Killed] ObjectLiteral
controllers/Roadmap.js:82:37
         const endTime = new Date().toLocaleString();
         console.log("total time ", new Date(endTime) - new Date(initTime));
 
-        return res.status(200).json({
-            success: true,
-            data: newRoadmap,
-            message: 'Roadmap generated successfully',
-        });
+        return res.status(200).json({});
     } catch (error) {
         console.error('Error in generateRoadmap:', error);
killedBy: generateRoadmap() generates a roadmap successfully (full happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Roadmap generated successfully", "success": true}
Received: {}

Number of calls: 1

[Killed] StringLiteral
controllers/Roadmap.js:85:22
         return res.status(200).json({
             success: true,
             data: newRoadmap,
-            message: 'Roadmap generated successfully',
+            message: "",
         });
     } catch (error) {
killedBy: generateRoadmap() generates a roadmap successfully (full happy path)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Roadmap generated successfully", "success": true}
Received: {"data": undefined, "message": "", "success": true}

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:87:21
             data: newRoadmap,
             message: 'Roadmap generated successfully',
         });
-    } catch (error) {
-        console.error('Error in generateRoadmap:', error);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: generateRoadmap() still continues if getArticles fails (should not crash)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/Roadmap.js:88:23
             message: 'Roadmap generated successfully',
         });
     } catch (error) {
-        console.error('Error in generateRoadmap:', error);
+        console.error("", error);
         return res.status(500).json({ success: false, message: error.message });
     }

[Killed] BooleanLiteral
controllers/Roadmap.js:89:48
         });
     } catch (error) {
         console.error('Error in generateRoadmap:', error);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 };
killedBy: generateRoadmap() returns 500 if saving roadmap fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "save fail",
-   "success": false,

[Killed] BooleanLiteral
controllers/Roadmap.js:96:27
 export const generateQuiz = async (req, res) => {
     try {
         const {roadmapId, chapterId, subtopicId=null } = req.body;
-        if(!roadmapId ||  !chapterId){
+        if(!roadmapId ||  chapterId){
             console.log(req.body);
             return res.status(400).json({ success: false, message: "RoadmapId and ChapterId are required" });
killedBy: generateQuiz() mutation-proof tests returns 200 + saves a quiz successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
controllers/Roadmap.js:96:12
 export const generateQuiz = async (req, res) => {
     try {
         const {roadmapId, chapterId, subtopicId=null } = req.body;
-        if(!roadmapId ||  !chapterId){
+        if(roadmapId ||  !chapterId){
             console.log(req.body);
             return res.status(400).json({ success: false, message: "RoadmapId and ChapterId are required" });
killedBy: generateQuiz() mutation-proof tests returns 200 + saves a quiz successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
controllers/Roadmap.js:98:52
         const {roadmapId, chapterId, subtopicId=null } = req.body;
         if(!roadmapId ||  !chapterId){
             console.log(req.body);
-            return res.status(400).json({ success: false, message: "RoadmapId and ChapterId are required" });
+            return res.status(400).json({ success: true, message: "RoadmapId and ChapterId are required" });
         }
         const roadMap = await RoadmapModel.findById(roadmapId);
killedBy: generateQuiz() mutation-proof tests returns 400 when roadmapId/chapterId missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "RoadmapId and ChapterId are required",
-   "success": false,

[Killed] BooleanLiteral
controllers/Roadmap.js:101:12
             return res.status(400).json({ success: false, message: "RoadmapId and ChapterId are required" });
         }
         const roadMap = await RoadmapModel.findById(roadmapId);
-        if(!roadMap) {
+        if(roadMap) {
             return res.status(404).json({ success: false, message: "Roadmap not found" });
         }
killedBy: generateQuiz() mutation-proof tests returns 200 + saves a quiz successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/Roadmap.js:101:22
             return res.status(400).json({ success: false, message: "RoadmapId and ChapterId are required" });
         }
         const roadMap = await RoadmapModel.findById(roadmapId);
-        if(!roadMap) {
-            return res.status(404).json({ success: false, message: "Roadmap not found" });
-        }
+        if(!roadMap) {}
 
         const prompt = quizPrompt(roadMap, chapterId, subtopicId);
killedBy: generateQuiz() mutation-proof tests returns 404 when RoadmapModel.findById returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Roadmap.js:102:52
         }
         const roadMap = await RoadmapModel.findById(roadmapId);
         if(!roadMap) {
-            return res.status(404).json({ success: false, message: "Roadmap not found" });
+            return res.status(404).json({ success: true, message: "Roadmap not found" });
         }
 
killedBy: generateQuiz() mutation-proof tests returns 404 when RoadmapModel.findById returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Roadmap not found",
-   "success": false,

[Survived] MethodExpression
controllers/Roadmap.js:108:25
         const prompt = quizPrompt(roadMap, chapterId, subtopicId);
         const quiz = await generateWithGemini(prompt);
 
-        const cleaned = quiz
-            .replace(/```json/gi, "")
-            .replace(/```/g, "")
-            .trim();
+        const cleaned = quiz.replace(/```json/gi, "").replace(/```/g, "");
 
         let quizJson;

[Killed] StringLiteral
controllers/Roadmap.js:109:35
         const quiz = await generateWithGemini(prompt);
 
         const cleaned = quiz
-            .replace(/```json/gi, "")
+            .replace(/```json/gi, "Stryker was here!")
             .replace(/```/g, "")
             .trim();
killedBy: generateQuiz() mutation-proof tests parses JSON when wrapped inside markdown code fences
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:115:13
 
         let quizJson;
 
-        try {
-            quizJson = JSON.parse(cleaned);
-        } catch (err) {
+        try {} catch (err) {
             return res.status(500).json({success: false, message: "Internal server error"})
         }
killedBy: generateQuiz() mutation-proof tests returns 500 when JSON.parse fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500
Received: 200

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:117:23
 
         try {
             quizJson = JSON.parse(cleaned);
-        } catch (err) {
-            return res.status(500).json({success: false, message: "Internal server error"})
-        }
+        } catch (err) {}
 
         console.log("Quiz generated: ", quizJson);
killedBy: generateQuiz() mutation-proof tests returns 500 when JSON.parse fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Roadmap.js:118:51
         try {
             quizJson = JSON.parse(cleaned);
         } catch (err) {
-            return res.status(500).json({success: false, message: "Internal server error"})
+            return res.status(500).json({success: true, message: "Internal server error"})
         }
 
killedBy: generateQuiz() mutation-proof tests returns 500 when JSON.parse fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Internal server error",
-   "success": false,

[Killed] ObjectLiteral
controllers/Roadmap.js:118:41
         try {
             quizJson = JSON.parse(cleaned);
         } catch (err) {
-            return res.status(500).json({success: false, message: "Internal server error"})
+            return res.status(500).json({})
         }
 
killedBy: generateQuiz() mutation-proof tests returns 500 when JSON.parse fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Internal server error",
-   "success": false,

[Survived] ObjectLiteral
controllers/Roadmap.js:122:39
         }
 
         console.log("Quiz generated: ", quizJson);
-        const newQuiz = new QuizModel({
-            email: req.email,
-            roadmapId: roadmapId,
-            chapterId: chapterId,
-            subtopicId: subtopicId || "general",
-            quiz: quizJson,
-        });
+        const newQuiz = new QuizModel({});
         await newQuiz.save();
 

[Survived] LogicalOperator
controllers/Roadmap.js:126:25
             email: req.email,
             roadmapId: roadmapId,
             chapterId: chapterId,
-            subtopicId: subtopicId || "general",
+            subtopicId: subtopicId && "general",
             quiz: quizJson,
         });

[Survived] ConditionalExpression
controllers/Roadmap.js:126:25
             email: req.email,
             roadmapId: roadmapId,
             chapterId: chapterId,
-            subtopicId: subtopicId || "general",
+            subtopicId: false,
             quiz: quizJson,
         });

[Killed] BooleanLiteral
controllers/Roadmap.js:131:48
         });
         await newQuiz.save();
 
-        return res.status(200).json({ success: true, data: quizJson, message: "Quiz generated successfully" });
+        return res.status(200).json({ success: false, data: quizJson, message: "Quiz generated successfully" });
 
     }catch(error) {
killedBy: generateQuiz() mutation-proof tests returns 200 + saves a quiz successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Quiz generated successfully", "success": true}
Received: {"data": [{"q": "What is JS?"}], "message": "Quiz generated successfully", "success": false}

Number of calls: 1

[Killed] ObjectLiteral
controllers/Roadmap.js:131:37
         });
         await newQuiz.save();
 
-        return res.status(200).json({ success: true, data: quizJson, message: "Quiz generated successfully" });
+        return res.status(200).json({});
 
     }catch(error) {
killedBy: generateQuiz() mutation-proof tests returns 200 + saves a quiz successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Quiz generated successfully", "success": true}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:133:19
 
         return res.status(200).json({ success: true, data: quizJson, message: "Quiz generated successfully" });
 
-    }catch(error) {
-        console.log("Error while generating quiz: ", error);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    }catch(error) {}
 }
 
killedBy: generateQuiz() mutation-proof tests returns 500 when QuizModel.save() fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/Roadmap.js:135:48
 
     }catch(error) {
         console.log("Error while generating quiz: ", error);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 }
killedBy: generateQuiz() mutation-proof tests returns 500 when QuizModel.save() fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "save fail",
-   "success": false,

[Killed] BlockStatement
controllers/Roadmap.js:139:46
     }
 }
 
-export const getQuizzes = async(req, res) => {
-    try {
-        const {email} = req;
-        const { roadmapId, chapterId, subtopicId } = req.body;
-        const quizzes = await QuizModel.find({
-            email,
-            roadmapId: roadmapId,
-            chapterId,
-            subtopicId: subtopicId,
-        });
-        return res.status(200).json({ success: true, data: quizzes, message: "Quizzes fetched successfully" });
-    }catch(error){
-        return res.status(500).json({ success: false, message: error.message });
-    }
-}
+export const getQuizzes = async(req, res) => {}
 
 export const getUserRoadmaps = async (req, res) => {
killedBy: getQuizzes() high-coverage tests fetches quizzes successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"chapterId": "1", "email": "user@gmail.com", "roadmapId": "road1", "subtopicId": "2"}

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:140:9
 }
 
 export const getQuizzes = async(req, res) => {
-    try {
-        const {email} = req;
-        const { roadmapId, chapterId, subtopicId } = req.body;
-        const quizzes = await QuizModel.find({
-            email,
-            roadmapId: roadmapId,
-            chapterId,
-            subtopicId: subtopicId,
-        });
-        return res.status(200).json({ success: true, data: quizzes, message: "Quizzes fetched successfully" });
-    }catch(error){
+    try {}catch(error){
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: getQuizzes() high-coverage tests fetches quizzes successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"chapterId": "1", "email": "user@gmail.com", "roadmapId": "road1", "subtopicId": "2"}

Number of calls: 0

[Killed] ObjectLiteral
controllers/Roadmap.js:143:46
     try {
         const {email} = req;
         const { roadmapId, chapterId, subtopicId } = req.body;
-        const quizzes = await QuizModel.find({
-            email,
-            roadmapId: roadmapId,
-            chapterId,
-            subtopicId: subtopicId,
-        });
+        const quizzes = await QuizModel.find({});
         return res.status(200).json({ success: true, data: quizzes, message: "Quizzes fetched successfully" });
     }catch(error){
killedBy: getQuizzes() high-coverage tests fetches quizzes successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "chapterId": "1",
-   "email": "user@gmail.com",

[Killed] BooleanLiteral
controllers/Roadmap.js:149:48
             chapterId,
             subtopicId: subtopicId,
         });
-        return res.status(200).json({ success: true, data: quizzes, message: "Quizzes fetched successfully" });
+        return res.status(200).json({ success: false, data: quizzes, message: "Quizzes fetched successfully" });
     }catch(error){
         return res.status(500).json({ success: false, message: error.message });
killedBy: getQuizzes() high-coverage tests fetches quizzes successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,7 +6,7 @@
      Object {
        "id": "q2",

[Killed] BlockStatement
controllers/Roadmap.js:150:18
             subtopicId: subtopicId,
         });
         return res.status(200).json({ success: true, data: quizzes, message: "Quizzes fetched successfully" });
-    }catch(error){
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    }catch(error){}
 }
 
killedBy: getQuizzes() high-coverage tests handles database errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/Roadmap.js:151:48
         });
         return res.status(200).json({ success: true, data: quizzes, message: "Quizzes fetched successfully" });
     }catch(error){
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 }
killedBy: getQuizzes() high-coverage tests handles database errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "DB Error",
-   "success": false,

[Killed] BlockStatement
controllers/Roadmap.js:155:52
     }
 }
 
-export const getUserRoadmaps = async (req, res) => {
-    try {
-        const { email } = req;
-        const roadmaps = await RoadmapModel.find({ email })
-            .sort({ isPinned: -1, createdAt: -1 });  
-
-        return res
-            .status(200)
-            .json({ success: true, data: roadmaps, message: 'Roadmaps fetched successfully' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-};
+export const getUserRoadmaps = async (req, res) => {};
 
 export const deleteRoadmap = async (req, res) => {
killedBy: getUserRoadmaps() high-coverage tests returns user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "user@gmail.com"}

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:156:9
 }
 
 export const getUserRoadmaps = async (req, res) => {
-    try {
-        const { email } = req;
-        const roadmaps = await RoadmapModel.find({ email })
-            .sort({ isPinned: -1, createdAt: -1 });  
-
-        return res
-            .status(200)
-            .json({ success: true, data: roadmaps, message: 'Roadmaps fetched successfully' });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: getUserRoadmaps() high-coverage tests returns user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"email": "user@gmail.com"}

Number of calls: 0

[Killed] MethodExpression
controllers/Roadmap.js:158:32
 export const getUserRoadmaps = async (req, res) => {
     try {
         const { email } = req;
-        const roadmaps = await RoadmapModel.find({ email })
-            .sort({ isPinned: -1, createdAt: -1 });  
+        const roadmaps = await RoadmapModel.find({
+  email
+});  
 
         return res
killedBy: getUserRoadmaps() high-coverage tests returns user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"createdAt": -1, "isPinned": -1}

Number of calls: 0

[Killed] ObjectLiteral
controllers/Roadmap.js:158:50
 export const getUserRoadmaps = async (req, res) => {
     try {
         const { email } = req;
-        const roadmaps = await RoadmapModel.find({ email })
+        const roadmaps = await RoadmapModel.find({})
             .sort({ isPinned: -1, createdAt: -1 });  
 
killedBy: getUserRoadmaps() high-coverage tests returns user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "user@gmail.com",
- }

[Killed] UnaryOperator
controllers/Roadmap.js:159:46
     try {
         const { email } = req;
         const roadmaps = await RoadmapModel.find({ email })
-            .sort({ isPinned: -1, createdAt: -1 });  
+            .sort({ isPinned: -1, createdAt: +1 });  
 
         return res
killedBy: getUserRoadmaps() high-coverage tests returns user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "createdAt": -1,
+   "createdAt": 1,

[Killed] UnaryOperator
controllers/Roadmap.js:159:31
     try {
         const { email } = req;
         const roadmaps = await RoadmapModel.find({ email })
-            .sort({ isPinned: -1, createdAt: -1 });  
+            .sort({ isPinned: +1, createdAt: -1 });  
 
         return res
killedBy: getUserRoadmaps() high-coverage tests returns user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "createdAt": -1,
-   "isPinned": -1,

[Killed] BooleanLiteral
controllers/Roadmap.js:163:30
 
         return res
             .status(200)
-            .json({ success: true, data: roadmaps, message: 'Roadmaps fetched successfully' });
+            .json({ success: false, data: roadmaps, message: 'Roadmaps fetched successfully' });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: getUserRoadmaps() high-coverage tests returns user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,7 +3,7 @@
      Object {
        "id": 1,

[Killed] BlockStatement
controllers/Roadmap.js:164:21
         return res
             .status(200)
             .json({ success: true, data: roadmaps, message: 'Roadmaps fetched successfully' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: getUserRoadmaps() high-coverage tests handles errors thrown inside sort()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
