[Killed] ConditionalExpression
controllers/Auth.js:315:13
         if (user.resetToken === '' || user.resetToken !== resetToken) {
             return res.status(400).json({ success: false, message: 'Link is not valid' });
         }
-        if (user.resetTokenExpireAt < Date.now()) {
+        if (true) {
             user.resetToken = null;
             user.resetTokenExpireAt = 0;
killedBy: verifyResetToken() controller returns 200 and email when token is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/Auth.js:315:51
         if (user.resetToken === '' || user.resetToken !== resetToken) {
             return res.status(400).json({ success: false, message: 'Link is not valid' });
         }
-        if (user.resetTokenExpireAt < Date.now()) {
-            user.resetToken = null;
-            user.resetTokenExpireAt = 0;
-            await user.save();
-            return res.json({ success: false, message: 'Link expired' });
-        }
+        if (user.resetTokenExpireAt < Date.now()) {}
 
         return res
killedBy: verifyResetToken() controller returns expired message and resets token on expired resetToken
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "mock-token"

[Killed] BooleanLiteral
controllers/Auth.js:319:40
             user.resetToken = null;
             user.resetTokenExpireAt = 0;
             await user.save();
-            return res.json({ success: false, message: 'Link expired' });
+            return res.json({ success: true, message: 'Link expired' });
         }
 
killedBy: verifyResetToken() controller returns expired message and resets token on expired resetToken
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Link expired",
-   "success": false,

[Killed] BooleanLiteral
controllers/Auth.js:324:30
 
         return res
             .status(200)
-            .json({ success: true, message: 'Enter new password', email: user.email });
+            .json({ success: false, message: 'Enter new password', email: user.email });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: verifyResetToken() controller returns 200 and email when token is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "email": "test@example.com",
    "message": "Enter new password",

[Killed] ObjectLiteral
controllers/Auth.js:324:19
 
         return res
             .status(200)
-            .json({ success: true, message: 'Enter new password', email: user.email });
+            .json({});
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: verifyResetToken() controller returns 200 and email when token is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "test@example.com",
-   "message": "Enter new password",

[Killed] BlockStatement
controllers/Auth.js:325:21
         return res
             .status(200)
             .json({ success: true, message: 'Enter new password', email: user.email });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: verifyResetToken() controller returns 500 when DB findOne throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/Auth.js:332:9
 
 export const resetPassword = async (req, res) => {
     const { email, newPassword, token: resetToken } = req.validatedData;
-    try {
-        const user = await UserModel.findOne({ email });
-        if (!user) {
-            return res.status(404).json({ success: false, message: 'User not found.' });
-        }
-
-        if (user.resetToken === '' || user.resetToken !== resetToken) {
-            return res.status(400).json({ success: false, message: 'Invalid Link.' });
-        }
-        if (user.resetTokenExpireAt < Date.now()) {
-            user.resetToken = null;
-            user.resetTokenExpireAt = 0;
-            await user.save();
-            return res.json({ success: false, message: 'Link expired' });
-        }
-
-        user.resetToken = null;
-        user.resetTokenExpireAt = 0;
-        user.password = await bcrypt.hash(newPassword, 10);
-        await user.save();
-        return res
-            .status(200)
-            .json({ success: true, message: 'Password has been reset successfully.' });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: resetPassword() controller returns 404 if user is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404

Number of calls: 0

[Killed] ConditionalExpression
controllers/Auth.js:334:13
     const { email, newPassword, token: resetToken } = req.validatedData;
     try {
         const user = await UserModel.findOne({ email });
-        if (!user) {
+        if (true) {
             return res.status(404).json({ success: false, message: 'User not found.' });
         }
killedBy: resetPassword() controller returns 400 if resetToken === ''
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:335:52
     try {
         const user = await UserModel.findOne({ email });
         if (!user) {
-            return res.status(404).json({ success: false, message: 'User not found.' });
+            return res.status(404).json({ success: true, message: 'User not found.' });
         }
 
killedBy: resetPassword() controller returns 404 if user is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User not found.",
-   "success": false,

[Killed] ObjectLiteral
controllers/Auth.js:335:41
     try {
         const user = await UserModel.findOne({ email });
         if (!user) {
-            return res.status(404).json({ success: false, message: 'User not found.' });
+            return res.status(404).json({});
         }
 
killedBy: resetPassword() controller returns 404 if user is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "User not found.",
-   "success": false,

[Killed] LogicalOperator
controllers/Auth.js:338:13
             return res.status(404).json({ success: false, message: 'User not found.' });
         }
 
-        if (user.resetToken === '' || user.resetToken !== resetToken) {
+        if (user.resetToken === '' && user.resetToken !== resetToken) {
             return res.status(400).json({ success: false, message: 'Invalid Link.' });
         }
killedBy: resetPassword() controller returns 400 if token mismatch
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] ConditionalExpression
controllers/Auth.js:338:39
             return res.status(404).json({ success: false, message: 'User not found.' });
         }
 
-        if (user.resetToken === '' || user.resetToken !== resetToken) {
+        if (user.resetToken === '' || false) {
             return res.status(400).json({ success: false, message: 'Invalid Link.' });
         }
killedBy: resetPassword() controller returns 400 if token mismatch
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Auth.js:339:52
         }
 
         if (user.resetToken === '' || user.resetToken !== resetToken) {
-            return res.status(400).json({ success: false, message: 'Invalid Link.' });
+            return res.status(400).json({ success: true, message: 'Invalid Link.' });
         }
         if (user.resetTokenExpireAt < Date.now()) {
killedBy: resetPassword() controller returns 400 if resetToken === ''
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid Link.",
-   "success": false,

[Killed] ConditionalExpression
controllers/Auth.js:341:13
         if (user.resetToken === '' || user.resetToken !== resetToken) {
             return res.status(400).json({ success: false, message: 'Invalid Link.' });
         }
-        if (user.resetTokenExpireAt < Date.now()) {
+        if (false) {
             user.resetToken = null;
             user.resetTokenExpireAt = 0;
killedBy: resetPassword() controller clears resetToken and returns expired message when token is expired
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Link expired",
-   "success": false,

[Killed] EqualityOperator
controllers/Auth.js:341:13
         if (user.resetToken === '' || user.resetToken !== resetToken) {
             return res.status(400).json({ success: false, message: 'Invalid Link.' });
         }
-        if (user.resetTokenExpireAt < Date.now()) {
+        if (user.resetTokenExpireAt >= Date.now()) {
             user.resetToken = null;
             user.resetTokenExpireAt = 0;
killedBy: resetPassword() controller clears resetToken and returns expired message when token is expired
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Link expired",
-   "success": false,

[Killed] BooleanLiteral
controllers/Auth.js:354:30
         await user.save();
         return res
             .status(200)
-            .json({ success: true, message: 'Password has been reset successfully.' });
+            .json({ success: false, message: 'Password has been reset successfully.' });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: resetPassword() controller successfully resets password when token is valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Password has been reset successfully.",
-   "success": true,

[Killed] BlockStatement
controllers/Auth.js:355:21
         return res
             .status(200)
             .json({ success: true, message: 'Password has been reset successfully.' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: resetPassword() controller returns 500 when findOne throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
