[Killed] BlockStatement
controllers/Roadmap.js:169:50
     }
 };
 
-export const deleteRoadmap = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-        console.log('Deleting roadmap with ID:', roadmapId);
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-
-        if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
-        }
-
-        await RoadmapModel.deleteOne({ _id: roadmapId });
-        await NoteModel.deleteMany({ roadmapId: roadmapId });
-        return res.status(200).json({ success: true, message: 'Roadmap deleted successfully' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-};
+export const deleteRoadmap = async (req, res) => {};
 
 export const getRoadmapById = async (req, res) => {
killedBy: deleteRoadmap() high-coverage tests deletes roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "123"}

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:170:9
 };
 
 export const deleteRoadmap = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-        console.log('Deleting roadmap with ID:', roadmapId);
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-
-        if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
-        }
-
-        await RoadmapModel.deleteOne({ _id: roadmapId });
-        await NoteModel.deleteMany({ roadmapId: roadmapId });
-        return res.status(200).json({ success: true, message: 'Roadmap deleted successfully' });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: deleteRoadmap() high-coverage tests deletes roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "123"}

Number of calls: 0

[Survived] StringLiteral
controllers/Roadmap.js:172:21
 export const deleteRoadmap = async (req, res) => {
     try {
         const { roadmapId } = req.body;
-        console.log('Deleting roadmap with ID:', roadmapId);
+        console.log("", roadmapId);
 
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });

[Killed] ObjectLiteral
controllers/Roadmap.js:174:52
         const { roadmapId } = req.body;
         console.log('Deleting roadmap with ID:', roadmapId);
 
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
+        const roadmap = await RoadmapModel.findOne({});
 
         if (!roadmap) {
killedBy: deleteRoadmap() high-coverage tests deletes roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "_id": "123",
- }

[Killed] BlockStatement
controllers/Roadmap.js:176:23
 
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
 
-        if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
-        }
+        if (!roadmap) {}
 
         await RoadmapModel.deleteOne({ _id: roadmapId });
killedBy: deleteRoadmap() high-coverage tests returns 404 if roadmap not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Roadmap.js:176:13
 
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
 
-        if (!roadmap) {
+        if (roadmap) {
             return res.status(404).json({ success: false, message: 'Roadmap not found' });
         }
killedBy: deleteRoadmap() high-coverage tests deletes roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "123"}

Number of calls: 0

[Killed] BooleanLiteral
controllers/Roadmap.js:177:52
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
 
         if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
+            return res.status(404).json({ success: true, message: 'Roadmap not found' });
         }
 
killedBy: deleteRoadmap() high-coverage tests returns 404 if roadmap not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Roadmap not found",
-   "success": false,

[Killed] BooleanLiteral
controllers/Roadmap.js:182:48
 
         await RoadmapModel.deleteOne({ _id: roadmapId });
         await NoteModel.deleteMany({ roadmapId: roadmapId });
-        return res.status(200).json({ success: true, message: 'Roadmap deleted successfully' });
+        return res.status(200).json({ success: false, message: 'Roadmap deleted successfully' });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: deleteRoadmap() high-coverage tests deletes roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Roadmap deleted successfully",
-   "success": true,

[Killed] BlockStatement
controllers/Roadmap.js:183:21
         await RoadmapModel.deleteOne({ _id: roadmapId });
         await NoteModel.deleteMany({ roadmapId: roadmapId });
         return res.status(200).json({ success: true, message: 'Roadmap deleted successfully' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: deleteRoadmap() high-coverage tests handles findOne() errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
controllers/Roadmap.js:184:37
         await NoteModel.deleteMany({ roadmapId: roadmapId });
         return res.status(200).json({ success: true, message: 'Roadmap deleted successfully' });
     } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({});
     }
 };
killedBy: deleteRoadmap() high-coverage tests handles findOne() errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "DB error",
-   "success": false,

[Killed] BlockStatement
controllers/Roadmap.js:188:51
     }
 };
 
-export const getRoadmapById = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-
-        if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
-        }
-
-        return res
-            .status(200)
-            .json({ success: true, data: roadmap, message: 'Roadmap fetched successfully' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-};
+export const getRoadmapById = async (req, res) => {};
 
 export const getNotesForRoadmap = async (req, res) => {
killedBy: getRoadmapById() mutation-proof tests should fetch a roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "123"}

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:189:9
 };
 
 export const getRoadmapById = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-
-        if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
-        }
-
-        return res
-            .status(200)
-            .json({ success: true, data: roadmap, message: 'Roadmap fetched successfully' });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: getRoadmapById() mutation-proof tests should fetch a roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"_id": "123"}

Number of calls: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:194:13
 
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
 
-        if (!roadmap) {
+        if (false) {
             return res.status(404).json({ success: false, message: 'Roadmap not found' });
         }
killedBy: getRoadmapById() mutation-proof tests should return 404 if roadmap not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
controllers/Roadmap.js:200:30
 
         return res
             .status(200)
-            .json({ success: true, data: roadmap, message: 'Roadmap fetched successfully' });
+            .json({ success: false, data: roadmap, message: 'Roadmap fetched successfully' });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: getRoadmapById() mutation-proof tests should fetch a roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "id": "123",

[Killed] StringLiteral
controllers/Roadmap.js:200:60
 
         return res
             .status(200)
-            .json({ success: true, data: roadmap, message: 'Roadmap fetched successfully' });
+            .json({ success: true, data: roadmap, message: "" });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: getRoadmapById() mutation-proof tests should fetch a roadmap successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "id": "123",

[Killed] BlockStatement
controllers/Roadmap.js:201:21
         return res
             .status(200)
             .json({ success: true, data: roadmap, message: 'Roadmap fetched successfully' });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: getRoadmapById() mutation-proof tests should return 500 when roadmapId is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:206:55
     }
 };
 
-export const getNotesForRoadmap = async (req, res) => {
-    try {
-        const { roadmapId } = req.params;
-        const userId = req.userId;
-
-        const notes = await NoteModel.find({ userId, roadmapId });
-
-        const notesMap = notes.reduce((acc, note) => {
-            const key = `${note.moduleId}:${note.subtopicId}`;
-            acc[key] = note.content;
-            return acc;
-        }, {});
-
-        return res.status(200).json({ success: true, data: notesMap });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-};
+export const getNotesForRoadmap = async (req, res) => {};
 
 export const saveNote = async (req, res) => {
killedBy: getNotesForRoadmap() method should fetch notes and map them correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:207:9
 };
 
 export const getNotesForRoadmap = async (req, res) => {
-    try {
-        const { roadmapId } = req.params;
-        const userId = req.userId;
-
-        const notes = await NoteModel.find({ userId, roadmapId });
-
-        const notesMap = notes.reduce((acc, note) => {
-            const key = `${note.moduleId}:${note.subtopicId}`;
-            acc[key] = note.content;
-            return acc;
-        }, {});
-
-        return res.status(200).json({ success: true, data: notesMap });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: getNotesForRoadmap() method should fetch notes and map them correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Survived] BlockStatement
controllers/Roadmap.js:213:54
 
         const notes = await NoteModel.find({ userId, roadmapId });
 
-        const notesMap = notes.reduce((acc, note) => {
-            const key = `${note.moduleId}:${note.subtopicId}`;
-            acc[key] = note.content;
-            return acc;
-        }, {});
+        const notesMap = notes.reduce((acc, note) => {}, {});
 
         return res.status(200).json({ success: true, data: notesMap });

[Survived] BooleanLiteral
controllers/Roadmap.js:219:48
             return acc;
         }, {});
 
-        return res.status(200).json({ success: true, data: notesMap });
+        return res.status(200).json({ success: false, data: notesMap });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });

[Killed] BlockStatement
controllers/Roadmap.js:220:21
         }, {});
 
         return res.status(200).json({ success: true, data: notesMap });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: getNotesForRoadmap() method should handle errors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:225:45
     }
 };
 
-export const saveNote = async (req, res) => {
-    try {
-        const { roadmapId, subtopicId, moduleId, content } = req.body;
-        const userId = req.userId;
-
-        const updatedNote = await NoteModel.findOneAndUpdate(
-            { userId, roadmapId, subtopicId, moduleId },
-            { userId, roadmapId, subtopicId, moduleId, content },
-            { new: true, upsert: true }
-        );
-
-        return res.status(200).json({ success: true, data: updatedNote, message: 'Note saved' });
-    } catch (error) {
-        console.error('Error saving note:', error);
-        return res.status(500).json({ success: false, message: error.message });
-    }
-};
+export const saveNote = async (req, res) => {};
 
 export const generateSubtopicSummary = async (req, res) => {
killedBy: saveNote() mutation-proof tests should save/update note successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"}, {"content": "my note", "moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"}, {"new": true, "upsert": true}

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:226:9
 };
 
 export const saveNote = async (req, res) => {
-    try {
-        const { roadmapId, subtopicId, moduleId, content } = req.body;
-        const userId = req.userId;
-
-        const updatedNote = await NoteModel.findOneAndUpdate(
-            { userId, roadmapId, subtopicId, moduleId },
-            { userId, roadmapId, subtopicId, moduleId, content },
-            { new: true, upsert: true }
-        );
-
-        return res.status(200).json({ success: true, data: updatedNote, message: 'Note saved' });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error saving note:', error);
         return res.status(500).json({ success: false, message: error.message });
killedBy: saveNote() mutation-proof tests should save/update note successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"}, {"content": "my note", "moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"}, {"new": true, "upsert": true}

Number of calls: 0

[Killed] ObjectLiteral
controllers/Roadmap.js:232:13
 
         const updatedNote = await NoteModel.findOneAndUpdate(
             { userId, roadmapId, subtopicId, moduleId },
-            { userId, roadmapId, subtopicId, moduleId, content },
+            {},
             { new: true, upsert: true }
         );
killedBy: saveNote() mutation-proof tests should save/update note successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"},
- Object {
-   "content": "my note",

[Killed] BooleanLiteral
controllers/Roadmap.js:233:34
         const updatedNote = await NoteModel.findOneAndUpdate(
             { userId, roadmapId, subtopicId, moduleId },
             { userId, roadmapId, subtopicId, moduleId, content },
-            { new: true, upsert: true }
+            { new: true, upsert: false }
         );
 
killedBy: saveNote() mutation-proof tests should save/update note successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"},
  {"content": "my note", "moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"},
  Object {

[Killed] BooleanLiteral
controllers/Roadmap.js:233:20
         const updatedNote = await NoteModel.findOneAndUpdate(
             { userId, roadmapId, subtopicId, moduleId },
             { userId, roadmapId, subtopicId, moduleId, content },
-            { new: true, upsert: true }
+            { new: false, upsert: true }
         );
 
killedBy: saveNote() mutation-proof tests should save/update note successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"},
  {"content": "my note", "moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"},
  Object {

[Killed] BooleanLiteral
controllers/Roadmap.js:236:48
             { new: true, upsert: true }
         );
 
-        return res.status(200).json({ success: true, data: updatedNote, message: 'Note saved' });
+        return res.status(200).json({ success: false, data: updatedNote, message: 'Note saved' });
     } catch (error) {
         console.error('Error saving note:', error);
killedBy: saveNote() mutation-proof tests should save/update note successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Note saved", "success": true}
Received: {"data": {"content": "my note", "moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"}, "message": "Note saved", "success": false}

Number of calls: 1

[Killed] StringLiteral
controllers/Roadmap.js:236:82
             { new: true, upsert: true }
         );
 
-        return res.status(200).json({ success: true, data: updatedNote, message: 'Note saved' });
+        return res.status(200).json({ success: true, data: updatedNote, message: "" });
     } catch (error) {
         console.error('Error saving note:', error);
killedBy: saveNote() mutation-proof tests should save/update note successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Note saved", "success": true}
Received: {"data": {"content": "my note", "moduleId": "3", "roadmapId": "road1", "subtopicId": "2", "userId": "user123"}, "message": "", "success": true}

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:237:21
         );
 
         return res.status(200).json({ success: true, data: updatedNote, message: 'Note saved' });
-    } catch (error) {
-        console.error('Error saving note:', error);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: saveNote() mutation-proof tests should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/Roadmap.js:239:48
         return res.status(200).json({ success: true, data: updatedNote, message: 'Note saved' });
     } catch (error) {
         console.error('Error saving note:', error);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 };
killedBy: saveNote() mutation-proof tests should return 500 on DB error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "DB fail",
-   "success": false,

[Killed] ConditionalExpression
controllers/Roadmap.js:248:13
 
         const { roadmapId, subtopicId, chapterId , personalization } = req.body;
 
-        if (!roadmapId || !subtopicId || !chapterId) {
+        if (false) {
             return res.status(400).json({
                 success: false,
killedBy: generateSubtopicSummary() mutation-proof tests should return 400 if required fields are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/Roadmap.js:248:27
 
         const { roadmapId, subtopicId, chapterId , personalization } = req.body;
 
-        if (!roadmapId || !subtopicId || !chapterId) {
+        if (!roadmapId || subtopicId || !chapterId) {
             return res.status(400).json({
                 success: false,
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0

[Killed] ObjectLiteral
controllers/Roadmap.js:249:41
         const { roadmapId, subtopicId, chapterId , personalization } = req.body;
 
         if (!roadmapId || !subtopicId || !chapterId) {
-            return res.status(400).json({
-                success: false,
-                message: 'Please provide roadmapId, subtopicId, and chapterId.',
-            });
+            return res.status(400).json({});
         }
 
killedBy: generateSubtopicSummary() mutation-proof tests should return 400 if required fields are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {}

Number of calls: 1

[Killed] ConditionalExpression
controllers/Roadmap.js:257:13
 
         const roadmap = await RoadmapModel.findById(roadmapId);
 
-        if (!roadmap) {
+        if (true) {
             return res.status(404).json({ success: false, message: 'Roadmap not found' });
         }
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0

[Survived] ArrowFunction
controllers/Roadmap.js:265:115
         const chapterIdNum = parseInt(chapterId);
         const subtopicIdNum = parseInt(subtopicId);
 
-        console.log('Looking for chapter:', chapterIdNum, 'Available chapters:', roadmap.roadmapData.chapters.map(ch => ch.id));
+        console.log('Looking for chapter:', chapterIdNum, 'Available chapters:', roadmap.roadmapData.chapters.map(() => undefined));
         if(chapterIdNum > roadmap.roadmapData.chapters.length){
             return res.status(404).json({ success: false, message: 'Chapter not found' });

[Killed] EqualityOperator
controllers/Roadmap.js:266:12
         const subtopicIdNum = parseInt(subtopicId);
 
         console.log('Looking for chapter:', chapterIdNum, 'Available chapters:', roadmap.roadmapData.chapters.map(ch => ch.id));
-        if(chapterIdNum > roadmap.roadmapData.chapters.length){
+        if(chapterIdNum <= roadmap.roadmapData.chapters.length){
             return res.status(404).json({ success: false, message: 'Chapter not found' });
         }
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:266:12
         const subtopicIdNum = parseInt(subtopicId);
 
         console.log('Looking for chapter:', chapterIdNum, 'Available chapters:', roadmap.roadmapData.chapters.map(ch => ch.id));
-        if(chapterIdNum > roadmap.roadmapData.chapters.length){
+        if(true){
             return res.status(404).json({ success: false, message: 'Chapter not found' });
         }
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0

[Survived] BooleanLiteral
controllers/Roadmap.js:267:52
 
         console.log('Looking for chapter:', chapterIdNum, 'Available chapters:', roadmap.roadmapData.chapters.map(ch => ch.id));
         if(chapterIdNum > roadmap.roadmapData.chapters.length){
-            return res.status(404).json({ success: false, message: 'Chapter not found' });
+            return res.status(404).json({ success: true, message: 'Chapter not found' });
         }
         if(subtopicIdNum > roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics.length){

[Killed] EqualityOperator
controllers/Roadmap.js:269:12
         if(chapterIdNum > roadmap.roadmapData.chapters.length){
             return res.status(404).json({ success: false, message: 'Chapter not found' });
         }
-        if(subtopicIdNum > roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics.length){
+        if(subtopicIdNum >= roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics.length){
             return res.status(404).json({ success: false, message: 'Subtopic not found' });
         }
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:269:92
         if(chapterIdNum > roadmap.roadmapData.chapters.length){
             return res.status(404).json({ success: false, message: 'Chapter not found' });
         }
-        if(subtopicIdNum > roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics.length){
-            return res.status(404).json({ success: false, message: 'Subtopic not found' });
-        }
+        if(subtopicIdNum > roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics.length){}
 
         const chapterTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].title;
killedBy: generateSubtopicSummary() mutation-proof tests should return 404 if subtopic index out of bounds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Survived] BooleanLiteral
controllers/Roadmap.js:270:52
             return res.status(404).json({ success: false, message: 'Chapter not found' });
         }
         if(subtopicIdNum > roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics.length){
-            return res.status(404).json({ success: false, message: 'Subtopic not found' });
+            return res.status(404).json({ success: true, message: 'Subtopic not found' });
         }
 

[Killed] ArithmeticOperator
controllers/Roadmap.js:273:59
             return res.status(404).json({ success: false, message: 'Subtopic not found' });
         }
 
-        const chapterTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].title;
+        const chapterTitle = roadmap.roadmapData.chapters[chapterIdNum + 1].title;
         const subtopicTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum - 1].title;
     const prompt = getSubtopicSummaryPrompt(subtopicTitle, roadmapTitle, chapterTitle, personalization);
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0

[Killed] ArithmeticOperator
controllers/Roadmap.js:274:88
         }
 
         const chapterTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].title;
-        const subtopicTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum - 1].title;
+        const subtopicTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum + 1].title;
     const prompt = getSubtopicSummaryPrompt(subtopicTitle, roadmapTitle, chapterTitle, personalization);
     const summaryText = await generateWithGemini(prompt);
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0
