[Killed] BlockStatement
controllers/oAuthController.js:6:42
 import axios from 'axios';
 import { buildGoogleAuthUrl, buildGoogleTokenParams, buildGithubAuthUrl, buildGithubTokenParams } from '../utils/urlHelpers.js';
 
-export const login = async (req, res) => {
-    const googleUrl = buildGoogleAuthUrl();
-    res.redirect(googleUrl);
-};
+export const login = async (req, res) => {};
 
 export const verifyToken = async (req, res) => {
killedBy: login() controller should redirect to Google OAuth URL
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
controllers/oAuthController.js:14:9
 export const verifyToken = async (req, res) => {
     const { code } = req.body;
 
-    if (!code) return res.status(400).json({ success: false, message: 'Code missing' });
+    if (code) return res.status(400).json({ success: false, message: 'Code missing' });
 
     try {
killedBy: verifyToken() Google OAuth controller should return 400 if code is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/oAuthController.js:14:9
 export const verifyToken = async (req, res) => {
     const { code } = req.body;
 
-    if (!code) return res.status(400).json({ success: false, message: 'Code missing' });
+    if (false) return res.status(400).json({ success: false, message: 'Code missing' });
 
     try {
killedBy: verifyToken() Google OAuth controller should return 400 if code is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] ObjectLiteral
controllers/oAuthController.js:20:22
         const params = buildGoogleTokenParams(code);
 
         const tokenResponse = await axios.post('https://oauth2.googleapis.com/token', params, {
-            headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
+            headers: {},
         });
 

[Killed] ConditionalExpression
controllers/oAuthController.js:24:13
         });
 
         const { access_token } = tokenResponse.data;
-        if (!access_token) throw new Error('Failed to obtain access token');
+        if (true) throw new Error('Failed to obtain access token');
 
         const userInfoUrl = 'https://www.googleapis.com/oauth2/v2/userinfo';
killedBy: verifyToken() Google OAuth controller should verify Google token and create new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
controllers/oAuthController.js:24:13
         });
 
         const { access_token } = tokenResponse.data;
-        if (!access_token) throw new Error('Failed to obtain access token');
+        if (access_token) throw new Error('Failed to obtain access token');
 
         const userInfoUrl = 'https://www.googleapis.com/oauth2/v2/userinfo';
killedBy: verifyToken() Google OAuth controller should verify Google token and create new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
controllers/oAuthController.js:27:63
         if (!access_token) throw new Error('Failed to obtain access token');
 
         const userInfoUrl = 'https://www.googleapis.com/oauth2/v2/userinfo';
-        const userDataResponse = await axios.get(userInfoUrl, {
-            headers: {
-                Authorization: `Bearer ${access_token}`,
-            },
-        });
+        const userDataResponse = await axios.get(userInfoUrl, {});
 
         const { email, name } = userDataResponse.data;

[Survived] ObjectLiteral
controllers/oAuthController.js:28:22
 
         const userInfoUrl = 'https://www.googleapis.com/oauth2/v2/userinfo';
         const userDataResponse = await axios.get(userInfoUrl, {
-            headers: {
-                Authorization: `Bearer ${access_token}`,
-            },
+            headers: {},
         });
 

[Survived] StringLiteral
controllers/oAuthController.js:29:32
         const userInfoUrl = 'https://www.googleapis.com/oauth2/v2/userinfo';
         const userDataResponse = await axios.get(userInfoUrl, {
             headers: {
-                Authorization: `Bearer ${access_token}`,
+                Authorization: ``,
             },
         });

[Killed] ConditionalExpression
controllers/oAuthController.js:36:13
         const { email, name } = userDataResponse.data;
 
         let user = await UserModel.findOne({ email });
-        if (!user) {
+        if (false) {
             user = new UserModel({ email, name, isAccountVerified: true });
             await user.save();
killedBy: verifyToken() Google OAuth controller should verify Google token and create new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
controllers/oAuthController.js:36:13
         const { email, name } = userDataResponse.data;
 
         let user = await UserModel.findOne({ email });
-        if (!user) {
+        if (user) {
             user = new UserModel({ email, name, isAccountVerified: true });
             await user.save();
killedBy: verifyToken() Google OAuth controller should verify Google token and create new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BooleanLiteral
controllers/oAuthController.js:37:68
 
         let user = await UserModel.findOne({ email });
         if (!user) {
-            user = new UserModel({ email, name, isAccountVerified: true });
+            user = new UserModel({ email, name, isAccountVerified: false });
             await user.save();
         }

[Killed] EqualityOperator
controllers/oAuthController.js:45:23
         res.cookie('token', token, {
             httpOnly: true,
             secure: process.env.NODE_ENV === 'production',
-            sameSite: process.env.NODE_ENV === 'production' ? 'None' : 'Lax',
+            sameSite: process.env.NODE_ENV !== 'production' ? 'None' : 'Lax',
             maxAge: 7 * 24 * 60 * 60 * 1000,
         });
killedBy: verifyToken() Google OAuth controller should set secure cookies in production mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", Any<String>, ObjectContaining {"sameSite": "None", "secure": true}
Received: "token", "TOKEN", {"httpOnly": true, "maxAge": 604800000, "sameSite": "Lax", "secure": true}

Number of calls: 1

[Killed] ConditionalExpression
controllers/oAuthController.js:45:23
         res.cookie('token', token, {
             httpOnly: true,
             secure: process.env.NODE_ENV === 'production',
-            sameSite: process.env.NODE_ENV === 'production' ? 'None' : 'Lax',
+            sameSite: false ? 'None' : 'Lax',
             maxAge: 7 * 24 * 60 * 60 * 1000,
         });
killedBy: verifyToken() Google OAuth controller should set secure cookies in production mode
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", Any<String>, ObjectContaining {"sameSite": "None", "secure": true}
Received: "token", "TOKEN", {"httpOnly": true, "maxAge": 604800000, "sameSite": "Lax", "secure": true}

Number of calls: 1

[Survived] ArithmeticOperator
controllers/oAuthController.js:46:21
             httpOnly: true,
             secure: process.env.NODE_ENV === 'production',
             sameSite: process.env.NODE_ENV === 'production' ? 'None' : 'Lax',
-            maxAge: 7 * 24 * 60 * 60 * 1000,
+            maxAge: 7 * 24 * 60 * 60 / 1000,
         });
 

[Survived] ArithmeticOperator
controllers/oAuthController.js:46:21
             httpOnly: true,
             secure: process.env.NODE_ENV === 'production',
             sameSite: process.env.NODE_ENV === 'production' ? 'None' : 'Lax',
-            maxAge: 7 * 24 * 60 * 60 * 1000,
+            maxAge: 7 * 24 * 60 / 60 * 1000,
         });
 

[Killed] ObjectLiteral
controllers/oAuthController.js:52:25
         // if (!user) {
         //   return res.json({ success: true, message: "User registered successfully" });
         // } else {
-        return res.json({
-            success: true,
-            message: 'User logged in successfully',
-            user: { email, name },
-        });
+        return res.json({});
         // }
     } catch (error) {
killedBy: verifyToken() Google OAuth controller should verify Google token and create new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "User logged in successfully",
-   "success": true,

[Killed] ObjectLiteral
controllers/oAuthController.js:55:19
         return res.json({
             success: true,
             message: 'User logged in successfully',
-            user: { email, name },
+            user: {},
         });
         // }
killedBy: verifyToken() Google OAuth controller should verify Google token and create new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User logged in successfully",
    "success": true,

[Killed] BlockStatement
controllers/oAuthController.js:58:21
             user: { email, name },
         });
         // }
-    } catch (error) {
-        console.error(error.response?.data || error.message);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: verifyToken() Google OAuth controller should return 500 if axios fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] OptionalChaining
controllers/oAuthController.js:59:23
         });
         // }
     } catch (error) {
-        console.error(error.response?.data || error.message);
+        console.error(error.response.data || error.message);
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: verifyToken() Google OAuth controller should return 500 if axios fails
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Survived] ConditionalExpression
controllers/oAuthController.js:59:23
         });
         // }
     } catch (error) {
-        console.error(error.response?.data || error.message);
+        console.error(false);
         return res.status(500).json({ success: false, message: error.message });
     }

[Killed] BooleanLiteral
controllers/oAuthController.js:60:48
         // }
     } catch (error) {
         console.error(error.response?.data || error.message);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 };
killedBy: verifyToken() Google OAuth controller should return 500 if axios fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "OAuth error",
-   "success": false,

[Killed] ObjectLiteral
controllers/oAuthController.js:60:37
         // }
     } catch (error) {
         console.error(error.response?.data || error.message);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({});
     }
 };
killedBy: verifyToken() Google OAuth controller should return 500 if axios fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "OAuth error",
-   "success": false,

[Killed] BlockStatement
controllers/oAuthController.js:64:47
     }
 };
 
-export const githubLogin = async (req, res)=> {
-    const githubUrl = buildGithubAuthUrl();
-    res.redirect(githubUrl);
-}
+export const githubLogin = async (req, res)=> {}
 
 export const githubVerifyToken = async (req, res)=> {
killedBy: githubLogin() controller should redirect to GitHub OAuth page
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/oAuthController.js:71:9
 
 export const githubVerifyToken = async (req, res)=> {
     const {code} = req.body;
-    if (!code) return res.status(400).json({ success: false, message: 'Code missing' });
+    if (true) return res.status(400).json({ success: false, message: 'Code missing' });
 
     try {
killedBy: githubVerifyToken() controller should complete GitHub login successfully (new user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
controllers/oAuthController.js:71:9
 
 export const githubVerifyToken = async (req, res)=> {
     const {code} = req.body;
-    if (!code) return res.status(400).json({ success: false, message: 'Code missing' });
+    if (code) return res.status(400).json({ success: false, message: 'Code missing' });
 
     try {
killedBy: githubVerifyToken() controller should return 400 if no code is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] StringLiteral
controllers/oAuthController.js:78:13
 
         // Exchange code for access token
         const tokenResponse = await axios.post(
-            'https://github.com/login/oauth/access_token',
+            "",
             params,
             {

[Survived] ObjectLiteral
controllers/oAuthController.js:80:13
         const tokenResponse = await axios.post(
             'https://github.com/login/oauth/access_token',
             params,
-            {
-                headers: {
-                    'Content-Type': 'application/x-www-form-urlencoded',
-                    'Accept': 'application/json',
-                },
-            }
+            {}
         );
 

[Survived] StringLiteral
controllers/oAuthController.js:83:31
             {
                 headers: {
                     'Content-Type': 'application/x-www-form-urlencoded',
-                    'Accept': 'application/json',
+                    'Accept': "",
                 },
             }

[Killed] ConditionalExpression
controllers/oAuthController.js:89:13
         );
 
         const { access_token } = tokenResponse.data;
-        if (!access_token) throw new Error('Failed to obtain access token');
+        if (false) throw new Error('Failed to obtain access token');
 
         // Fetch user profile
killedBy: githubVerifyToken() controller should return 500 when GitHub token exchange returns no access_token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Failed to obtain access token"}
Received: {"message": "Cannot read properties of undefined (reading 'data')", "success": false}

Number of calls: 1

[Survived] StringLiteral
controllers/oAuthController.js:93:39
 
         // Fetch user profile
         const userResponse = await axios.get('https://api.github.com/user', {
-            headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
+            headers: { Authorization: ``, Accept: 'application/vnd.github+json' },
         });
 

[Survived] StringLiteral
controllers/oAuthController.js:93:73
 
         // Fetch user profile
         const userResponse = await axios.get('https://api.github.com/user', {
-            headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
+            headers: { Authorization: `Bearer ${access_token}`, Accept: "" },
         });
 

[Killed] LogicalOperator
controllers/oAuthController.js:96:21
             headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
         });
 
-        let email = userResponse.data.email || null;
+        let email = userResponse.data.email && null;
         if (!email) {
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
killedBy: githubVerifyToken() controller should complete GitHub login successfully (new user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/oAuthController.js:96:21
             headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
         });
 
-        let email = userResponse.data.email || null;
+        let email = true;
         if (!email) {
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
killedBy: githubVerifyToken() controller should return 400 when fallback email list has emails but none verified
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BooleanLiteral
controllers/oAuthController.js:97:13
         });
 
         let email = userResponse.data.email || null;
-        if (!email) {
+        if (email) {
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
                 headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
killedBy: githubVerifyToken() controller should complete GitHub login successfully (new user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/oAuthController.js:97:13
         });
 
         let email = userResponse.data.email || null;
-        if (!email) {
+        if (false) {
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
                 headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
killedBy: githubVerifyToken() controller should use fallback email API when primary email is NULL
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ObjectLiteral
controllers/oAuthController.js:98:90
 
         let email = userResponse.data.email || null;
         if (!email) {
-            const emailsResponse = await axios.get('https://api.github.com/user/emails', {
-                headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
-            });
+            const emailsResponse = await axios.get('https://api.github.com/user/emails', {});
             const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||
                                     emailsResponse.data.find(e => e.verified) ||

[Survived] StringLiteral
controllers/oAuthController.js:99:77
         let email = userResponse.data.email || null;
         if (!email) {
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
-                headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
+                headers: { Authorization: `Bearer ${access_token}`, Accept: "" },
             });
             const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||

[Survived] StringLiteral
controllers/oAuthController.js:99:43
         let email = userResponse.data.email || null;
         if (!email) {
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
-                headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
+                headers: { Authorization: ``, Accept: 'application/vnd.github+json' },
             });
             const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||

[Killed] ConditionalExpression
controllers/oAuthController.js:101:37
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
                 headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
             });
-            const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||
-                                    emailsResponse.data.find(e => e.verified) ||
-                                    emailsResponse.data[0];
+            const primaryVerified = false;
             email = primaryVerified?.email || null;
         }
killedBy: githubVerifyToken() controller should use fallback email API when primary email is NULL
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
controllers/oAuthController.js:101:37
             const emailsResponse = await axios.get('https://api.github.com/user/emails', {
                 headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
             });
-            const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||
-                                    emailsResponse.data.find(e => e.verified) ||
-                                    emailsResponse.data[0];
+            const primaryVerified = true;
             email = primaryVerified?.email || null;
         }
killedBy: githubVerifyToken() controller should use fallback email API when primary email is NULL
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ArrowFunction
controllers/oAuthController.js:102:62
                 headers: { Authorization: `Bearer ${access_token}`, Accept: 'application/vnd.github+json' },
             });
             const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||
-                                    emailsResponse.data.find(e => e.verified) ||
+                                    emailsResponse.data.find(() => undefined) ||
                                     emailsResponse.data[0];
             email = primaryVerified?.email || null;

[Killed] ConditionalExpression
controllers/oAuthController.js:104:21
             const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||
                                     emailsResponse.data.find(e => e.verified) ||
                                     emailsResponse.data[0];
-            email = primaryVerified?.email || null;
+            email = false;
         }
 
killedBy: githubVerifyToken() controller should use fallback email API when primary email is NULL
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] OptionalChaining
controllers/oAuthController.js:104:21
             const primaryVerified = emailsResponse.data.find(e => e.primary && e.verified) ||
                                     emailsResponse.data.find(e => e.verified) ||
                                     emailsResponse.data[0];
-            email = primaryVerified?.email || null;
+            email = primaryVerified.email || null;
         }
 
killedBy: githubVerifyToken() controller should return 400 when fallback email list has no usable email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Survived] LogicalOperator
controllers/oAuthController.js:107:22
             email = primaryVerified?.email || null;
         }
 
-        const name = userResponse.data.name || userResponse.data.login;
+        const name = userResponse.data.name && userResponse.data.login;
         const githubId = String(userResponse.data.login);
 

[Survived] ConditionalExpression
controllers/oAuthController.js:107:22
             email = primaryVerified?.email || null;
         }
 
-        const name = userResponse.data.name || userResponse.data.login;
+        const name = false;
         const githubId = String(userResponse.data.login);
 

[Killed] BlockStatement
controllers/oAuthController.js:110:21
         const name = userResponse.data.name || userResponse.data.login;
         const githubId = String(userResponse.data.login);
 
-        if (!email) {
-           return res.status(400).json({ success: false, message: 'Unable to retrieve email from GitHub account' });
-        }
+        if (!email) {}
 
         let user = await UserModel.findOne({ email });
killedBy: githubVerifyToken() controller should return 400 when fallback email list has emails but none verified
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Survived] BooleanLiteral
controllers/oAuthController.js:111:51
         const githubId = String(userResponse.data.login);
 
         if (!email) {
-           return res.status(400).json({ success: false, message: 'Unable to retrieve email from GitHub account' });
+           return res.status(400).json({ success: true, message: 'Unable to retrieve email from GitHub account' });
         }
 

[Killed] StringLiteral
controllers/oAuthController.js:111:67
         const githubId = String(userResponse.data.login);
 
         if (!email) {
-           return res.status(400).json({ success: false, message: 'Unable to retrieve email from GitHub account' });
+           return res.status(400).json({ success: false, message: "" });
         }
 
killedBy: githubVerifyToken() controller should return 400 when fallback email list has emails but none verified
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Unable to retrieve email from GitHub account"}
Received: {"message": "", "success": false}

Number of calls: 1

[Killed] BlockStatement
controllers/oAuthController.js:115:20
         }
 
         let user = await UserModel.findOne({ email });
-        if (!user) {
-            user = await UserModel.findOne({ githubId });
-        }
+        if (!user) {}
 
         if (!user) {
killedBy: githubVerifyToken() controller should match existing user by githubId when email lookup fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
controllers/oAuthController.js:119:20
             user = await UserModel.findOne({ githubId });
         }
 
-        if (!user) {
-            user = new UserModel({
-                email,
-                name,
-                githubId,
-                isAccountVerified: true,
-            });  
-        } else {
+        if (!user) {} else {
             if (!user.githubId) {
                 user.githubId = githubId;
killedBy: githubVerifyToken() controller should complete GitHub login successfully (new user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] BooleanLiteral
controllers/oAuthController.js:124:36
                 email,
                 name,
                 githubId,
-                isAccountVerified: true,
+                isAccountVerified: false,
             });  
         } else {

[Killed] BlockStatement
controllers/oAuthController.js:126:16
                 githubId,
                 isAccountVerified: true,
             });  
-        } else {
-            if (!user.githubId) {
-                user.githubId = githubId;
-            }
-            if (!user.isAccountVerified) {
-                user.isAccountVerified = true;
-               
-            }
-        }
+        } else {}
         await user.save();
         const token = jwt.sign({ id: user._id, email: user.email }, process.env.JWT_SECRET, { expiresIn: '7d' });
killedBy: githubVerifyToken() controller should update existing user missing githubId and verify account
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ghxyz"
Received: null

[Killed] ConditionalExpression
controllers/oAuthController.js:127:17
                 isAccountVerified: true,
             });  
         } else {
-            if (!user.githubId) {
+            if (false) {
                 user.githubId = githubId;
             }
killedBy: githubVerifyToken() controller should update existing user missing githubId and verify account
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ghxyz"
Received: null

[Killed] BooleanLiteral
controllers/oAuthController.js:127:17
                 isAccountVerified: true,
             });  
         } else {
-            if (!user.githubId) {
+            if (user.githubId) {
                 user.githubId = githubId;
             }
killedBy: githubVerifyToken() controller should update existing user missing githubId and verify account
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ghxyz"
Received: null

[Killed] BooleanLiteral
controllers/oAuthController.js:130:17
             if (!user.githubId) {
                 user.githubId = githubId;
             }
-            if (!user.isAccountVerified) {
+            if (user.isAccountVerified) {
                 user.isAccountVerified = true;
                
killedBy: githubVerifyToken() controller should update existing user missing githubId and verify account
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
