[Killed] ConditionalExpression
controllers/oAuthController.js:130:17
             if (!user.githubId) {
                 user.githubId = githubId;
             }
-            if (!user.isAccountVerified) {
+            if (false) {
                 user.isAccountVerified = true;
                
killedBy: githubVerifyToken() controller should update existing user missing githubId and verify account
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
controllers/oAuthController.js:131:42
                 user.githubId = githubId;
             }
             if (!user.isAccountVerified) {
-                user.isAccountVerified = true;
+                user.isAccountVerified = false;
                
             }
killedBy: githubVerifyToken() controller should update existing user missing githubId and verify account
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ObjectLiteral
controllers/oAuthController.js:136:93
             }
         }
         await user.save();
-        const token = jwt.sign({ id: user._id, email: user.email }, process.env.JWT_SECRET, { expiresIn: '7d' });
+        const token = jwt.sign({ id: user._id, email: user.email }, process.env.JWT_SECRET, {});
 
         res.cookie('token', token, {

[Survived] ArithmeticOperator
controllers/oAuthController.js:142:21
             httpOnly: true,
             secure: process.env.NODE_ENV === 'production',
             sameSite: process.env.NODE_ENV === 'production' ? 'None' : 'Lax',
-            maxAge: 7 * 24 * 60 * 60 * 1000,
+            maxAge: 7 / 24 * 60 * 60 * 1000,
         });
 

[Killed] ObjectLiteral
controllers/oAuthController.js:145:25
             maxAge: 7 * 24 * 60 * 60 * 1000,
         });
 
-        return res.json({
-            success: true,
-            message: 'User logged in successfully',
-            user: { email: user.email, name: user.name },
-        });
+        return res.json({});
     } catch (error) {
         console.error(`Got some err  ${error.response?.data || error.message}`);
killedBy: githubVerifyToken() controller should complete GitHub login successfully (new user)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": true}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/oAuthController.js:150:21
             message: 'User logged in successfully',
             user: { email: user.email, name: user.name },
         });
-    } catch (error) {
-        console.error(`Got some err  ${error.response?.data || error.message}`);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
killedBy: githubVerifyToken() controller should return 500 when GitHub token exchange returns no access_token
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] OptionalChaining
controllers/oAuthController.js:151:40
             user: { email: user.email, name: user.name },
         });
     } catch (error) {
-        console.error(`Got some err  ${error.response?.data || error.message}`);
+        console.error(`Got some err  ${error.response.data || error.message}`);
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: githubVerifyToken() controller should return 500 when GitHub token exchange returns no access_token
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Survived] LogicalOperator
controllers/oAuthController.js:151:40
             user: { email: user.email, name: user.name },
         });
     } catch (error) {
-        console.error(`Got some err  ${error.response?.data || error.message}`);
+        console.error(`Got some err  ${error.response?.data && error.message}`);
         return res.status(500).json({ success: false, message: error.message });
     }

[Survived] BooleanLiteral
controllers/oAuthController.js:152:48
         });
     } catch (error) {
         console.error(`Got some err  ${error.response?.data || error.message}`);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 };
