[Killed] ArithmeticOperator
controllers/Roadmap.js:274:60
         }
 
         const chapterTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].title;
-        const subtopicTitle = roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum - 1].title;
+        const subtopicTitle = roadmap.roadmapData.chapters[chapterIdNum + 1].subtopics[subtopicIdNum - 1].title;
     const prompt = getSubtopicSummaryPrompt(subtopicTitle, roadmapTitle, chapterTitle, personalization);
     const summaryText = await generateWithGemini(prompt);
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Intro", "JS", "Basics", "custom"

Number of calls: 0

[Killed] ArithmeticOperator
controllers/Roadmap.js:279:38
     const summaryText = await generateWithGemini(prompt);
 
 
-        roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum - 1].detailedExplanation = summaryText;
+        roadmap.roadmapData.chapters[chapterIdNum + 1].subtopics[subtopicIdNum - 1].detailedExplanation = summaryText;
 
         roadmap.markModified('roadmapData');
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "roadmapData"

Number of calls: 0

[Killed] ArithmeticOperator
controllers/Roadmap.js:279:66
     const summaryText = await generateWithGemini(prompt);
 
 
-        roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum - 1].detailedExplanation = summaryText;
+        roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum + 1].detailedExplanation = summaryText;
 
         roadmap.markModified('roadmapData');
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "roadmapData"

Number of calls: 0

[Killed] StringLiteral
controllers/Roadmap.js:281:30
 
         roadmap.roadmapData.chapters[chapterIdNum - 1].subtopics[subtopicIdNum - 1].detailedExplanation = summaryText;
 
-        roadmap.markModified('roadmapData');
+        roadmap.markModified("");
         await roadmap.save();
 
killedBy: generateSubtopicSummary() mutation-proof tests should generate and save summary successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "roadmapData"
Received: ""

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:290:21
             message: 'Subtopic summary generated and saved successfully',
         });
 
-    } catch (error) {
-        console.error('Error in generateSubtopicSummary:', error);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: generateSubtopicSummary() mutation-proof tests should return 500 if roadmap object is malformed (invalid shape)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/Roadmap.js:292:48
 
     } catch (error) {
         console.error('Error in generateSubtopicSummary:', error);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 };
killedBy: generateSubtopicSummary() mutation-proof tests should return 500 if roadmap object is malformed (invalid shape)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {"message": "Cannot read properties of null (reading 'title')", "success": true}

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:297:9
 };
 
 export const saveProgress = async (req, res) => {
-    try {
-        const { roadmapId, chapterId, subtopicId } = req.body;
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId })
-        const roadmapData = roadmap.roadmapData;
-        const no_of_chapters = roadmapData.chapters.length;
-        if(no_of_chapters < chapterId){
-            return res.status(400).json({ success: false, message: 'Invalid chapterId' });
-        }
-        const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
-        if(no_of_subtopics < subtopicId){
-            return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
-        }
-        console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
-        const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
-        roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed = !current;
-        roadmap.markModified('roadmapData');
-        await roadmap.save();
-
-        return res.status(200).json({ success: true, data: roadmap, message: 'Progress saved successfully' });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error saving progress:', error);
         return res.status(500).json({ success: false, message: error.message });
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/Roadmap.js:303:39
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId })
         const roadmapData = roadmap.roadmapData;
         const no_of_chapters = roadmapData.chapters.length;
-        if(no_of_chapters < chapterId){
-            return res.status(400).json({ success: false, message: 'Invalid chapterId' });
-        }
+        if(no_of_chapters < chapterId){}
         const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
         if(no_of_subtopics < subtopicId){
killedBy: saveProgress() mutation-proof tests should return 400 when chapterId is out of range
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] EqualityOperator
controllers/Roadmap.js:303:12
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId })
         const roadmapData = roadmap.roadmapData;
         const no_of_chapters = roadmapData.chapters.length;
-        if(no_of_chapters < chapterId){
+        if(no_of_chapters >= chapterId){
             return res.status(400).json({ success: false, message: 'Invalid chapterId' });
         }
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
controllers/Roadmap.js:304:52
         const roadmapData = roadmap.roadmapData;
         const no_of_chapters = roadmapData.chapters.length;
         if(no_of_chapters < chapterId){
-            return res.status(400).json({ success: false, message: 'Invalid chapterId' });
+            return res.status(400).json({ success: true, message: 'Invalid chapterId' });
         }
         const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
killedBy: saveProgress() mutation-proof tests should return 400 when chapterId is out of range
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Invalid chapterId", "success": false}
Received: {"message": "Invalid chapterId", "success": true}

Number of calls: 1

[Killed] StringLiteral
controllers/Roadmap.js:304:68
         const roadmapData = roadmap.roadmapData;
         const no_of_chapters = roadmapData.chapters.length;
         if(no_of_chapters < chapterId){
-            return res.status(400).json({ success: false, message: 'Invalid chapterId' });
+            return res.status(400).json({ success: false, message: "" });
         }
         const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
killedBy: saveProgress() mutation-proof tests should return 400 when chapterId is out of range
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Invalid chapterId", "success": false}
Received: {"message": "", "success": false}

Number of calls: 1

[Killed] ArithmeticOperator
controllers/Roadmap.js:306:54
         if(no_of_chapters < chapterId){
             return res.status(400).json({ success: false, message: 'Invalid chapterId' });
         }
-        const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
+        const no_of_subtopics = roadmapData.chapters[chapterId + 1].subtopics.length;
         if(no_of_subtopics < subtopicId){
             return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
controllers/Roadmap.js:307:12
             return res.status(400).json({ success: false, message: 'Invalid chapterId' });
         }
         const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
-        if(no_of_subtopics < subtopicId){
+        if(true){
             return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
         }
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/Roadmap.js:307:41
             return res.status(400).json({ success: false, message: 'Invalid chapterId' });
         }
         const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
-        if(no_of_subtopics < subtopicId){
-            return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
-        }
+        if(no_of_subtopics < subtopicId){}
         console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
         const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
killedBy: saveProgress() mutation-proof tests should return 400 when subtopicId is out of range
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/Roadmap.js:308:52
         }
         const no_of_subtopics = roadmapData.chapters[chapterId - 1].subtopics.length;
         if(no_of_subtopics < subtopicId){
-            return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
+            return res.status(400).json({ success: true, message: 'Invalid subtopicId' });
         }
         console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
killedBy: saveProgress() mutation-proof tests should return 400 when subtopicId is out of range
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "Invalid subtopicId", "success": false}
Received: {"message": "Invalid subtopicId", "success": true}

Number of calls: 1

[Killed] ArithmeticOperator
controllers/Roadmap.js:310:97
         if(no_of_subtopics < subtopicId){
             return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
         }
-        console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
+        console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId + 1].completed)
         const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
         roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed = !current;
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
controllers/Roadmap.js:310:72
         if(no_of_subtopics < subtopicId){
             return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
         }
-        console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
+        console.log("Current completion status:", roadmapData.chapters[chapterId + 1].subtopics[subtopicId - 1].completed)
         const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
         roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed = !current;
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
controllers/Roadmap.js:311:46
             return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
         }
         console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
-        const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
+        const current = roadmapData.chapters[chapterId + 1].subtopics[subtopicId - 1].completed;
         roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed = !current;
         roadmap.markModified('roadmapData');
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
controllers/Roadmap.js:311:71
             return res.status(400).json({ success: false, message: 'Invalid subtopicId' });
         }
         console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
-        const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
+        const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId + 1].completed;
         roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed = !current;
         roadmap.markModified('roadmapData');
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
controllers/Roadmap.js:312:30
         }
         console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
         const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
-        roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed = !current;
+        roadmapData.chapters[chapterId + 1].subtopics[subtopicId - 1].completed = !current;
         roadmap.markModified('roadmapData');
         await roadmap.save();
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
controllers/Roadmap.js:312:55
         }
         console.log("Current completion status:", roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed)
         const current = roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed;
-        roadmapData.chapters[chapterId - 1].subtopics[subtopicId - 1].completed = !current;
+        roadmapData.chapters[chapterId - 1].subtopics[subtopicId + 1].completed = !current;
         roadmap.markModified('roadmapData');
         await roadmap.save();
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
controllers/Roadmap.js:316:48
         roadmap.markModified('roadmapData');
         await roadmap.save();
 
-        return res.status(200).json({ success: true, data: roadmap, message: 'Progress saved successfully' });
+        return res.status(200).json({ success: false, data: roadmap, message: 'Progress saved successfully' });
     } catch (error) {
         console.error('Error saving progress:', error);
killedBy: saveProgress() mutation-proof tests should toggle progress and save successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": true}
Received: {"data": {"markModified": [Function mockConstructor], "roadmapData": {"chapters": [{"subtopics": [{"completed": true, "id": 1}]}]}, "save": [Function mockConstructor]}, "message": "Progress saved successfully", "success": false}

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:317:21
         await roadmap.save();
 
         return res.status(200).json({ success: true, data: roadmap, message: 'Progress saved successfully' });
-    } catch (error) {
-        console.error('Error saving progress:', error);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: saveProgress() mutation-proof tests should return 500 when roadmapData is malformed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/Roadmap.js:319:48
         return res.status(200).json({ success: true, data: roadmap, message: 'Progress saved successfully' });
     } catch (error) {
         console.error('Error saving progress:', error);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 }
killedBy: saveProgress() mutation-proof tests should return 500 when roadmapData is malformed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {"message": "Cannot read properties of null (reading 'chapters')", "success": true}

Number of calls: 1

[Killed] BlockStatement
controllers/Roadmap.js:323:50
     }
 }
 
-export const fetchProgress = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-        const progressData = new Set();
-        for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                if (subtopic.completed) {
-                    progressData.add(`${chapter.id}:${subtopic.id}`);
-                }
-            }
-        }
-        console.log("Fetched progress data:", progressData);
-        return res.status(200).json({ success: true, data: Array.from(progressData) });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-}
+export const fetchProgress = async (req, res) => {}
 
 export const fetchSubtopicExplanation = async (req, res) => {
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:324:9
 }
 
 export const fetchProgress = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-        const progressData = new Set();
-        for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                if (subtopic.completed) {
-                    progressData.add(`${chapter.id}:${subtopic.id}`);
-                }
-            }
-        }
-        console.log("Fetched progress data:", progressData);
-        return res.status(200).json({ success: true, data: Array.from(progressData) });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:329:61
 
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
         const progressData = new Set();
-        for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                if (subtopic.completed) {
-                    progressData.add(`${chapter.id}:${subtopic.id}`);
-                }
-            }
-        }
+        for (const chapter of roadmap.roadmapData.chapters) {}
         console.log("Fetched progress data:", progressData);
         return res.status(200).json({ success: true, data: Array.from(progressData) });
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [
-     "1:1",

[Killed] BlockStatement
controllers/Roadmap.js:330:55
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
         const progressData = new Set();
         for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                if (subtopic.completed) {
-                    progressData.add(`${chapter.id}:${subtopic.id}`);
-                }
-            }
+            for (const subtopic of chapter.subtopics) {}
         }
         console.log("Fetched progress data:", progressData);
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [
-     "1:1",

[Killed] BlockStatement
controllers/Roadmap.js:331:41
         const progressData = new Set();
         for (const chapter of roadmap.roadmapData.chapters) {
             for (const subtopic of chapter.subtopics) {
-                if (subtopic.completed) {
-                    progressData.add(`${chapter.id}:${subtopic.id}`);
-                }
+                if (subtopic.completed) {}
             }
         }
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [
-     "1:1",

[Killed] ConditionalExpression
controllers/Roadmap.js:331:21
         const progressData = new Set();
         for (const chapter of roadmap.roadmapData.chapters) {
             for (const subtopic of chapter.subtopics) {
-                if (subtopic.completed) {
+                if (true) {
                     progressData.add(`${chapter.id}:${subtopic.id}`);
                 }
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Array [
      "1:1",

[Killed] StringLiteral
controllers/Roadmap.js:332:38
         for (const chapter of roadmap.roadmapData.chapters) {
             for (const subtopic of chapter.subtopics) {
                 if (subtopic.completed) {
-                    progressData.add(`${chapter.id}:${subtopic.id}`);
+                    progressData.add(``);
                 }
             }
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Array [
-     "1:1",

[Killed] BooleanLiteral
controllers/Roadmap.js:337:48
             }
         }
         console.log("Fetched progress data:", progressData);
-        return res.status(200).json({ success: true, data: Array.from(progressData) });
+        return res.status(200).json({ success: false, data: Array.from(progressData) });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Array [
      "1:1",

[Killed] ObjectLiteral
controllers/Roadmap.js:337:37
             }
         }
         console.log("Fetched progress data:", progressData);
-        return res.status(200).json({ success: true, data: Array.from(progressData) });
+        return res.status(200).json({});
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: fetchProgress() mutation-proof tests should fetch progress successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "data": Array [
-     "1:1",

[Killed] BlockStatement
controllers/Roadmap.js:338:21
         }
         console.log("Fetched progress data:", progressData);
         return res.status(200).json({ success: true, data: Array.from(progressData) });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: fetchProgress() mutation-proof tests should return 500 if roadmap is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:343:61
     }
 }
 
-export const fetchSubtopicExplanation = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-
-        const subtopicExplanation = {};
-        for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = subtopic.detailedExplanation || '';
-            }
-        }
-        return res.status(200).json({ success: true, data: subtopicExplanation });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-}
+export const fetchSubtopicExplanation = async (req, res) => {}
 
 export const searchRoadmaps = async (req, res) => {
killedBy: fetchSubtopicExplanation() mutation-proof tests should fetch explanations successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/Roadmap.js:344:9
 }
 
 export const fetchSubtopicExplanation = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
-
-        const subtopicExplanation = {};
-        for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = subtopic.detailedExplanation || '';
-            }
-        }
-        return res.status(200).json({ success: true, data: subtopicExplanation });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: fetchSubtopicExplanation() mutation-proof tests should fetch explanations successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Survived] ObjectLiteral
controllers/Roadmap.js:346:52
 export const fetchSubtopicExplanation = async (req, res) => {
     try {
         const { roadmapId } = req.body;
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
+        const roadmap = await RoadmapModel.findOne({});
 
         const subtopicExplanation = {};

[Killed] BlockStatement
controllers/Roadmap.js:349:61
         const roadmap = await RoadmapModel.findOne({ _id: roadmapId });
 
         const subtopicExplanation = {};
-        for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = subtopic.detailedExplanation || '';
-            }
-        }
+        for (const chapter of roadmap.roadmapData.chapters) {}
         return res.status(200).json({ success: true, data: subtopicExplanation });
     } catch (error) {
killedBy: fetchSubtopicExplanation() mutation-proof tests should fetch explanations successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Object {
-     "1:1": "Explanation 1",
