[Killed] BlockStatement
middlewares/userAuth.js:3:44
 import jwt from 'jsonwebtoken';
 
-const userAuth = async (req, res, next) => {
-    const { token } = req.cookies;
-
-    if (!token) {
-        return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
-    }
-    try {
-        const tokenDecode = jwt.verify(token, process.env.JWT_SECRET);
-        
-        if (tokenDecode.id) {
-            req.userId = tokenDecode.id;
-            req.email = tokenDecode.email;
-        } else {
-            return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
-        }
-        next();
-    } catch (error) {
-        console.log(error.message);
-        return res.status(401).json({ success: false, message: error.message });
-    }
-};
+const userAuth = async (req, res, next) => {};
 
 export default userAuth;
killedBy: userAuth middleware returns 401 if no token is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] BlockStatement
middlewares/userAuth.js:6:17
 const userAuth = async (req, res, next) => {
     const { token } = req.cookies;
 
-    if (!token) {
-        return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
-    }
+    if (!token) {}
     try {
         const tokenDecode = jwt.verify(token, process.env.JWT_SECRET);
killedBy: userAuth middleware returns 401 if no token is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Not Authorized Login Again.",
+   "message": "Cannot read properties of undefined (reading 'id')",

[Killed] BooleanLiteral
middlewares/userAuth.js:7:48
     const { token } = req.cookies;
 
     if (!token) {
-        return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
+        return res.status(401).json({ success: true, message: 'Not Authorized Login Again.' });
     }
     try {
killedBy: userAuth middleware returns 401 if no token is provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Not Authorized Login Again.",
-   "success": false,

[Killed] BlockStatement
middlewares/userAuth.js:9:9
     if (!token) {
         return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
     }
-    try {
-        const tokenDecode = jwt.verify(token, process.env.JWT_SECRET);
-        
-        if (tokenDecode.id) {
-            req.userId = tokenDecode.id;
-            req.email = tokenDecode.email;
-        } else {
-            return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
-        }
-        next();
-    } catch (error) {
+    try {} catch (error) {
         console.log(error.message);
         return res.status(401).json({ success: false, message: error.message });
killedBy: userAuth middleware decodes token and calls next when valid
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "valid-token", undefined

Number of calls: 0

[Killed] ConditionalExpression
middlewares/userAuth.js:12:13
     try {
         const tokenDecode = jwt.verify(token, process.env.JWT_SECRET);
         
-        if (tokenDecode.id) {
+        if (true) {
             req.userId = tokenDecode.id;
             req.email = tokenDecode.email;
killedBy: userAuth middleware returns 401 if tokenDecode.id is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] ConditionalExpression
middlewares/userAuth.js:12:13
     try {
         const tokenDecode = jwt.verify(token, process.env.JWT_SECRET);
         
-        if (tokenDecode.id) {
+        if (false) {
             req.userId = tokenDecode.id;
             req.email = tokenDecode.email;
killedBy: userAuth middleware decodes token and calls next when valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user123"
Received: undefined

[Killed] BlockStatement
middlewares/userAuth.js:15:16
         if (tokenDecode.id) {
             req.userId = tokenDecode.id;
             req.email = tokenDecode.email;
-        } else {
-            return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
-        }
+        } else {}
         next();
     } catch (error) {
killedBy: userAuth middleware returns 401 if tokenDecode.id is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] BooleanLiteral
middlewares/userAuth.js:16:52
             req.userId = tokenDecode.id;
             req.email = tokenDecode.email;
         } else {
-            return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
+            return res.status(401).json({ success: true, message: 'Not Authorized Login Again.' });
         }
         next();
killedBy: userAuth middleware returns 401 if tokenDecode.id is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Not Authorized Login Again.",
-   "success": false,

[Killed] BlockStatement
middlewares/userAuth.js:19:21
             return res.status(401).json({ success: false, message: 'Not Authorized Login Again.' });
         }
         next();
-    } catch (error) {
-        console.log(error.message);
-        return res.status(401).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: userAuth middleware returns 401 when jwt.verify throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] BooleanLiteral
middlewares/userAuth.js:21:48
         next();
     } catch (error) {
         console.log(error.message);
-        return res.status(401).json({ success: false, message: error.message });
+        return res.status(401).json({ success: true, message: error.message });
     }
 };
killedBy: userAuth middleware returns 401 when jwt.verify throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid token",
-   "success": false,
