[Killed] BlockStatement
controllers/Roadmap.js:350:55
 
         const subtopicExplanation = {};
         for (const chapter of roadmap.roadmapData.chapters) {
-            for (const subtopic of chapter.subtopics) {
-                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = subtopic.detailedExplanation || '';
-            }
+            for (const subtopic of chapter.subtopics) {}
         }
         return res.status(200).json({ success: true, data: subtopicExplanation });
killedBy: fetchSubtopicExplanation() mutation-proof tests should fetch explanations successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Object {
-     "1:1": "Explanation 1",

[Killed] ConditionalExpression
controllers/Roadmap.js:351:71
         const subtopicExplanation = {};
         for (const chapter of roadmap.roadmapData.chapters) {
             for (const subtopic of chapter.subtopics) {
-                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = subtopic.detailedExplanation || '';
+                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = true;
             }
         }
killedBy: fetchSubtopicExplanation() mutation-proof tests should fetch explanations successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
-     "1:1": "Explanation 1",

[Killed] ConditionalExpression
controllers/Roadmap.js:351:71
         const subtopicExplanation = {};
         for (const chapter of roadmap.roadmapData.chapters) {
             for (const subtopic of chapter.subtopics) {
-                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = subtopic.detailedExplanation || '';
+                subtopicExplanation[`${chapter.id}:${subtopic.id}`] = false;
             }
         }
killedBy: fetchSubtopicExplanation() mutation-proof tests should fetch explanations successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
-     "1:1": "Explanation 1",

[Killed] BooleanLiteral
controllers/Roadmap.js:354:48
                 subtopicExplanation[`${chapter.id}:${subtopic.id}`] = subtopic.detailedExplanation || '';
             }
         }
-        return res.status(200).json({ success: true, data: subtopicExplanation });
+        return res.status(200).json({ success: false, data: subtopicExplanation });
     } catch (error) {
         return res.status(500).json({ success: false, message: error.message });
killedBy: fetchSubtopicExplanation() mutation-proof tests should fetch explanations successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Object {
      "1:1": "Explanation 1",

[Killed] BlockStatement
controllers/Roadmap.js:355:21
             }
         }
         return res.status(200).json({ success: true, data: subtopicExplanation });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: fetchSubtopicExplanation() mutation-proof tests should return 500 if roadmap is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] MethodExpression
controllers/Roadmap.js:362:19
 
 export const searchRoadmaps = async (req, res) => {
     try {
-        const q = (req.query.q || '').toString().trim();
+        const q = (req.query.q || '').toString();
         const page = Math.max(1, parseInt(req.query.page || '1', 10));
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
killedBy: searchRoadmaps() mutation-proof tests returns 400 for empty query string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/Roadmap.js:362:20
 
 export const searchRoadmaps = async (req, res) => {
     try {
-        const q = (req.query.q || '').toString().trim();
+        const q = (true).toString().trim();
         const page = Math.max(1, parseInt(req.query.page || '1', 10));
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
killedBy: searchRoadmaps() mutation-proof tests returns 400 for empty query string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/Roadmap.js:363:43
 export const searchRoadmaps = async (req, res) => {
     try {
         const q = (req.query.q || '').toString().trim();
-        const page = Math.max(1, parseInt(req.query.page || '1', 10));
+        const page = Math.max(1, parseInt(true, 10));
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
 
killedBy: searchRoadmaps() mutation-proof tests uses default page=1 when page missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ConditionalExpression
controllers/Roadmap.js:363:43
 export const searchRoadmaps = async (req, res) => {
     try {
         const q = (req.query.q || '').toString().trim();
-        const page = Math.max(1, parseInt(req.query.page || '1', 10));
+        const page = Math.max(1, parseInt(false, 10));
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
 
killedBy: searchRoadmaps() mutation-proof tests uses default page=1 when page missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] MethodExpression
controllers/Roadmap.js:364:26
     try {
         const q = (req.query.q || '').toString().trim();
         const page = Math.max(1, parseInt(req.query.page || '1', 10));
-        const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
+        const pageSize = Math.max(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
 
         if (!q) {
killedBy: searchRoadmaps() mutation-proof tests uses default pageSize=10 when pageSize missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 25

[Killed] ConditionalExpression
controllers/Roadmap.js:364:60
     try {
         const q = (req.query.q || '').toString().trim();
         const page = Math.max(1, parseInt(req.query.page || '1', 10));
-        const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
+        const pageSize = Math.min(25, Math.max(5, parseInt(false, 10)));
 
         if (!q) {
killedBy: searchRoadmaps() mutation-proof tests uses default pageSize=10 when pageSize missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: NaN

[Killed] BlockStatement
controllers/Roadmap.js:366:17
         const page = Math.max(1, parseInt(req.query.page || '1', 10));
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
 
-        if (!q) {
-            return res.status(400).json({ success: false, message: 'Query cannot be empty' });
-        }
+        if (!q) {}
 
         const email = req.email;
killedBy: searchRoadmaps() mutation-proof tests returns 400 for empty query string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/Roadmap.js:366:13
         const page = Math.max(1, parseInt(req.query.page || '1', 10));
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
 
-        if (!q) {
+        if (true) {
             return res.status(400).json({ success: false, message: 'Query cannot be empty' });
         }
killedBy: searchRoadmaps() mutation-proof tests uses default page=1 when page missing
statusReason: TypeError: Cannot read properties of undefined (reading 'page')

[Survived] BooleanLiteral
controllers/Roadmap.js:367:52
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
 
         if (!q) {
-            return res.status(400).json({ success: false, message: 'Query cannot be empty' });
+            return res.status(400).json({ success: true, message: 'Query cannot be empty' });
         }
 

[Survived] ObjectLiteral
controllers/Roadmap.js:367:41
         const pageSize = Math.min(25, Math.max(5, parseInt(req.query.pageSize || '10', 10)));
 
         if (!q) {
-            return res.status(400).json({ success: false, message: 'Query cannot be empty' });
+            return res.status(400).json({});
         }
 

[Survived] ObjectLiteral
controllers/Roadmap.js:374:50
         const userId = req.userId;
 
         // Fetch user's roadmaps
-        const roadmaps = await RoadmapModel.find({ email }).select({ roadmapData: 1 }).lean();
+        const roadmaps = await RoadmapModel.find({}).select({ roadmapData: 1 }).lean();
 
         const term = q.toLowerCase();

[Killed] MethodExpression
controllers/Roadmap.js:376:22
         // Fetch user's roadmaps
         const roadmaps = await RoadmapModel.find({ email }).select({ roadmapData: 1 }).lean();
 
-        const term = q.toLowerCase();
+        const term = q.toUpperCase();
         const results = {
             roadmaps: [],
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrayDeclaration
controllers/Roadmap.js:380:24
         const results = {
             roadmaps: [],
             chapters: [],
-            subtopics: [],
+            subtopics: ["Stryker was here"],
             notes: [],
         };
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
controllers/Roadmap.js:385:24
         };
 
         for (const r of roadmaps) {
-            const rm = r.roadmapData || {};
+            const rm = true;
             const roadmapId = r._id;
             const roadmapTitle = (rm.title || '').toString();
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:385:24
         };
 
         for (const r of roadmaps) {
-            const rm = r.roadmapData || {};
+            const rm = false;
             const roadmapId = r._id;
             const roadmapTitle = (rm.title || '').toString();
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:387:35
         for (const r of roadmaps) {
             const rm = r.roadmapData || {};
             const roadmapId = r._id;
-            const roadmapTitle = (rm.title || '').toString();
+            const roadmapTitle = (true).toString();
             if (roadmapTitle.toLowerCase().includes(term)) {
                 results.roadmaps.push({ roadmapId, title: roadmapTitle });
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
controllers/Roadmap.js:387:35
         for (const r of roadmaps) {
             const rm = r.roadmapData || {};
             const roadmapId = r._id;
-            const roadmapTitle = (rm.title || '').toString();
+            const roadmapTitle = (rm.title && '').toString();
             if (roadmapTitle.toLowerCase().includes(term)) {
                 results.roadmaps.push({ roadmapId, title: roadmapTitle });
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:388:17
             const rm = r.roadmapData || {};
             const roadmapId = r._id;
             const roadmapTitle = (rm.title || '').toString();
-            if (roadmapTitle.toLowerCase().includes(term)) {
+            if (false) {
                 results.roadmaps.push({ roadmapId, title: roadmapTitle });
             }
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:388:17
             const rm = r.roadmapData || {};
             const roadmapId = r._id;
             const roadmapTitle = (rm.title || '').toString();
-            if (roadmapTitle.toLowerCase().includes(term)) {
+            if (true) {
                 results.roadmaps.push({ roadmapId, title: roadmapTitle });
             }
killedBy: searchRoadmaps() mutation-proof tests handles roadmap with missing roadmapData (covers rm || {})
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Survived] ArrayDeclaration
controllers/Roadmap.js:392:73
                 results.roadmaps.push({ roadmapId, title: roadmapTitle });
             }
 
-            const chapters = Array.isArray(rm.chapters) ? rm.chapters : [];
+            const chapters = Array.isArray(rm.chapters) ? rm.chapters : ["Stryker was here"];
             for (const ch of chapters) {
                 const chTitle = (ch.title || '').toString();

[Killed] ConditionalExpression
controllers/Roadmap.js:394:34
 
             const chapters = Array.isArray(rm.chapters) ? rm.chapters : [];
             for (const ch of chapters) {
-                const chTitle = (ch.title || '').toString();
+                const chTitle = (false).toString();
                 const chId = ch.id;
                 if (chTitle.toLowerCase().includes(term)) {
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
controllers/Roadmap.js:394:34
 
             const chapters = Array.isArray(rm.chapters) ? rm.chapters : [];
             for (const ch of chapters) {
-                const chTitle = (ch.title || '').toString();
+                const chTitle = (ch.title && '').toString();
                 const chId = ch.id;
                 if (chTitle.toLowerCase().includes(term)) {
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
controllers/Roadmap.js:396:59
             for (const ch of chapters) {
                 const chTitle = (ch.title || '').toString();
                 const chId = ch.id;
-                if (chTitle.toLowerCase().includes(term)) {
-                    results.chapters.push({
-                        roadmapId,
-                        title: chTitle,
-                        chapterId: chId,
-                        roadmapTitle,
-                    });
-                }
+                if (chTitle.toLowerCase().includes(term)) {}
                 const subs = Array.isArray(ch.subtopics) ? ch.subtopics : [];
                 for (const st of subs) {
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:396:21
             for (const ch of chapters) {
                 const chTitle = (ch.title || '').toString();
                 const chId = ch.id;
-                if (chTitle.toLowerCase().includes(term)) {
+                if (true) {
                     results.chapters.push({
                         roadmapId,
killedBy: searchRoadmaps() mutation-proof tests does not match irrelevant chapters or subtopics
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
controllers/Roadmap.js:405:40
                     });
                 }
                 const subs = Array.isArray(ch.subtopics) ? ch.subtopics : [];
-                for (const st of subs) {
-                    const stTitle = (st.title || '').toString();
-                    if (stTitle.toLowerCase().includes(term)) {
-                        results.subtopics.push({
-                            roadmapId,
-                            title: stTitle,
-                            chapterId: ch.id,
-                            subtopicId: st.id,
-                            roadmapTitle,
-                            chapterTitle: chTitle,
-                        });
-                    }
-                }
+                for (const st of subs) {}
             }
         }
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:406:38
                 }
                 const subs = Array.isArray(ch.subtopics) ? ch.subtopics : [];
                 for (const st of subs) {
-                    const stTitle = (st.title || '').toString();
+                    const stTitle = (true).toString();
                     if (stTitle.toLowerCase().includes(term)) {
                         results.subtopics.push({
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
controllers/Roadmap.js:406:38
                 }
                 const subs = Array.isArray(ch.subtopics) ? ch.subtopics : [];
                 for (const st of subs) {
-                    const stTitle = (st.title || '').toString();
+                    const stTitle = (st.title && '').toString();
                     if (stTitle.toLowerCase().includes(term)) {
                         results.subtopics.push({
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:407:25
                 const subs = Array.isArray(ch.subtopics) ? ch.subtopics : [];
                 for (const st of subs) {
                     const stTitle = (st.title || '').toString();
-                    if (stTitle.toLowerCase().includes(term)) {
+                    if (true) {
                         results.subtopics.push({
                             roadmapId,
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
controllers/Roadmap.js:407:25
                 const subs = Array.isArray(ch.subtopics) ? ch.subtopics : [];
                 for (const st of subs) {
                     const stTitle = (st.title || '').toString();
-                    if (stTitle.toLowerCase().includes(term)) {
+                    if (false) {
                         results.subtopics.push({
                             roadmapId,
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ObjectLiteral
controllers/Roadmap.js:408:48
                 for (const st of subs) {
                     const stTitle = (st.title || '').toString();
                     if (stTitle.toLowerCase().includes(term)) {
-                        results.subtopics.push({
-                            roadmapId,
-                            title: stTitle,
-                            chapterId: ch.id,
-                            subtopicId: st.id,
-                            roadmapTitle,
-                            chapterTitle: chTitle,
-                        });
+                        results.subtopics.push({});
                     }
                 }

[Survived] ObjectLiteral
controllers/Roadmap.js:424:22
 
         const noteMatches = await NoteModel.find({
             userId,
-            content: { $regex: q, $options: 'i' },
+            content: {},
         })
             .select({ roadmapId: 1, moduleId: 1, subtopicId: 1, content: 1 })

[Survived] ObjectLiteral
controllers/Roadmap.js:426:21
             userId,
             content: { $regex: q, $options: 'i' },
         })
-            .select({ roadmapId: 1, moduleId: 1, subtopicId: 1, content: 1 })
+            .select({})
             .lean();
 

[Killed] BlockStatement
controllers/Roadmap.js:429:48
             .select({ roadmapId: 1, moduleId: 1, subtopicId: 1, content: 1 })
             .lean();
 
-        const makeSnippet = (content, term) => {
-            if (!content) return '';
-            const idx = content.toLowerCase().indexOf(term);
-            if (idx === -1) return content.slice(0, 120);
-            const start = Math.max(0, idx - 40);
-            const end = Math.min(content.length, idx + term.length + 40);
-            const prefix = start > 0 ? '…' : '';
-            const suffix = end < content.length ? '…' : '';
-            return prefix + content.slice(start, end) + suffix;
-        };
+        const makeSnippet = (content, term) => {};
 
         for (const n of noteMatches) {
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
controllers/Roadmap.js:430:17
             .lean();
 
         const makeSnippet = (content, term) => {
-            if (!content) return '';
+            if (true) return '';
             const idx = content.toLowerCase().indexOf(term);
             if (idx === -1) return content.slice(0, 120);
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 0

[Killed] BooleanLiteral
controllers/Roadmap.js:430:17
             .lean();
 
         const makeSnippet = (content, term) => {
-            if (!content) return '';
+            if (content) return '';
             const idx = content.toLowerCase().indexOf(term);
             if (idx === -1) return content.slice(0, 120);
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 0

[Killed] MethodExpression
controllers/Roadmap.js:431:25
 
         const makeSnippet = (content, term) => {
             if (!content) return '';
-            const idx = content.toLowerCase().indexOf(term);
+            const idx = content.toUpperCase().indexOf(term);
             if (idx === -1) return content.slice(0, 120);
             const start = Math.max(0, idx - 40);
killedBy: searchRoadmaps() mutation-proof tests creates snippet with both prefix and suffix (covers prefix/suffix branches)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
controllers/Roadmap.js:432:36
         const makeSnippet = (content, term) => {
             if (!content) return '';
             const idx = content.toLowerCase().indexOf(term);
-            if (idx === -1) return content.slice(0, 120);
+            if (idx === -1) return content;
             const start = Math.max(0, idx - 40);
             const end = Math.min(content.length, idx + term.length + 40);
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 200

[Killed] UnaryOperator
controllers/Roadmap.js:432:25
         const makeSnippet = (content, term) => {
             if (!content) return '';
             const idx = content.toLowerCase().indexOf(term);
-            if (idx === -1) return content.slice(0, 120);
+            if (idx === +1) return content.slice(0, 120);
             const start = Math.max(0, idx - 40);
             const end = Math.min(content.length, idx + term.length + 40);
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 42

[Killed] MethodExpression
controllers/Roadmap.js:433:27
             if (!content) return '';
             const idx = content.toLowerCase().indexOf(term);
             if (idx === -1) return content.slice(0, 120);
-            const start = Math.max(0, idx - 40);
+            const start = Math.min(0, idx - 40);
             const end = Math.min(content.length, idx + term.length + 40);
             const prefix = start > 0 ? '…' : '';
killedBy: searchRoadmaps() mutation-proof tests creates snippet with both prefix and suffix (covers prefix/suffix branches)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
controllers/Roadmap.js:433:39
             if (!content) return '';
             const idx = content.toLowerCase().indexOf(term);
             if (idx === -1) return content.slice(0, 120);
-            const start = Math.max(0, idx - 40);
+            const start = Math.max(0, idx + 40);
             const end = Math.min(content.length, idx + term.length + 40);
             const prefix = start > 0 ? '…' : '';
killedBy: searchRoadmaps() mutation-proof tests creates snippet when match appears late
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /js/
Received string:  "…"

[Killed] ArithmeticOperator
controllers/Roadmap.js:434:50
             const idx = content.toLowerCase().indexOf(term);
             if (idx === -1) return content.slice(0, 120);
             const start = Math.max(0, idx - 40);
-            const end = Math.min(content.length, idx + term.length + 40);
+            const end = Math.min(content.length, idx + term.length - 40);
             const prefix = start > 0 ? '…' : '';
             const suffix = end < content.length ? '…' : '';
killedBy: searchRoadmaps() mutation-proof tests creates snippet when match appears late
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /js/
Received string:  "…"

[Killed] MethodExpression
controllers/Roadmap.js:434:25
             const idx = content.toLowerCase().indexOf(term);
             if (idx === -1) return content.slice(0, 120);
             const start = Math.max(0, idx - 40);
-            const end = Math.min(content.length, idx + term.length + 40);
+            const end = Math.max(content.length, idx + term.length + 40);
             const prefix = start > 0 ? '…' : '';
             const suffix = end < content.length ? '…' : '';
killedBy: searchRoadmaps() mutation-proof tests creates snippet with both prefix and suffix (covers prefix/suffix branches)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
controllers/Roadmap.js:435:28
             if (idx === -1) return content.slice(0, 120);
             const start = Math.max(0, idx - 40);
             const end = Math.min(content.length, idx + term.length + 40);
-            const prefix = start > 0 ? '…' : '';
+            const prefix = false ? '…' : '';
             const suffix = end < content.length ? '…' : '';
             return prefix + content.slice(start, end) + suffix;
killedBy: searchRoadmaps() mutation-proof tests creates snippet with both prefix and suffix (covers prefix/suffix branches)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
controllers/Roadmap.js:435:28
             if (idx === -1) return content.slice(0, 120);
             const start = Math.max(0, idx - 40);
             const end = Math.min(content.length, idx + term.length + 40);
-            const prefix = start > 0 ? '…' : '';
+            const prefix = start <= 0 ? '…' : '';
             const suffix = end < content.length ? '…' : '';
             return prefix + content.slice(start, end) + suffix;
killedBy: searchRoadmaps() mutation-proof tests creates snippet with both prefix and suffix (covers prefix/suffix branches)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
controllers/Roadmap.js:436:28
             const start = Math.max(0, idx - 40);
             const end = Math.min(content.length, idx + term.length + 40);
             const prefix = start > 0 ? '…' : '';
-            const suffix = end < content.length ? '…' : '';
+            const suffix = false ? '…' : '';
             return prefix + content.slice(start, end) + suffix;
         };
killedBy: searchRoadmaps() mutation-proof tests creates snippet with both prefix and suffix (covers prefix/suffix branches)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
