[Killed] BlockStatement
utils/urlHelpers.js:1:47
-export const buildVerifyAccountUrl = token => {
-    return `${process.env.FRONTEND_URL}/verifyAccount?token=${token}`;
-};
+export const buildVerifyAccountUrl = token => {};
 
 export const buildResetPasswordUrl = token => {
killedBy: urlHelpers.js buildVerifyAccountUrl() creates correct URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://frontend.com/verifyAccount?token=abc123"
Received: undefined

[Killed] BlockStatement
utils/urlHelpers.js:5:47
     return `${process.env.FRONTEND_URL}/verifyAccount?token=${token}`;
 };
 
-export const buildResetPasswordUrl = token => {
-    return `${process.env.FRONTEND_URL}/passwordReset?token=${token}`;
-};
+export const buildResetPasswordUrl = token => {};
 
 export const buildGoogleAuthUrl = () => {
killedBy: urlHelpers.js buildResetPasswordUrl() creates correct URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://frontend.com/passwordReset?token=xyz999"
Received: undefined

[Killed] StringLiteral
utils/urlHelpers.js:6:12
 };
 
 export const buildResetPasswordUrl = token => {
-    return `${process.env.FRONTEND_URL}/passwordReset?token=${token}`;
+    return ``;
 };
 
killedBy: urlHelpers.js buildResetPasswordUrl() creates correct URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://frontend.com/passwordReset?token=xyz999"
Received: ""

[Killed] BlockStatement
utils/urlHelpers.js:9:41
     return `${process.env.FRONTEND_URL}/passwordReset?token=${token}`;
 };
 
-export const buildGoogleAuthUrl = () => {
-    const params = new URLSearchParams({
-        client_id: process.env.GOOGLE_CLIENT_ID,
-        redirect_uri: process.env.GOOGLE_REDIRECT_URI,
-        response_type: 'code',
-        scope: 'email profile',
-    });
-    return `https://accounts.google.com/o/oauth2/v2/auth?${params.toString()}`;
-};
+export const buildGoogleAuthUrl = () => {};
 
 export const buildGithubAuthUrl = () => {
killedBy: urlHelpers.js buildGoogleAuthUrl() returns valid Google OAuth URL
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] StringLiteral
utils/urlHelpers.js:13:24
     const params = new URLSearchParams({
         client_id: process.env.GOOGLE_CLIENT_ID,
         redirect_uri: process.env.GOOGLE_REDIRECT_URI,
-        response_type: 'code',
+        response_type: "",
         scope: 'email profile',
     });
killedBy: urlHelpers.js buildGoogleAuthUrl() returns valid Google OAuth URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "code"
Received: ""

[Killed] StringLiteral
utils/urlHelpers.js:16:12
         response_type: 'code',
         scope: 'email profile',
     });
-    return `https://accounts.google.com/o/oauth2/v2/auth?${params.toString()}`;
+    return ``;
 };
 
killedBy: urlHelpers.js buildGoogleAuthUrl() returns valid Google OAuth URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
utils/urlHelpers.js:19:41
     return `https://accounts.google.com/o/oauth2/v2/auth?${params.toString()}`;
 };
 
-export const buildGithubAuthUrl = () => {
-    const params = new URLSearchParams({
-        client_id: process.env.GITHUB_CLIENT_ID,
-        redirect_uri: process.env.GITHUB_REDIRECT_URI,
-        scope: 'user:email',
-    });
-    return `https://github.com/login/oauth/authorize?${params.toString()}`;
-};
+export const buildGithubAuthUrl = () => {};
 
 export const buildGoogleTokenParams = code => {
killedBy: urlHelpers.js buildGithubAuthUrl() returns valid GitHub OAuth URL
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')

[Killed] StringLiteral
utils/urlHelpers.js:23:16
     const params = new URLSearchParams({
         client_id: process.env.GITHUB_CLIENT_ID,
         redirect_uri: process.env.GITHUB_REDIRECT_URI,
-        scope: 'user:email',
+        scope: "",
     });
     return `https://github.com/login/oauth/authorize?${params.toString()}`;
killedBy: urlHelpers.js buildGithubAuthUrl() returns valid GitHub OAuth URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user:email"
Received: ""

[Killed] BlockStatement
utils/urlHelpers.js:28:47
     return `https://github.com/login/oauth/authorize?${params.toString()}`;
 };
 
-export const buildGoogleTokenParams = code => {
-    const params = new URLSearchParams();
-    params.append('code', code);
-    params.append('client_id', process.env.GOOGLE_CLIENT_ID);
-    params.append('client_secret', process.env.GOOGLE_CLIENT_SECRET);
-    params.append('redirect_uri', process.env.GOOGLE_REDIRECT_URI);
-    params.append('grant_type', 'authorization_code');
-    return params;
-};
+export const buildGoogleTokenParams = code => {};
 
 export const buildGithubTokenParams = code=> {
killedBy: urlHelpers.js buildGoogleTokenParams() returns correct URLSearchParams
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] StringLiteral
utils/urlHelpers.js:33:19
     params.append('code', code);
     params.append('client_id', process.env.GOOGLE_CLIENT_ID);
     params.append('client_secret', process.env.GOOGLE_CLIENT_SECRET);
-    params.append('redirect_uri', process.env.GOOGLE_REDIRECT_URI);
+    params.append("", process.env.GOOGLE_REDIRECT_URI);
     params.append('grant_type', 'authorization_code');
     return params;
killedBy: urlHelpers.js buildGoogleTokenParams() returns correct URLSearchParams
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://frontend.com/google/callback"
Received: null

[Killed] BlockStatement
utils/urlHelpers.js:38:46
     return params;
 };
 
-export const buildGithubTokenParams = code=> {
-    const params = new URLSearchParams();
-    params.append('code', code);
-    params.append('client_id', process.env.GITHUB_CLIENT_ID);
-    params.append('client_secret', process.env.GITHUB_CLIENT_SECRET);
-    params.append('redirect_uri', process.env.GITHUB_REDIRECT_URI);
-    return params.toString();
-}
+export const buildGithubTokenParams = code=> {}
 
 export const buildEmailVerifyUrl = email => {
killedBy: urlHelpers.js buildGithubTokenParams() returns correct serialized param string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: null

[Killed] StringLiteral
utils/urlHelpers.js:40:19
 
 export const buildGithubTokenParams = code=> {
     const params = new URLSearchParams();
-    params.append('code', code);
+    params.append("", code);
     params.append('client_id', process.env.GITHUB_CLIENT_ID);
     params.append('client_secret', process.env.GITHUB_CLIENT_SECRET);
killedBy: urlHelpers.js buildGithubTokenParams() returns correct serialized param string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc"
Received: null

[Killed] StringLiteral
utils/urlHelpers.js:41:19
 export const buildGithubTokenParams = code=> {
     const params = new URLSearchParams();
     params.append('code', code);
-    params.append('client_id', process.env.GITHUB_CLIENT_ID);
+    params.append("", process.env.GITHUB_CLIENT_ID);
     params.append('client_secret', process.env.GITHUB_CLIENT_SECRET);
     params.append('redirect_uri', process.env.GITHUB_REDIRECT_URI);
killedBy: urlHelpers.js buildGithubTokenParams() returns correct serialized param string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "github-client"
Received: null

[Killed] StringLiteral
utils/urlHelpers.js:43:19
     params.append('code', code);
     params.append('client_id', process.env.GITHUB_CLIENT_ID);
     params.append('client_secret', process.env.GITHUB_CLIENT_SECRET);
-    params.append('redirect_uri', process.env.GITHUB_REDIRECT_URI);
+    params.append("", process.env.GITHUB_REDIRECT_URI);
     return params.toString();
 }
killedBy: urlHelpers.js buildGithubTokenParams() returns correct serialized param string
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://frontend.com/github/callback"
Received: null

[Killed] BlockStatement
utils/urlHelpers.js:47:45
     return params.toString();
 }
 
-export const buildEmailVerifyUrl = email => {
-    return `https://api.emailvalidation.io/v1/info?apikey=${process.env.EMAIL_VERIFICATION_KEY}&email=${email}`;
-}
+export const buildEmailVerifyUrl = email => {}
killedBy: urlHelpers.js buildEmailVerifyUrl() builds correct email verification URL
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "https://api.emailvalidation.io/v1/info?apikey=emailkey123&email=test@example.com"
Received: undefined
