[Killed] EqualityOperator
controllers/Roadmap.js:436:28
             const start = Math.max(0, idx - 40);
             const end = Math.min(content.length, idx + term.length + 40);
             const prefix = start > 0 ? '…' : '';
-            const suffix = end < content.length ? '…' : '';
+            const suffix = end >= content.length ? '…' : '';
             return prefix + content.slice(start, end) + suffix;
         };
killedBy: searchRoadmaps() mutation-proof tests creates snippet with both prefix and suffix (covers prefix/suffix branches)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
controllers/Roadmap.js:437:20
             const end = Math.min(content.length, idx + term.length + 40);
             const prefix = start > 0 ? '…' : '';
             const suffix = end < content.length ? '…' : '';
-            return prefix + content.slice(start, end) + suffix;
+            return prefix + content.slice(start, end) - suffix;
         };
 
killedBy: searchRoadmaps() mutation-proof tests creates snippet when match appears late
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has type:  number
Received has value: NaN

[Killed] ArithmeticOperator
controllers/Roadmap.js:437:20
             const end = Math.min(content.length, idx + term.length + 40);
             const prefix = start > 0 ? '…' : '';
             const suffix = end < content.length ? '…' : '';
-            return prefix + content.slice(start, end) + suffix;
+            return prefix - content.slice(start, end) + suffix;
         };
 
killedBy: searchRoadmaps() mutation-proof tests creates snippet when match appears late
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /js/
Received string:  "NaN"

[Killed] BlockStatement
controllers/Roadmap.js:440:38
             return prefix + content.slice(start, end) + suffix;
         };
 
-        for (const n of noteMatches) {
-            results.notes.push({
-                roadmapId: n.roadmapId,
-                moduleId: n.moduleId,
-                subtopicId: n.subtopicId,
-                snippet: makeSnippet(n.content || '', term),
-            });
-        }
+        for (const n of noteMatches) {}
 
         // Simple pagination on combined items: return counts for each group and per-group page slices
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ObjectLiteral
controllers/Roadmap.js:441:32
         };
 
         for (const n of noteMatches) {
-            results.notes.push({
-                roadmapId: n.roadmapId,
-                moduleId: n.moduleId,
-                subtopicId: n.subtopicId,
-                snippet: makeSnippet(n.content || '', term),
-            });
+            results.notes.push({});
         }
 
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
controllers/Roadmap.js:445:38
                 roadmapId: n.roadmapId,
                 moduleId: n.moduleId,
                 subtopicId: n.subtopicId,
-                snippet: makeSnippet(n.content || '', term),
+                snippet: makeSnippet(false, term),
             });
         }
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 120
Received: 0

[Killed] ConditionalExpression
controllers/Roadmap.js:445:38
                 roadmapId: n.roadmapId,
                 moduleId: n.moduleId,
                 subtopicId: n.subtopicId,
-                snippet: makeSnippet(n.content || '', term),
+                snippet: makeSnippet(true, term),
             });
         }
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'roadmaps')

[Killed] ArrowFunction
controllers/Roadmap.js:450:26
         }
 
         // Simple pagination on combined items: return counts for each group and per-group page slices
-        const paginate = arr => ({
-            total: arr.length,
-            items: arr.slice((page - 1) * pageSize, page * pageSize),
-        });
+        const paginate = () => undefined;
 
         return res.status(200).json({
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: TypeError: Cannot read properties of undefined (reading 'total')

[Killed] ObjectLiteral
controllers/Roadmap.js:450:34
         }
 
         // Simple pagination on combined items: return counts for each group and per-group page slices
-        const paginate = arr => ({
-            total: arr.length,
-            items: arr.slice((page - 1) * pageSize, page * pageSize),
-        });
+        const paginate = arr => ({});
 
         return res.status(200).json({
killedBy: searchRoadmaps() mutation-proof tests searches roadmaps successfully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
controllers/Roadmap.js:452:31
         // Simple pagination on combined items: return counts for each group and per-group page slices
         const paginate = arr => ({
             total: arr.length,
-            items: arr.slice((page - 1) * pageSize, page * pageSize),
+            items: arr.slice((page + 1) * pageSize, page * pageSize),
         });
 
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: TypeError: Cannot read properties of undefined (reading 'snippet')

[Killed] ArithmeticOperator
controllers/Roadmap.js:452:53
         // Simple pagination on combined items: return counts for each group and per-group page slices
         const paginate = arr => ({
             total: arr.length,
-            items: arr.slice((page - 1) * pageSize, page * pageSize),
+            items: arr.slice((page - 1) * pageSize, page / pageSize),
         });
 
killedBy: searchRoadmaps() mutation-proof tests snippet returns first 120 characters when no match
statusReason: TypeError: Cannot read properties of undefined (reading 'snippet')

[Killed] ObjectLiteral
controllers/Roadmap.js:455:37
             items: arr.slice((page - 1) * pageSize, page * pageSize),
         });
 
-        return res.status(200).json({
-            success: true,
-            data: {
-                query: q,
-                page,
-                pageSize,
-                roadmaps: paginate(results.roadmaps),
-                chapters: paginate(results.chapters),
-                subtopics: paginate(results.subtopics),
-                notes: paginate(results.notes),
-            },
-        });
+        return res.status(200).json({});
     } catch (error) {
         console.error('Error in searchRoadmaps:', error);
killedBy: searchRoadmaps() mutation-proof tests uses default page=1 when page missing
statusReason: TypeError: Cannot read properties of undefined (reading 'page')

[Killed] BlockStatement
controllers/Roadmap.js:467:21
                 notes: paginate(results.notes),
             },
         });
-    } catch (error) {
-        console.error('Error in searchRoadmaps:', error);
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: searchRoadmaps() mutation-proof tests returns 500 on database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] BooleanLiteral
controllers/Roadmap.js:469:48
         });
     } catch (error) {
         console.error('Error in searchRoadmaps:', error);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({ success: true, message: error.message });
     }
 };

[Survived] ObjectLiteral
controllers/Roadmap.js:469:37
         });
     } catch (error) {
         console.error('Error in searchRoadmaps:', error);
-        return res.status(500).json({ success: false, message: error.message });
+        return res.status(500).json({});
     }
 };

[Killed] BlockStatement
controllers/Roadmap.js:473:53
     }
 };
 
-export const togglePinRoadmap = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-        const { email } = req;
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId, email });
-
-        if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
-        }
-
-        roadmap.isPinned = !roadmap.isPinned;
-        await roadmap.save();
-
-        return res.status(200).json({
-            success: true,
-            data: roadmap,
-            message: `Roadmap ${roadmap.isPinned ? 'pinned' : 'unpinned'} successfully`
-        });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
-};
+export const togglePinRoadmap = async (req, res) => {};
killedBy: togglePinRoadmap() mutation-proof tests should toggle isPinned from false → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/Roadmap.js:474:9
 };
 
 export const togglePinRoadmap = async (req, res) => {
-    try {
-        const { roadmapId } = req.body;
-        const { email } = req;
-
-        const roadmap = await RoadmapModel.findOne({ _id: roadmapId, email });
-
-        if (!roadmap) {
-            return res.status(404).json({ success: false, message: 'Roadmap not found' });
-        }
-
-        roadmap.isPinned = !roadmap.isPinned;
-        await roadmap.save();
-
-        return res.status(200).json({
-            success: true,
-            data: roadmap,
-            message: `Roadmap ${roadmap.isPinned ? 'pinned' : 'unpinned'} successfully`
-        });
-    } catch (error) {
+    try {} catch (error) {
         return res.status(500).json({ success: false, message: error.message });
     }
killedBy: togglePinRoadmap() mutation-proof tests should toggle isPinned from false → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
controllers/Roadmap.js:484:28
             return res.status(404).json({ success: false, message: 'Roadmap not found' });
         }
 
-        roadmap.isPinned = !roadmap.isPinned;
+        roadmap.isPinned = roadmap.isPinned;
         await roadmap.save();
 
killedBy: togglePinRoadmap() mutation-proof tests should toggle isPinned from false → true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
controllers/Roadmap.js:492:21
             data: roadmap,
             message: `Roadmap ${roadmap.isPinned ? 'pinned' : 'unpinned'} successfully`
         });
-    } catch (error) {
-        return res.status(500).json({ success: false, message: error.message });
-    }
+    } catch (error) {}
 };
killedBy: togglePinRoadmap() mutation-proof tests should return 500 when DB throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
