[Survived] ObjectLiteral
controllers/S3Controller.js:13:25
 } from "@aws-sdk/client-s3";
 import {langMap} from "../utils/mapping.js"
 
-const s3 = new S3Client({
-  region: "auto",
-  endpoint: `https://${process.env.CLOUDFLARE_ACCOUNT_ID}.r2.cloudflarestorage.com`,
-  credentials: {
-    accessKeyId: process.env.R2_ACCESS_KEY_ID,
-    secretAccessKey: process.env.R2_SECRET_ACCESS_KEY,
-  },
-});
+const s3 = new S3Client({});
 const BUCKET = process.env.R2_BUCKET_NAME;
 

[Killed] ArrowFunction
controllers/S3Controller.js:23:24
 });
 const BUCKET = process.env.R2_BUCKET_NAME;
 
-const streamToString = (stream) =>
-  new Promise((resolve, reject) => {
-    const chunks = [];
-    stream.on("data", (chunk) => chunks.push(chunk));
-    stream.on("error", reject);
-    stream.on("end", () => resolve(Buffer.concat(chunks).toString("utf-8")));
-  });
+const streamToString = () => undefined;
 // ✅ expose only for testing (loadProjectFiles triggers it indirectly)
 export const __streamToString = streamToString;
killedBy: streamToString() internal utility should resolve with concatenated UTF-8 text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello "
Received: undefined

[Killed] BlockStatement
controllers/S3Controller.js:24:36
 const BUCKET = process.env.R2_BUCKET_NAME;
 
 const streamToString = (stream) =>
-  new Promise((resolve, reject) => {
-    const chunks = [];
-    stream.on("data", (chunk) => chunks.push(chunk));
-    stream.on("error", reject);
-    stream.on("end", () => resolve(Buffer.concat(chunks).toString("utf-8")));
-  });
+  new Promise((resolve, reject) => {});
 // ✅ expose only for testing (loadProjectFiles triggers it indirectly)
 export const __streamToString = streamToString;
killedBy: streamToString() internal utility should resolve with concatenated UTF-8 text
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrowFunction
controllers/S3Controller.js:26:23
 const streamToString = (stream) =>
   new Promise((resolve, reject) => {
     const chunks = [];
-    stream.on("data", (chunk) => chunks.push(chunk));
+    stream.on("data", () => undefined);
     stream.on("error", reject);
     stream.on("end", () => resolve(Buffer.concat(chunks).toString("utf-8")));
killedBy: streamToString() internal utility should resolve with concatenated UTF-8 text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello "
Received: ""

[Killed] StringLiteral
controllers/S3Controller.js:26:15
 const streamToString = (stream) =>
   new Promise((resolve, reject) => {
     const chunks = [];
-    stream.on("data", (chunk) => chunks.push(chunk));
+    stream.on("", (chunk) => chunks.push(chunk));
     stream.on("error", reject);
     stream.on("end", () => resolve(Buffer.concat(chunks).toString("utf-8")));
killedBy: streamToString() internal utility should resolve with concatenated UTF-8 text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Hello "
Received: ""

[Killed] ArrowFunction
controllers/S3Controller.js:28:22
     const chunks = [];
     stream.on("data", (chunk) => chunks.push(chunk));
     stream.on("error", reject);
-    stream.on("end", () => resolve(Buffer.concat(chunks).toString("utf-8")));
+    stream.on("end", () => undefined);
   });
 // ✅ expose only for testing (loadProjectFiles triggers it indirectly)
killedBy: streamToString() internal utility should resolve with concatenated UTF-8 text
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
controllers/S3Controller.js:28:15
     const chunks = [];
     stream.on("data", (chunk) => chunks.push(chunk));
     stream.on("error", reject);
-    stream.on("end", () => resolve(Buffer.concat(chunks).toString("utf-8")));
+    stream.on("", () => resolve(Buffer.concat(chunks).toString("utf-8")));
   });
 // ✅ expose only for testing (loadProjectFiles triggers it indirectly)
killedBy: streamToString() internal utility should resolve with concatenated UTF-8 text
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
controllers/S3Controller.js:34:48
 export const __streamToString = streamToString;
 
 
-const getLanguageFromExtension = (filename) => {
-    const ext = filename.split('.').pop();
-    switch (ext) {
-        case 'js': return 'javascript';
-        case 'py': return 'python';
-        case 'java': return 'java';
-        case 'cpp': return 'cpp';
-        default: return 'plaintext';
-    }
-}
+const getLanguageFromExtension = (filename) => {}
 export const __getLanguageFromExtension = getLanguageFromExtension;
 
killedBy: __getLanguageFromExtension() utility should return 'javascript' for .js files
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "javascript"
Received: undefined

[Killed] ConditionalExpression
controllers/S3Controller.js:37:9
 const getLanguageFromExtension = (filename) => {
     const ext = filename.split('.').pop();
     switch (ext) {
-        case 'js': return 'javascript';
+        case 'js':
         case 'py': return 'python';
         case 'java': return 'java';
killedBy: __getLanguageFromExtension() utility should return 'javascript' for .js files
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "javascript"
Received: "python"

[Killed] StringLiteral
controllers/S3Controller.js:37:14
 const getLanguageFromExtension = (filename) => {
     const ext = filename.split('.').pop();
     switch (ext) {
-        case 'js': return 'javascript';
+        case "": return 'javascript';
         case 'py': return 'python';
         case 'java': return 'java';
killedBy: __getLanguageFromExtension() utility should return 'javascript' for .js files
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "javascript"
Received: "plaintext"

[Killed] ConditionalExpression
controllers/S3Controller.js:38:9
     const ext = filename.split('.').pop();
     switch (ext) {
         case 'js': return 'javascript';
-        case 'py': return 'python';
+        case 'py':
         case 'java': return 'java';
         case 'cpp': return 'cpp';
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,21 +1,21 @@
  Object {
    "data": Array [

[Killed] StringLiteral
controllers/S3Controller.js:38:27
     const ext = filename.split('.').pop();
     switch (ext) {
         case 'js': return 'javascript';
-        case 'py': return 'python';
+        case 'py': return "";
         case 'java': return 'java';
         case 'cpp': return 'cpp';
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,21 +1,21 @@
  Object {
    "data": Array [

[Killed] ConditionalExpression
controllers/S3Controller.js:39:9
     switch (ext) {
         case 'js': return 'javascript';
         case 'py': return 'python';
-        case 'java': return 'java';
+        case 'java':
         case 'cpp': return 'cpp';
         default: return 'plaintext';
killedBy: __getLanguageFromExtension() utility should return 'java' for .java files
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "java"
Received: "cpp"

[Killed] StringLiteral
controllers/S3Controller.js:39:14
     switch (ext) {
         case 'js': return 'javascript';
         case 'py': return 'python';
-        case 'java': return 'java';
+        case "": return 'java';
         case 'cpp': return 'cpp';
         default: return 'plaintext';
killedBy: __getLanguageFromExtension() utility should return 'java' for .java files
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "java"
Received: "plaintext"

[Killed] ConditionalExpression
controllers/S3Controller.js:40:9
         case 'js': return 'javascript';
         case 'py': return 'python';
         case 'java': return 'java';
-        case 'cpp': return 'cpp';
+        case 'cpp':
         default: return 'plaintext';
     }
killedBy: __getLanguageFromExtension() utility should return 'cpp' for .cpp files
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cpp"
Received: "plaintext"

[Killed] StringLiteral
controllers/S3Controller.js:40:28
         case 'js': return 'javascript';
         case 'py': return 'python';
         case 'java': return 'java';
-        case 'cpp': return 'cpp';
+        case 'cpp': return "";
         default: return 'plaintext';
     }
killedBy: __getLanguageFromExtension() utility should return 'cpp' for .cpp files
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cpp"
Received: ""

[Killed] ConditionalExpression
controllers/S3Controller.js:41:9
         case 'py': return 'python';
         case 'java': return 'java';
         case 'cpp': return 'cpp';
-        default: return 'plaintext';
+        default:
     }
 }
killedBy: __getLanguageFromExtension() utility should return 'plaintext' for unknown extensions
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "plaintext"
Received: undefined

[Killed] ConditionalExpression
controllers/S3Controller.js:50:9
 export const loadProjectFiles = async (req, res) => {
   try {
     const { key } = req.body; 
-    if (!key) {
+    if (false) {
       return res.status(400).json({ success: false, message: "key (project prefix) is required" });
     }
killedBy: loadProjectFiles() loadProjectFiles method should return 400 if key is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BlockStatement
controllers/S3Controller.js:50:15
 export const loadProjectFiles = async (req, res) => {
   try {
     const { key } = req.body; 
-    if (!key) {
-      return res.status(400).json({ success: false, message: "key (project prefix) is required" });
-    }
+    if (!key) {}
 
     const listResp = await s3.send(new ListObjectsV2Command({ Bucket: BUCKET, Prefix: key }));
killedBy: loadProjectFiles() loadProjectFiles method should return 400 if key is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/S3Controller.js:51:46
   try {
     const { key } = req.body; 
     if (!key) {
-      return res.status(400).json({ success: false, message: "key (project prefix) is required" });
+      return res.status(400).json({ success: true, message: "key (project prefix) is required" });
     }
 
killedBy: loadProjectFiles() loadProjectFiles method should return 400 if key is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "key (project prefix) is required",
-   "success": false,

[Killed] StringLiteral
controllers/S3Controller.js:51:62
   try {
     const { key } = req.body; 
     if (!key) {
-      return res.status(400).json({ success: false, message: "key (project prefix) is required" });
+      return res.status(400).json({ success: false, message: "" });
     }
 
killedBy: loadProjectFiles() loadProjectFiles method should return 400 if key is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "key (project prefix) is required",
+   "message": "",

[Killed] LogicalOperator
controllers/S3Controller.js:56:9
 
     const listResp = await s3.send(new ListObjectsV2Command({ Bucket: BUCKET, Prefix: key }));
 
-    if (!listResp.Contents || listResp.Contents.length === 0) {
+    if (!listResp.Contents && listResp.Contents.length === 0) {
       
       // const defaultFile = {
killedBy: loadProjectFiles() loadProjectFiles method should return empty array when Contents is undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [],
-   "message": "Files loaded successfully",

[Killed] EqualityOperator
controllers/S3Controller.js:56:31
 
     const listResp = await s3.send(new ListObjectsV2Command({ Bucket: BUCKET, Prefix: key }));
 
-    if (!listResp.Contents || listResp.Contents.length === 0) {
+    if (!listResp.Contents || listResp.Contents.length !== 0) {
       
       // const defaultFile = {
killedBy: saveToS3() method should run streamToString() indirectly via loadProjectFiles
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<GetObjectCommand>
Received: {"args": {"Bucket": undefined, "Prefix": "folder/"}}

Number of calls: 1

[Killed] BooleanLiteral
controllers/S3Controller.js:67:34
       //   output: '',
       //   saved: true,
       // };
-      return res.json({ success: true, message: "Files loaded successfully", data: [] });
+      return res.json({ success: false, message: "Files loaded successfully", data: [] });
     }
 
killedBy: loadProjectFiles() loadProjectFiles method should return empty array when no files found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Array [],
    "message": "Files loaded successfully",

[Killed] BlockStatement
controllers/S3Controller.js:70:67
       return res.json({ success: true, message: "Files loaded successfully", data: [] });
     }
 
-    const fileDataPromises = listResp.Contents.map(async (obj) => {
-      if (!obj.Key) return null;
-
-      const getResp = await s3.send(new GetObjectCommand({ Bucket: BUCKET, Key: obj.Key }));
-      const content = await streamToString(getResp.Body);
-      const fileName = obj.Key.replace(key, ""); 
-
-
-      if (!fileName) return null;
-
-      return {
-        id: `s3_${fileName}_${Math.random()}`, 
-        name: fileName,
-        language: getLanguageFromExtension(fileName),
-        code: content,
-        input: '', 
-        output: '', 
-        saved: true,
-      };
-    });
+    const fileDataPromises = listResp.Contents.map(async (obj) => {});
 
     const files = (await Promise.all(fileDataPromises)).filter(Boolean);
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [
-     Object {

[Killed] ConditionalExpression
controllers/S3Controller.js:71:11
     }
 
     const fileDataPromises = listResp.Contents.map(async (obj) => {
-      if (!obj.Key) return null;
+      if (false) return null;
 
       const getResp = await s3.send(new GetObjectCommand({ Bucket: BUCKET, Key: obj.Key }));
killedBy: loadProjectFiles() loadProjectFiles method should skip entries with no Key and return empty data array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [],
-   "message": "Files loaded successfully",

[Killed] ConditionalExpression
controllers/S3Controller.js:71:11
     }
 
     const fileDataPromises = listResp.Contents.map(async (obj) => {
-      if (!obj.Key) return null;
+      if (true) return null;
 
       const getResp = await s3.send(new GetObjectCommand({ Bucket: BUCKET, Key: obj.Key }));
killedBy: saveToS3() method should run streamToString() indirectly via loadProjectFiles
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<GetObjectCommand>
Received: {"args": {"Bucket": undefined, "Prefix": "folder/"}}

Number of calls: 1

[Killed] StringLiteral
controllers/S3Controller.js:75:45
 
       const getResp = await s3.send(new GetObjectCommand({ Bucket: BUCKET, Key: obj.Key }));
       const content = await streamToString(getResp.Body);
-      const fileName = obj.Key.replace(key, ""); 
+      const fileName = obj.Key.replace(key, "Stryker was here!"); 
 
 
killedBy: saveToS3() method should skip objects where Key equals prefix (empty filename)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [],
+   "data": Array [

[Killed] ConditionalExpression
controllers/S3Controller.js:78:11
       const fileName = obj.Key.replace(key, ""); 
 
 
-      if (!fileName) return null;
+      if (true) return null;
 
       return {
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [
-     Object {

[Killed] BooleanLiteral
controllers/S3Controller.js:78:11
       const fileName = obj.Key.replace(key, ""); 
 
 
-      if (!fileName) return null;
+      if (fileName) return null;
 
       return {
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [
-     Object {

[Killed] StringLiteral
controllers/S3Controller.js:81:13
       if (!fileName) return null;
 
       return {
-        id: `s3_${fileName}_${Math.random()}`, 
+        id: ``, 
         name: fileName,
         language: getLanguageFromExtension(fileName),
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,19 +1,19 @@
  Object {
    "data": Array [

[Killed] StringLiteral
controllers/S3Controller.js:86:17
         language: getLanguageFromExtension(fileName),
         code: content,
         input: '', 
-        output: '', 
+        output: "Stryker was here!", 
         saved: true,
       };
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,23 +1,23 @@
  Object {
    "data": Array [

[Killed] BooleanLiteral
controllers/S3Controller.js:87:16
         code: content,
         input: '', 
         output: '', 
-        saved: true,
+        saved: false,
       };
     });
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Array [
      Object {

[Killed] MethodExpression
controllers/S3Controller.js:91:19
       };
     });
 
-    const files = (await Promise.all(fileDataPromises)).filter(Boolean);
+    const files = await Promise.all(fileDataPromises);
     return res.json({ success: true, message: "Files loaded successfully", data: files.length > 0 ? files : [/* send default file if you want */] });
 
killedBy: loadProjectFiles() loadProjectFiles method should skip entries with no Key and return empty data array
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [],
+   "data": Array [

[Killed] BooleanLiteral
controllers/S3Controller.js:92:32
     });
 
     const files = (await Promise.all(fileDataPromises)).filter(Boolean);
-    return res.json({ success: true, message: "Files loaded successfully", data: files.length > 0 ? files : [/* send default file if you want */] });
+    return res.json({ success: false, message: "Files loaded successfully", data: files.length > 0 ? files : [/* send default file if you want */] });
 
   } catch (error) {
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "data": Array [
      Object {

[Killed] EqualityOperator
controllers/S3Controller.js:92:82
     });
 
     const files = (await Promise.all(fileDataPromises)).filter(Boolean);
-    return res.json({ success: true, message: "Files loaded successfully", data: files.length > 0 ? files : [/* send default file if you want */] });
+    return res.json({ success: true, message: "Files loaded successfully", data: files.length <= 0 ? files : [/* send default file if you want */] });
 
   } catch (error) {
killedBy: loadProjectFiles() loadProjectFiles method should return files successfully when files are present
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "data": Array [
-     Object {

[Killed] BlockStatement
controllers/S3Controller.js:94:19
     const files = (await Promise.all(fileDataPromises)).filter(Boolean);
     return res.json({ success: true, message: "Files loaded successfully", data: files.length > 0 ? files : [/* send default file if you want */] });
 
-  } catch (error) {
-    console.log("Error loading project files:", error);
-    return res.status(500).json({ success: false, message: "Error loading project", details: error.message });
-  }
+  } catch (error) {}
 };
 
killedBy: loadProjectFiles() loadProjectFiles method should return 500 if S3 throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:96:44
 
   } catch (error) {
     console.log("Error loading project files:", error);
-    return res.status(500).json({ success: false, message: "Error loading project", details: error.message });
+    return res.status(500).json({ success: true, message: "Error loading project", details: error.message });
   }
 };
killedBy: loadProjectFiles() loadProjectFiles method should return 500 if S3 throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "details": "S3 error",
    "message": "Error loading project",

[Killed] ObjectLiteral
controllers/S3Controller.js:96:33
 
   } catch (error) {
     console.log("Error loading project files:", error);
-    return res.status(500).json({ success: false, message: "Error loading project", details: error.message });
+    return res.status(500).json({});
   }
 };
killedBy: loadProjectFiles() loadProjectFiles method should return 500 if S3 throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "details": "S3 error",
-   "message": "Error loading project",

[Killed] EqualityOperator
controllers/S3Controller.js:105:31
     const { key, filePath, content } = req.validatedData;
     
     
-    if (!key || !filePath || (content === undefined)) {
+    if (!key || !filePath || (content !== undefined)) {
       return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
     }
killedBy: saveToS3() method should save file to S3 when file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<HeadObjectCommand>

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:105:9
     const { key, filePath, content } = req.validatedData;
     
     
-    if (!key || !filePath || (content === undefined)) {
+    if (key || !filePath || (content === undefined)) {
       return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
     }
killedBy: saveToS3() method should save file to S3 when file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<HeadObjectCommand>

Number of calls: 0

[Survived] BooleanLiteral
controllers/S3Controller.js:106:46
     
     
     if (!key || !filePath || (content === undefined)) {
-      return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
+      return res.status(400).json({ success: true, message: "key, filePath, and content are required" });
     }
 

[Survived] ObjectLiteral
controllers/S3Controller.js:106:35
     
     
     if (!key || !filePath || (content === undefined)) {
-      return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
+      return res.status(400).json({});
     }
 

[Killed] BlockStatement
controllers/S3Controller.js:109:9
       return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
     }
 
-    try {
-      await s3.send(new HeadObjectCommand({ Bucket: BUCKET, Key: `${key}${filePath}` }));
-      return res.status(400).json({
-        success: false,
-        message: "File already exists at this path",
-      });
-    } catch (err) {}
+    try {} catch (err) {}
 
 
killedBy: saveToS3() method should save file to S3 when file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<HeadObjectCommand>
Received: {"args": {"Body": "console.log('Hello');", "Bucket": undefined, "ContentType": "text/plain", "Key": "user123/main.js"}}

Number of calls: 1

[Killed] ConditionalExpression
controllers/S3Controller.js:129:17
     const node = {
       id: `${key}${filePath}_${Math.random()}`,  
       name: filePath,                            
-      language: langMap[filePath.split('/').pop().split('.').pop()]||"plaintext", 
+      language: false, 
       code: content,
       input: "",
killedBy: saveToS3() method should assign plaintext language when extension is unknown
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"language": "plaintext"}, "success": true}
Received: {"data": {"code": "Hello world", "id": "user123/notes.unknownext_0.02969987689341891", "input": "", "language": false, "name": "notes.unknownext", "output": "", "saved": true}, "message": "File saved successfully", "success": true}

[Killed] LogicalOperator
controllers/S3Controller.js:129:17
     const node = {
       id: `${key}${filePath}_${Math.random()}`,  
       name: filePath,                            
-      language: langMap[filePath.split('/').pop().split('.').pop()]||"plaintext", 
+      language: langMap[filePath.split('/').pop().split('.').pop()] && "plaintext", 
       code: content,
       input: "",
killedBy: saveToS3() method should assign plaintext language when extension is unknown
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"language": "plaintext"}, "success": true}
Received: {"data": {"code": "Hello world", "id": "user123/notes.unknownext_0.936583066151712", "input": "", "language": undefined, "name": "notes.unknownext", "output": "", "saved": true}, "message": "File saved successfully", "success": true}

[Survived] BooleanLiteral
controllers/S3Controller.js:133:14
       code: content,
       input: "",
       output: "",
-      saved: true,
+      saved: false,
     };
 

[Killed] BooleanLiteral
controllers/S3Controller.js:136:32
       saved: true,
     };
 
-    return res.json({ success: true, message: "File saved successfully", data: node });
+    return res.json({ success: false, message: "File saved successfully", data: node });
   } catch (error) {
     console.error("Error saving file:", error);
killedBy: saveToS3() method should save file to S3 when file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "File saved successfully", "success": true}
Received: {"data": {"code": "console.log('Hello');", "id": "user123/main.js_0.4962067046464489", "input": "", "language": "javascript", "name": "main.js", "output": "", "saved": true}, "message": "File saved successfully", "success": false}

Number of calls

[Killed] BlockStatement
controllers/S3Controller.js:137:19
     };
 
     return res.json({ success: true, message: "File saved successfully", data: node });
-  } catch (error) {
-    console.error("Error saving file:", error);
-    return res.status(500).json({ success: false, message: "Error saving file" });
-  }
+  } catch (error) {}
 };
 
killedBy: saveToS3() method should return 500 when AWS error occurs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] BooleanLiteral
controllers/S3Controller.js:139:44
     return res.json({ success: true, message: "File saved successfully", data: node });
   } catch (error) {
     console.error("Error saving file:", error);
-    return res.status(500).json({ success: false, message: "Error saving file" });
+    return res.status(500).json({ success: true, message: "Error saving file" });
   }
 };
