[Killed] BlockStatement
controllers/S3Controller.js:143:49
   }
 };
 
-export const deleteS3File = async (req, res) => {
-  try {
-    const { key, filePath } = req.body;
-    if (!key || !filePath) {
-      return res.status(400).json({ success: false, message: "key and filePath are required" });
-    }
-
-    await s3.send(new DeleteObjectCommand({
-      Bucket: BUCKET,
-      Key: `${key}${filePath}`,
-    }));
-
-    return res.json({ success: true, message: "File deleted successfully" });
-  } catch (error) {
-    console.error("Error deleting file:", error);
-    return res.status(500).json({ success: false, message: "Error deleting file" });
-  }
-};
+export const deleteS3File = async (req, res) => {};
 
 // export const deleteS3Folder = async (req, res) => {
killedBy: deleteS3File() method should delete a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<DeleteObjectCommand>

Number of calls: 0

[Killed] BlockStatement
controllers/S3Controller.js:144:7
 };
 
 export const deleteS3File = async (req, res) => {
-  try {
-    const { key, filePath } = req.body;
-    if (!key || !filePath) {
-      return res.status(400).json({ success: false, message: "key and filePath are required" });
-    }
-
-    await s3.send(new DeleteObjectCommand({
-      Bucket: BUCKET,
-      Key: `${key}${filePath}`,
-    }));
-
-    return res.json({ success: true, message: "File deleted successfully" });
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error deleting file:", error);
     return res.status(500).json({ success: false, message: "Error deleting file" });
killedBy: deleteS3File() method should delete a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<DeleteObjectCommand>

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:146:17
 export const deleteS3File = async (req, res) => {
   try {
     const { key, filePath } = req.body;
-    if (!key || !filePath) {
+    if (!key || filePath) {
       return res.status(400).json({ success: false, message: "key and filePath are required" });
     }
killedBy: deleteS3File() method should delete a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<DeleteObjectCommand>

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:146:9
 export const deleteS3File = async (req, res) => {
   try {
     const { key, filePath } = req.body;
-    if (!key || !filePath) {
+    if (key || !filePath) {
       return res.status(400).json({ success: false, message: "key and filePath are required" });
     }
killedBy: deleteS3File() method should delete a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<DeleteObjectCommand>

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:147:46
   try {
     const { key, filePath } = req.body;
     if (!key || !filePath) {
-      return res.status(400).json({ success: false, message: "key and filePath are required" });
+      return res.status(400).json({ success: true, message: "key and filePath are required" });
     }
 
killedBy: deleteS3File() method should return 400 if key or filePath is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "key and filePath are required",
-   "success": false,

[Survived] ObjectLiteral
controllers/S3Controller.js:150:43
       return res.status(400).json({ success: false, message: "key and filePath are required" });
     }
 
-    await s3.send(new DeleteObjectCommand({
-      Bucket: BUCKET,
-      Key: `${key}${filePath}`,
-    }));
+    await s3.send(new DeleteObjectCommand({}));
 
     return res.json({ success: true, message: "File deleted successfully" });

[Killed] BooleanLiteral
controllers/S3Controller.js:155:32
       Key: `${key}${filePath}`,
     }));
 
-    return res.json({ success: true, message: "File deleted successfully" });
+    return res.json({ success: false, message: "File deleted successfully" });
   } catch (error) {
     console.error("Error deleting file:", error);
killedBy: deleteS3File() method should delete a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "File deleted successfully",
-   "success": true,

[Killed] BlockStatement
controllers/S3Controller.js:156:19
     }));
 
     return res.json({ success: true, message: "File deleted successfully" });
-  } catch (error) {
-    console.error("Error deleting file:", error);
-    return res.status(500).json({ success: false, message: "Error deleting file" });
-  }
+  } catch (error) {}
 };
 
killedBy: deleteS3File() method should return 500 if S3 throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/S3Controller.js:157:19
 
     return res.json({ success: true, message: "File deleted successfully" });
   } catch (error) {
-    console.error("Error deleting file:", error);
+    console.error("", error);
     return res.status(500).json({ success: false, message: "Error deleting file" });
   }

[Killed] BooleanLiteral
controllers/S3Controller.js:158:44
     return res.json({ success: true, message: "File deleted successfully" });
   } catch (error) {
     console.error("Error deleting file:", error);
-    return res.status(500).json({ success: false, message: "Error deleting file" });
+    return res.status(500).json({ success: true, message: "Error deleting file" });
   }
 };
killedBy: deleteS3File() method should return 500 if S3 throws an error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Error deleting file",
-   "success": false,

[Survived] Regex
controllers/S3Controller.js:196:47
 export const deleteS3Folder = async (req, res) => {
   try {
     const { key, filePath } = req.body;
-    const prefix = `${key}/${filePath.replace(/^\/+/, "")}`; 
+    const prefix = `${key}/${filePath.replace(/^\//, "")}`; 
     console.log("Deleting folder:", prefix);
 

[Killed] ConditionalExpression
controllers/S3Controller.js:204:9
       Prefix: prefix,
     }));
 
-    if (!listedObjects.Contents || listedObjects.Contents.length === 0) {
+    if (false) {
       await s3.send(new DeleteObjectCommand({
         Bucket: BUCKET,
killedBy: deleteS3Folder() method should delete folder marker when empty folder
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Folder deleted (empty or marker only)",
-   "success": true,

[Killed] BlockStatement
controllers/S3Controller.js:204:73
       Prefix: prefix,
     }));
 
-    if (!listedObjects.Contents || listedObjects.Contents.length === 0) {
-      await s3.send(new DeleteObjectCommand({
-        Bucket: BUCKET,
-        Key: prefix,
-      }));
-      return res.json({ success: true, message: "Folder deleted (empty or marker only)" });
-    }
+    if (!listedObjects.Contents || listedObjects.Contents.length === 0) {}
 
     await s3.send(new DeleteObjectsCommand({
killedBy: deleteS3Folder() method should delete folder marker when empty folder
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Folder deleted (empty or marker only)",
-   "success": true,

[Killed] ObjectLiteral
controllers/S3Controller.js:205:45
     }));
 
     if (!listedObjects.Contents || listedObjects.Contents.length === 0) {
-      await s3.send(new DeleteObjectCommand({
-        Bucket: BUCKET,
-        Key: prefix,
-      }));
+      await s3.send(new DeleteObjectCommand({}));
       return res.json({ success: true, message: "Folder deleted (empty or marker only)" });
     }
killedBy: deleteS3Folder() method should append trailing slash when prefix does NOT end with slash
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- ObjectContaining {
-   "Key": "project123/src",
- }

[Killed] BooleanLiteral
controllers/S3Controller.js:209:34
         Bucket: BUCKET,
         Key: prefix,
       }));
-      return res.json({ success: true, message: "Folder deleted (empty or marker only)" });
+      return res.json({ success: false, message: "Folder deleted (empty or marker only)" });
     }
 
killedBy: deleteS3Folder() method should delete folder marker when empty folder
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Folder deleted (empty or marker only)",
-   "success": true,

[Survived] ArrowFunction
controllers/S3Controller.js:215:45
     await s3.send(new DeleteObjectsCommand({
       Bucket: BUCKET,
       Delete: {
-        Objects: listedObjects.Contents.map(obj => ({ Key: obj.Key })),
+        Objects: listedObjects.Contents.map(() => undefined),
       },
     }));

[Survived] MethodExpression
controllers/S3Controller.js:221:12
 
     await s3.send(new DeleteObjectCommand({
       Bucket: BUCKET,
-      Key: prefix.endsWith("/") ? prefix : `${prefix}/`,
+      Key: prefix.startsWith("/") ? prefix : `${prefix}/`,
     }));
 

[Killed] StringLiteral
controllers/S3Controller.js:221:28
 
     await s3.send(new DeleteObjectCommand({
       Bucket: BUCKET,
-      Key: prefix.endsWith("/") ? prefix : `${prefix}/`,
+      Key: prefix.endsWith("") ? prefix : `${prefix}/`,
     }));
 
killedBy: deleteS3Folder() method should append trailing slash when prefix does NOT end with slash
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

- ObjectContaining {
-   "Key": "project123/src/",
+ Object {

[Killed] BooleanLiteral
controllers/S3Controller.js:224:32
       Key: prefix.endsWith("/") ? prefix : `${prefix}/`,
     }));
 
-    return res.json({ success: true, message: "Folder deleted successfully" });
+    return res.json({ success: false, message: "Folder deleted successfully" });
   } catch (error) {
     console.error("Error deleting folder:", error);
killedBy: deleteS3Folder() method should delete a folder with multiple files successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Folder deleted successfully",
-   "success": true,

[Killed] StringLiteral
controllers/S3Controller.js:224:47
       Key: prefix.endsWith("/") ? prefix : `${prefix}/`,
     }));
 
-    return res.json({ success: true, message: "Folder deleted successfully" });
+    return res.json({ success: true, message: "" });
   } catch (error) {
     console.error("Error deleting folder:", error);
killedBy: deleteS3Folder() method should delete a folder with multiple files successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Folder deleted successfully",
+   "message": "",

[Killed] BlockStatement
controllers/S3Controller.js:225:19
     }));
 
     return res.json({ success: true, message: "Folder deleted successfully" });
-  } catch (error) {
-    console.error("Error deleting folder:", error);
-    return res.status(500).json({ success: false, message: "Error deleting folder" });
-  }
+  } catch (error) {}
 };
 
killedBy: deleteS3Folder() method should return 400 if key or filePath missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:227:44
     return res.json({ success: true, message: "Folder deleted successfully" });
   } catch (error) {
     console.error("Error deleting folder:", error);
-    return res.status(500).json({ success: false, message: "Error deleting folder" });
+    return res.status(500).json({ success: true, message: "Error deleting folder" });
   }
 };
killedBy: deleteS3Folder() method should return 500 on S3 internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Error deleting folder",
-   "success": false,

[Killed] BlockStatement
controllers/S3Controller.js:233:7
 
 
 export const renameS3File = async (req, res) => {
-  try {
-    const { key, oldFilePath, newFilePath } = req.validatedData;
-    if (!key || !oldFilePath || !newFilePath) {
-      return res.status(400).json({ success: false, message: "key, oldFilePath, and newFilePath are required" });
-    }
-
-    const sourceKey = `${key}${oldFilePath}`;
-    const destKey = `${key}${newFilePath}`;
-
-  
-    await s3.send(new CopyObjectCommand({
-      Bucket: BUCKET,
-      CopySource: `${BUCKET}/${sourceKey}`, 
-      Key: destKey,
-    }));
-
-
-    await s3.send(new DeleteObjectCommand({
-      Bucket: BUCKET,
-      Key: sourceKey,
-    }));
-
-    return res.json({ success: true, message: "File renamed successfully" });
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error renaming file:", error);
     return res.status(500).json({ success: false, message: "Error renaming file" });
killedBy: renameS3File() method should rename a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<CopyObjectCommand>

Number of calls: 0

[Killed] ConditionalExpression
controllers/S3Controller.js:235:9
 export const renameS3File = async (req, res) => {
   try {
     const { key, oldFilePath, newFilePath } = req.validatedData;
-    if (!key || !oldFilePath || !newFilePath) {
+    if (false) {
       return res.status(400).json({ success: false, message: "key, oldFilePath, and newFilePath are required" });
     }
killedBy: renameS3File() method should return 400 if required fields are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BlockStatement
controllers/S3Controller.js:235:47
 export const renameS3File = async (req, res) => {
   try {
     const { key, oldFilePath, newFilePath } = req.validatedData;
-    if (!key || !oldFilePath || !newFilePath) {
-      return res.status(400).json({ success: false, message: "key, oldFilePath, and newFilePath are required" });
-    }
+    if (!key || !oldFilePath || !newFilePath) {}
 
     const sourceKey = `${key}${oldFilePath}`;
killedBy: renameS3File() method should return 400 if required fields are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:236:46
   try {
     const { key, oldFilePath, newFilePath } = req.validatedData;
     if (!key || !oldFilePath || !newFilePath) {
-      return res.status(400).json({ success: false, message: "key, oldFilePath, and newFilePath are required" });
+      return res.status(400).json({ success: true, message: "key, oldFilePath, and newFilePath are required" });
     }
 
killedBy: renameS3File() method should return 400 if required fields are missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "key, oldFilePath, and newFilePath are required",
-   "success": false,

[Survived] StringLiteral
controllers/S3Controller.js:239:23
       return res.status(400).json({ success: false, message: "key, oldFilePath, and newFilePath are required" });
     }
 
-    const sourceKey = `${key}${oldFilePath}`;
+    const sourceKey = ``;
     const destKey = `${key}${newFilePath}`;
 

[Survived] StringLiteral
controllers/S3Controller.js:245:19
   
     await s3.send(new CopyObjectCommand({
       Bucket: BUCKET,
-      CopySource: `${BUCKET}/${sourceKey}`, 
+      CopySource: ``, 
       Key: destKey,
     }));

[Killed] BooleanLiteral
controllers/S3Controller.js:255:32
       Key: sourceKey,
     }));
 
-    return res.json({ success: true, message: "File renamed successfully" });
+    return res.json({ success: false, message: "File renamed successfully" });
   } catch (error) {
     console.error("Error renaming file:", error);
killedBy: renameS3File() method should rename a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "File renamed successfully",
-   "success": true,

[Killed] StringLiteral
controllers/S3Controller.js:255:47
       Key: sourceKey,
     }));
 
-    return res.json({ success: true, message: "File renamed successfully" });
+    return res.json({ success: true, message: "" });
   } catch (error) {
     console.error("Error renaming file:", error);
killedBy: renameS3File() method should rename a file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "File renamed successfully",
+   "message": "",

[Killed] BlockStatement
controllers/S3Controller.js:256:19
     }));
 
     return res.json({ success: true, message: "File renamed successfully" });
-  } catch (error) {
-    console.error("Error renaming file:", error);
-    return res.status(500).json({ success: false, message: "Error renaming file" });
-  }
+  } catch (error) {}
 };
 
killedBy: renameS3File() method should return 500 on S3 error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:258:44
     return res.json({ success: true, message: "File renamed successfully" });
   } catch (error) {
     console.error("Error renaming file:", error);
-    return res.status(500).json({ success: false, message: "Error renaming file" });
+    return res.status(500).json({ success: true, message: "Error renaming file" });
   }
 };
killedBy: renameS3File() method should return 500 on S3 error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Error renaming file",
-   "success": false,

[Killed] ObjectLiteral
controllers/S3Controller.js:258:33
     return res.json({ success: true, message: "File renamed successfully" });
   } catch (error) {
     console.error("Error renaming file:", error);
-    return res.status(500).json({ success: false, message: "Error renaming file" });
+    return res.status(500).json({});
   }
 };
killedBy: renameS3File() method should return 500 on S3 error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Error renaming file",
-   "success": false,

[Survived] StringLiteral
controllers/S3Controller.js:265:20
 export const renameS3Folder = async (req, res) => {
   try {
     const { key, oldFilePath, newFilePath } = req.validatedData;
-    const prefix = `${key}${oldFilePath}`;
+    const prefix = ``;
     console.log("Renaming folder from", prefix, "to", `${key}${newFilePath}`);
 

[Survived] StringLiteral
controllers/S3Controller.js:266:49
   try {
     const { key, oldFilePath, newFilePath } = req.validatedData;
     const prefix = `${key}${oldFilePath}`;
-    console.log("Renaming folder from", prefix, "to", `${key}${newFilePath}`);
+    console.log("Renaming folder from", prefix, "", `${key}${newFilePath}`);
 
     const listedObjects = await s3.send(new ListObjectsV2Command({

[Survived] StringLiteral
controllers/S3Controller.js:266:55
   try {
     const { key, oldFilePath, newFilePath } = req.validatedData;
     const prefix = `${key}${oldFilePath}`;
-    console.log("Renaming folder from", prefix, "to", `${key}${newFilePath}`);
+    console.log("Renaming folder from", prefix, "to", ``);
 
     const listedObjects = await s3.send(new ListObjectsV2Command({

[Killed] ConditionalExpression
controllers/S3Controller.js:273:9
       Prefix: prefix,
     }));
 
-    if (!listedObjects.Contents || listedObjects.Contents.length === 0) {
+    if (true) {
       return res.status(404).json({ success: false, message: "No files found in the folder" });
     }
killedBy: renameS3Folder() method should rename folder with multiple files successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<CopyObjectCommand>
Received: {"args": {"Bucket": undefined, "Prefix": "user123/oldFolder/"}}

Number of calls: 1

[Killed] EqualityOperator
controllers/S3Controller.js:273:36
       Prefix: prefix,
     }));
 
-    if (!listedObjects.Contents || listedObjects.Contents.length === 0) {
+    if (!listedObjects.Contents || listedObjects.Contents.length !== 0) {
       return res.status(404).json({ success: false, message: "No files found in the folder" });
     }
killedBy: renameS3Folder() method should rename folder with multiple files successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<CopyObjectCommand>
Received: {"args": {"Bucket": undefined, "Prefix": "user123/oldFolder/"}}

Number of calls: 1

[Killed] BooleanLiteral
controllers/S3Controller.js:274:46
     }));
 
     if (!listedObjects.Contents || listedObjects.Contents.length === 0) {
-      return res.status(404).json({ success: false, message: "No files found in the folder" });
+      return res.status(404).json({ success: true, message: "No files found in the folder" });
     }
 
killedBy: renameS3Folder() method should return 404 when folder contains no files
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "No files found in the folder",
-   "success": false,

[Killed] ObjectLiteral
controllers/S3Controller.js:274:35
     }));
 
     if (!listedObjects.Contents || listedObjects.Contents.length === 0) {
-      return res.status(404).json({ success: false, message: "No files found in the folder" });
+      return res.status(404).json({});
     }
 
killedBy: renameS3Folder() method should return 404 when folder contains no files
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "No files found in the folder",
-   "success": false,

[Killed] BlockStatement
controllers/S3Controller.js:277:47
       return res.status(404).json({ success: false, message: "No files found in the folder" });
     }
 
-    for (const obj of listedObjects.Contents) {
-      const oldKey = obj.Key;
-      const newKey = oldKey.replace(prefix, `${key}${newFilePath}`);
-      await s3.send(new CopyObjectCommand({
-        Bucket: BUCKET,
-        CopySource: `${BUCKET}/${oldKey}`,
-        Key: newKey,
-      }));
-    }
+    for (const obj of listedObjects.Contents) {}
 
     await s3.send(new DeleteObjectsCommand({
killedBy: renameS3Folder() method should rename folder with multiple files successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<CopyObjectCommand>
Received
       1: {"args": {"Bucket": undefined, "Prefix": "user123/oldFolder/"}}
       2: {"args": {"Bucket": undefined, "Delete": {"Objects": [{"Key": "user123/oldFolder/file1.js"}, {"Key": "user123/oldFolder/file2.py"}]}}}

Number of calls: 2

[Survived] ObjectLiteral
controllers/S3Controller.js:287:44
       }));
     }
 
-    await s3.send(new DeleteObjectsCommand({
-      Bucket: BUCKET,
-      Delete: {
-        Objects: listedObjects.Contents.map(obj => ({ Key: obj.Key })),
-      },
-    }));
+    await s3.send(new DeleteObjectsCommand({}));
 
     return res.status(200).json({ success: true, message: "Folder renamed successfully" });

[Survived] ObjectLiteral
controllers/S3Controller.js:290:53
     await s3.send(new DeleteObjectsCommand({
       Bucket: BUCKET,
       Delete: {
-        Objects: listedObjects.Contents.map(obj => ({ Key: obj.Key })),
+        Objects: listedObjects.Contents.map(obj => ({})),
       },
     }));

[Killed] BooleanLiteral
controllers/S3Controller.js:294:44
       },
     }));
 
-    return res.status(200).json({ success: true, message: "Folder renamed successfully" });
+    return res.status(200).json({ success: false, message: "Folder renamed successfully" });
   } catch (error) {
     console.error("Error renaming folder:", error);
killedBy: renameS3Folder() method should rename folder with multiple files successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Folder renamed successfully",
-   "success": true,

[Killed] BlockStatement
controllers/S3Controller.js:295:19
     }));
 
     return res.status(200).json({ success: true, message: "Folder renamed successfully" });
-  } catch (error) {
-    console.error("Error renaming folder:", error);
-    return res.status(500).json({ success: false, message: "Error renaming folder" });
-  }
+  } catch (error) {}
 };
 
killedBy: renameS3Folder() method should return 500 if S3 throws an internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:297:44
     return res.status(200).json({ success: true, message: "Folder renamed successfully" });
   } catch (error) {
     console.error("Error renaming folder:", error);
-    return res.status(500).json({ success: false, message: "Error renaming folder" });
+    return res.status(500).json({ success: true, message: "Error renaming folder" });
   }
 };
killedBy: renameS3Folder() method should return 500 if S3 throws an internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Error renaming folder",
-   "success": false,

[Killed] StringLiteral
controllers/S3Controller.js:297:60
     return res.status(200).json({ success: true, message: "Folder renamed successfully" });
   } catch (error) {
     console.error("Error renaming folder:", error);
-    return res.status(500).json({ success: false, message: "Error renaming folder" });
+    return res.status(500).json({ success: false, message: "" });
   }
 };
killedBy: renameS3Folder() method should return 500 if S3 throws an internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Error renaming folder",
+   "message": "",

[Killed] ConditionalExpression
controllers/S3Controller.js:307:9
   try {
     const { key, filePath, content } = req.body;
     
-    if (!key || !filePath || content === undefined) {
+    if (true) {
       return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
     }
killedBy: updateFile() method should update an existing file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<HeadObjectCommand>

Number of calls: 0

[Killed] ConditionalExpression
controllers/S3Controller.js:307:9
   try {
     const { key, filePath, content } = req.body;
     
-    if (!key || !filePath || content === undefined) {
+    if (false) {
       return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
     }
killedBy: updateFile() method should return 400 if key, filePath, or content missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
controllers/S3Controller.js:308:46
     const { key, filePath, content } = req.body;
     
     if (!key || !filePath || content === undefined) {
-      return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
+      return res.status(400).json({ success: true, message: "key, filePath, and content are required" });
     }
 
killedBy: updateFile() method should return 400 if key, filePath, or content missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "key, filePath, and content are required",
-   "success": false,

[Survived] StringLiteral
controllers/S3Controller.js:311:19
       return res.status(400).json({ success: false, message: "key, filePath, and content are required" });
     }
 
-    const s3Key = `${key}${filePath}`;
+    const s3Key = ``;
 
     try {

[Killed] BlockStatement
controllers/S3Controller.js:313:9
 
     const s3Key = `${key}${filePath}`;
 
-    try {
-      await s3.send(new HeadObjectCommand({ Bucket: BUCKET, Key: s3Key }));
-    } catch (err) {
+    try {} catch (err) {
       if (err.name === "NotFound") {
         return res.status(404).json({ 
killedBy: updateFile() method should update an existing file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<HeadObjectCommand>
Received: {"args": {"Body": "console.log('updated');", "Bucket": undefined, "ContentType": "text/plain", "Key": "user123/main.js"}}

Number of calls: 1

[Killed] BlockStatement
controllers/S3Controller.js:315:19
 
     try {
       await s3.send(new HeadObjectCommand({ Bucket: BUCKET, Key: s3Key }));
-    } catch (err) {
-      if (err.name === "NotFound") {
-        return res.status(404).json({ 
-          success: false,
-          message: "File not found. Cannot update.",
-        });
-      }
-      throw err; 
-    }
+    } catch (err) {}
 
     await s3.send(new PutObjectCommand({
killedBy: updateFile() method should return 404 if file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404

Number of calls: 0
