[Killed] BlockStatement
controllers/S3Controller.js:316:36
     try {
       await s3.send(new HeadObjectCommand({ Bucket: BUCKET, Key: s3Key }));
     } catch (err) {
-      if (err.name === "NotFound") {
-        return res.status(404).json({ 
-          success: false,
-          message: "File not found. Cannot update.",
-        });
-      }
+      if (err.name === "NotFound") {}
       throw err; 
     }
killedBy: updateFile() method should return 404 if file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/S3Controller.js:316:11
     try {
       await s3.send(new HeadObjectCommand({ Bucket: BUCKET, Key: s3Key }));
     } catch (err) {
-      if (err.name === "NotFound") {
+      if (false) {
         return res.status(404).json({ 
           success: false,
killedBy: updateFile() method should return 404 if file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ObjectLiteral
controllers/S3Controller.js:317:37
       await s3.send(new HeadObjectCommand({ Bucket: BUCKET, Key: s3Key }));
     } catch (err) {
       if (err.name === "NotFound") {
-        return res.status(404).json({ 
-          success: false,
-          message: "File not found. Cannot update.",
-        });
+        return res.status(404).json({});
       }
       throw err; 
killedBy: updateFile() method should return 404 if file does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "File not found. Cannot update.",
-   "success": false,

[Killed] ObjectLiteral
controllers/S3Controller.js:332:18
       ContentType: 'text/plain',
     }));
 
-    const node = {
-      id: `${s3Key}_${Math.random()}`, 
-      name: filePath,
-      language: langMap[filePath.split('/').pop().split('.').pop()] || "plaintext", 
-      code: content,
-      input: "",
-      output: "",
-      saved: true,
-    };
+    const node = {};
 
     return res.json({ success: true, message: "File updated successfully", data: node });
killedBy: updateFile() method should set language='plaintext' when extension is unknown
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"language": "plaintext"}, "success": true}
Received: {"data": {}, "message": "File updated successfully", "success": true}

Number of calls: 1

[Killed] ConditionalExpression
controllers/S3Controller.js:335:17
     const node = {
       id: `${s3Key}_${Math.random()}`, 
       name: filePath,
-      language: langMap[filePath.split('/').pop().split('.').pop()] || "plaintext", 
+      language: true, 
       code: content,
       input: "",
killedBy: updateFile() method should set language='plaintext' when extension is unknown
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"language": "plaintext"}, "success": true}
Received: {"data": {"code": "Some content", "id": "user123/README.unknownext_0.3754498816762153", "input": "", "language": true, "name": "README.unknownext", "output": "", "saved": true}, "message": "File updated successfully", "success": true

[Killed] BooleanLiteral
controllers/S3Controller.js:342:32
       saved: true,
     };
 
-    return res.json({ success: true, message: "File updated successfully", data: node });
+    return res.json({ success: false, message: "File updated successfully", data: node });
 
   } catch (error) {
killedBy: updateFile() method should update an existing file successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"message": "File updated successfully", "success": true}
Received: {"data": {"code": "console.log('updated');", "id": "user123/main.js_0.464474667829736", "input": "", "language": "javascript", "name": "main.js", "output": "", "saved": true}, "message": "File updated successfully", "success": false}

Number of

[Killed] BlockStatement
controllers/S3Controller.js:344:19
 
     return res.json({ success: true, message: "File updated successfully", data: node });
 
-  } catch (error) {
-    console.error("Error updating file:", error);
-    return res.status(500).json({ success: false, message: "Error updating file" });
-  }
+  } catch (error) {}
 };
killedBy: updateFile() method should return 500 if S3 throws some other error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/S3Controller.js:346:44
 
   } catch (error) {
     console.error("Error updating file:", error);
-    return res.status(500).json({ success: false, message: "Error updating file" });
+    return res.status(500).json({ success: true, message: "Error updating file" });
   }
 };
killedBy: updateFile() method should return 500 if S3 throws some other error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Error updating file",
-   "success": false,
