[Killed] BlockStatement
controllers/UserController.js:9:47
 import { uploadImage } from "../utils/cloudinary.js";
 
 
-export const getProfile = async (req, res) => {
-  try {
-    const {userId} = req;
-
-    const user = await User.findById(userId).select("-password");
-
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
-
-    return res.status(200).json({success: true, data: user});
-  } catch (err) {
-    console.error("getProfile error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
-  }
-};
+export const getProfile = async (req, res) => {};
 
 export const getStats = async (req, res) => {
killedBy: getProfile() getProfile method Happy Paths should return user data when user is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/UserController.js:10:7
 
 
 export const getProfile = async (req, res) => {
-  try {
-    const {userId} = req;
-
-    const user = await User.findById(userId).select("-password");
-
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
-
-    return res.status(200).json({success: true, data: user});
-  } catch (err) {
+  try {} catch (err) {
     console.error("getProfile error:", err);
     return res.status(500).json({ success: false, message: "Internal server error" });
killedBy: getProfile() getProfile method Happy Paths should return user data when user is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
controllers/UserController.js:15:9
 
     const user = await User.findById(userId).select("-password");
 
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
+    if (true) return res.status(404).json({ success: false, message: "User not found" });
 
     return res.status(200).json({success: true, data: user});
killedBy: getProfile() getProfile method Happy Paths should return user data when user is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:15:55
 
     const user = await User.findById(userId).select("-password");
 
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
+    if (!user) return res.status(404).json({ success: true, message: "User not found" });
 
     return res.status(200).json({success: true, data: user});
killedBy: getProfile() getProfile method Edge Cases should return 404 when user is not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User not found",
-   "success": false,

[Killed] BooleanLiteral
controllers/UserController.js:17:43
 
     if (!user) return res.status(404).json({ success: false, message: "User not found" });
 
-    return res.status(200).json({success: true, data: user});
+    return res.status(200).json({success: false, data: user});
   } catch (err) {
     console.error("getProfile error:", err);
killedBy: getProfile() getProfile method Happy Paths should return user data when user is found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,7 +2,7 @@
    "data": Object {
      "_id": "12345",

[Killed] BlockStatement
controllers/UserController.js:18:17
     if (!user) return res.status(404).json({ success: false, message: "User not found" });
 
     return res.status(200).json({success: true, data: user});
-  } catch (err) {
-    console.error("getProfile error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
-  }
+  } catch (err) {}
 };
 
killedBy: getProfile() getProfile method Edge Cases should return 500 on database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
controllers/UserController.js:20:44
     return res.status(200).json({success: true, data: user});
   } catch (err) {
     console.error("getProfile error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
+    return res.status(500).json({ success: true, message: "Internal server error" });
   }
 };
killedBy: getProfile() getProfile method Edge Cases should return 500 on database error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Internal server error",
-   "success": false,

[Survived] StringLiteral
controllers/UserController.js:29:36
     const { userId, email } = req;
 
     const [user, roadmapCount] = await Promise.all([
-      User.findById(userId).select('streakCount maxStreak loginDates').lean(),
+      User.findById(userId).select("").lean(),
       Roadmap.countDocuments({ email }),
     ]);

[Killed] ConditionalExpression
controllers/UserController.js:33:9
       Roadmap.countDocuments({ email }),
     ]);
 
-    if (!user) return res.status(404).json({ success: false, message: 'User not found' });
+    if (true) return res.status(404).json({ success: false, message: 'User not found' });
 
     const coursesCompleted = 0;
killedBy: getStats() method should return stats successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:33:9
       Roadmap.countDocuments({ email }),
     ]);
 
-    if (!user) return res.status(404).json({ success: false, message: 'User not found' });
+    if (user) return res.status(404).json({ success: false, message: 'User not found' });
 
     const coursesCompleted = 0;
killedBy: getStats() method should return stats successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Survived] ObjectLiteral
controllers/UserController.js:36:41
     if (!user) return res.status(404).json({ success: false, message: 'User not found' });
 
     const coursesCompleted = 0;
-    const roadmaps = await Roadmap.find({ email });
+    const roadmaps = await Roadmap.find({});
     const filteredRoadmaps = roadmaps.filter(rm => {
       let valid = true;

[Survived] MethodExpression
controllers/UserController.js:37:30
 
     const coursesCompleted = 0;
     const roadmaps = await Roadmap.find({ email });
-    const filteredRoadmaps = roadmaps.filter(rm => {
-      let valid = true;
-      for (const chapter of rm.roadmapData.chapters) {
-        for (const topic of chapter.subtopics) {
-          if(topic.completed == false){
-            valid = false;
-            break;
-          }
-        }
-        if (!valid) break;
-      }
-      if(valid) return rm;
-    })
+    const filteredRoadmaps = roadmaps
     console.log(user.streakCount)
     const stats = {

[Survived] BlockStatement
controllers/UserController.js:37:52
 
     const coursesCompleted = 0;
     const roadmaps = await Roadmap.find({ email });
-    const filteredRoadmaps = roadmaps.filter(rm => {
-      let valid = true;
-      for (const chapter of rm.roadmapData.chapters) {
-        for (const topic of chapter.subtopics) {
-          if(topic.completed == false){
-            valid = false;
-            break;
-          }
-        }
-        if (!valid) break;
-      }
-      if(valid) return rm;
-    })
+    const filteredRoadmaps = roadmaps.filter(rm => {})
     console.log(user.streakCount)
     const stats = {

[Survived] BooleanLiteral
controllers/UserController.js:38:19
     const coursesCompleted = 0;
     const roadmaps = await Roadmap.find({ email });
     const filteredRoadmaps = roadmaps.filter(rm => {
-      let valid = true;
+      let valid = false;
       for (const chapter of rm.roadmapData.chapters) {
         for (const topic of chapter.subtopics) {

[Survived] BlockStatement
controllers/UserController.js:39:54
     const roadmaps = await Roadmap.find({ email });
     const filteredRoadmaps = roadmaps.filter(rm => {
       let valid = true;
-      for (const chapter of rm.roadmapData.chapters) {
-        for (const topic of chapter.subtopics) {
-          if(topic.completed == false){
-            valid = false;
-            break;
-          }
-        }
-        if (!valid) break;
-      }
+      for (const chapter of rm.roadmapData.chapters) {}
       if(valid) return rm;
     })

[Survived] BlockStatement
controllers/UserController.js:40:48
     const filteredRoadmaps = roadmaps.filter(rm => {
       let valid = true;
       for (const chapter of rm.roadmapData.chapters) {
-        for (const topic of chapter.subtopics) {
-          if(topic.completed == false){
-            valid = false;
-            break;
-          }
-        }
+        for (const topic of chapter.subtopics) {}
         if (!valid) break;
       }

[Survived] BooleanLiteral
controllers/UserController.js:41:33
       let valid = true;
       for (const chapter of rm.roadmapData.chapters) {
         for (const topic of chapter.subtopics) {
-          if(topic.completed == false){
+          if(topic.completed == true){
             valid = false;
             break;

[Survived] ConditionalExpression
controllers/UserController.js:41:14
       let valid = true;
       for (const chapter of rm.roadmapData.chapters) {
         for (const topic of chapter.subtopics) {
-          if(topic.completed == false){
+          if(true){
             valid = false;
             break;

[Survived] BooleanLiteral
controllers/UserController.js:42:21
       for (const chapter of rm.roadmapData.chapters) {
         for (const topic of chapter.subtopics) {
           if(topic.completed == false){
-            valid = false;
+            valid = true;
             break;
           }

[Survived] ConditionalExpression
controllers/UserController.js:46:13
             break;
           }
         }
-        if (!valid) break;
+        if (true) break;
       }
       if(valid) return rm;

[Survived] ConditionalExpression
controllers/UserController.js:46:13
             break;
           }
         }
-        if (!valid) break;
+        if (false) break;
       }
       if(valid) return rm;

[Survived] ConditionalExpression
controllers/UserController.js:48:10
         }
         if (!valid) break;
       }
-      if(valid) return rm;
+      if(true) return rm;
     })
     console.log(user.streakCount)

[Survived] ConditionalExpression
controllers/UserController.js:48:10
         }
         if (!valid) break;
       }
-      if(valid) return rm;
+      if(false) return rm;
     })
     console.log(user.streakCount)

[Killed] ConditionalExpression
controllers/UserController.js:54:22
     const stats = {
       totalRoadmaps: roadmapCount,
       coursesCompleted: filteredRoadmaps.length,
-      currentStreak: user.streakCount || 0,
+      currentStreak: true,
       maxStreak: user.maxStreak || 0,
       loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
killedBy: getStats() method should fallback to default values when streak,maxStreak or loginDates missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"currentStreak": 0, "loginDates": [], "maxStreak": 0}, "success": true}
Received: {"data": {"coursesCompleted": 0, "currentStreak": true, "loginDates": [], "maxStreak": 0, "totalRoadmaps": 1}, "success": true}

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:54:22
     const stats = {
       totalRoadmaps: roadmapCount,
       coursesCompleted: filteredRoadmaps.length,
-      currentStreak: user.streakCount || 0,
+      currentStreak: false,
       maxStreak: user.maxStreak || 0,
       loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
killedBy: getStats() method should fallback to default values when streak,maxStreak or loginDates missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"currentStreak": 0, "loginDates": [], "maxStreak": 0}, "success": true}
Received: {"data": {"coursesCompleted": 0, "currentStreak": false, "loginDates": [], "maxStreak": 0, "totalRoadmaps": 1}, "success": true}

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:55:18
       totalRoadmaps: roadmapCount,
       coursesCompleted: filteredRoadmaps.length,
       currentStreak: user.streakCount || 0,
-      maxStreak: user.maxStreak || 0,
+      maxStreak: true,
       loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
     };
killedBy: getStats() method should fallback to default values when streak,maxStreak or loginDates missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"currentStreak": 0, "loginDates": [], "maxStreak": 0}, "success": true}
Received: {"data": {"coursesCompleted": 0, "currentStreak": 0, "loginDates": [], "maxStreak": true, "totalRoadmaps": 1}, "success": true}

Number of calls: 1

[Killed] LogicalOperator
controllers/UserController.js:55:18
       totalRoadmaps: roadmapCount,
       coursesCompleted: filteredRoadmaps.length,
       currentStreak: user.streakCount || 0,
-      maxStreak: user.maxStreak || 0,
+      maxStreak: user.maxStreak && 0,
       loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
     };
killedBy: getStats() method should fallback to default values when streak,maxStreak or loginDates missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"currentStreak": 0, "loginDates": [], "maxStreak": 0}, "success": true}
Received: {"data": {"coursesCompleted": 0, "currentStreak": 0, "loginDates": [], "maxStreak": undefined, "totalRoadmaps": 1}, "success": true}

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:59:44
       loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
     };
 
-    return res.status(200).json({ success: true, data: stats });
+    return res.status(200).json({ success: false, data: stats });
   } catch (err) {
     console.error('getStats error:', err);
killedBy: getStats() method should fallback to default values when streak,maxStreak or loginDates missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"currentStreak": 0, "loginDates": [], "maxStreak": 0}, "success": true}
Received: {"data": {"coursesCompleted": 0, "currentStreak": 0, "loginDates": [], "maxStreak": 0, "totalRoadmaps": 1}, "success": false}

Number of calls: 1

[Killed] ObjectLiteral
controllers/UserController.js:59:33
       loginDates: Array.isArray(user.loginDates) ? user.loginDates : [],
     };
 
-    return res.status(200).json({ success: true, data: stats });
+    return res.status(200).json({});
   } catch (err) {
     console.error('getStats error:', err);
killedBy: getStats() method should fallback to default values when streak,maxStreak or loginDates missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"data": ObjectContaining {"currentStreak": 0, "loginDates": [], "maxStreak": 0}, "success": true}
Received: {}

Number of calls: 1

[Killed] BlockStatement
controllers/UserController.js:60:17
     };
 
     return res.status(200).json({ success: true, data: stats });
-  } catch (err) {
-    console.error('getStats error:', err);
-    return res.status(500).json({ success: false, message: 'Internal server error' });
-  }
+  } catch (err) {}
 };
 
killedBy: getStats() method should return 500 on internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] BooleanLiteral
controllers/UserController.js:62:44
     return res.status(200).json({ success: true, data: stats });
   } catch (err) {
     console.error('getStats error:', err);
-    return res.status(500).json({ success: false, message: 'Internal server error' });
+    return res.status(500).json({ success: true, message: 'Internal server error' });
   }
 };

[Survived] ObjectLiteral
controllers/UserController.js:62:33
     return res.status(200).json({ success: true, data: stats });
   } catch (err) {
     console.error('getStats error:', err);
-    return res.status(500).json({ success: false, message: 'Internal server error' });
+    return res.status(500).json({});
   }
 };

[Killed] BlockStatement
controllers/UserController.js:67:52
 };
 
 
-export const getUserRoadmaps = async (req, res) => {
-  try {
-    const {email} = req;
-
-    const roadmaps = await Roadmap.find({ email });
-
-    return res.status(200).json({success: true, data: roadmaps});
-  } catch (err) {
-    console.error("getUserRoadmaps error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
-  }
-};
+export const getUserRoadmaps = async (req, res) => {};
 
 
killedBy: getUserRoadmaps() method should return user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/UserController.js:68:7
 
 
 export const getUserRoadmaps = async (req, res) => {
-  try {
-    const {email} = req;
-
-    const roadmaps = await Roadmap.find({ email });
-
-    return res.status(200).json({success: true, data: roadmaps});
-  } catch (err) {
+  try {} catch (err) {
     console.error("getUserRoadmaps error:", err);
     return res.status(500).json({ success: false, message: "Internal server error" });
killedBy: getUserRoadmaps() method should return user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BooleanLiteral
controllers/UserController.js:73:43
 
     const roadmaps = await Roadmap.find({ email });
 
-    return res.status(200).json({success: true, data: roadmaps});
+    return res.status(200).json({success: false, data: roadmaps});
   } catch (err) {
     console.error("getUserRoadmaps error:", err);
killedBy: getUserRoadmaps() method should return user roadmaps successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,7 +5,7 @@
      },
      Object {

[Killed] BlockStatement
controllers/UserController.js:74:17
     const roadmaps = await Roadmap.find({ email });
 
     return res.status(200).json({success: true, data: roadmaps});
-  } catch (err) {
-    console.error("getUserRoadmaps error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
-  }
+  } catch (err) {}
 };
 
killedBy: getUserRoadmaps() method should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] BooleanLiteral
controllers/UserController.js:76:44
     return res.status(200).json({success: true, data: roadmaps});
   } catch (err) {
     console.error("getUserRoadmaps error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
+    return res.status(500).json({ success: true, message: "Internal server error" });
   }
 };

[Survived] ObjectLiteral
controllers/UserController.js:76:33
     return res.status(200).json({success: true, data: roadmaps});
   } catch (err) {
     console.error("getUserRoadmaps error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
+    return res.status(500).json({});
   }
 };

[Killed] BlockStatement
controllers/UserController.js:81:51
 };
 
 
-export const changePassword = async (req, res) => {
-  try {
-    const {userId} = req;
-    const { oldPassword, newPassword } = req.body;
-
-    const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
-
-    const isMatch = await bcrypt.compare(oldPassword, user.password);
-    if (!isMatch)
-      return res.status(401).json({ success: false, message: "Old password incorrect" });
-
-    const hashed = await bcrypt.hash(newPassword, 10);
-    user.password = hashed;
-
-    await user.save();
-
-    return res.status(200).json({ success: true, message: "Password updated successfully" });
-  } catch (err) {
-    console.error("changePassword error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
-  }
-};
+export const changePassword = async (req, res) => {};
 
 const sanitize = (str = "") => str.replace(/[<>]/g, "").trim();
killedBy: changePassword() method should update password successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/UserController.js:82:7
 
 
 export const changePassword = async (req, res) => {
-  try {
-    const {userId} = req;
-    const { oldPassword, newPassword } = req.body;
-
-    const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
-
-    const isMatch = await bcrypt.compare(oldPassword, user.password);
-    if (!isMatch)
-      return res.status(401).json({ success: false, message: "Old password incorrect" });
-
-    const hashed = await bcrypt.hash(newPassword, 10);
-    user.password = hashed;
-
-    await user.save();
-
-    return res.status(200).json({ success: true, message: "Password updated successfully" });
-  } catch (err) {
+  try {} catch (err) {
     console.error("changePassword error:", err);
     return res.status(500).json({ success: false, message: "Internal server error" });
killedBy: changePassword() method should update password successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
controllers/UserController.js:87:9
     const { oldPassword, newPassword } = req.body;
 
     const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
+    if (true) return res.status(404).json({ success: false, message: "User not found" });
 
     const isMatch = await bcrypt.compare(oldPassword, user.password);
killedBy: changePassword() method should update password successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:87:9
     const { oldPassword, newPassword } = req.body;
 
     const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
+    if (false) return res.status(404).json({ success: false, message: "User not found" });
 
     const isMatch = await bcrypt.compare(oldPassword, user.password);
killedBy: changePassword() method should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:90:9
     if (!user) return res.status(404).json({ success: false, message: "User not found" });
 
     const isMatch = await bcrypt.compare(oldPassword, user.password);
-    if (!isMatch)
+    if (true)
       return res.status(401).json({ success: false, message: "Old password incorrect" });
 
killedBy: changePassword() method should update password successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:90:9
     if (!user) return res.status(404).json({ success: false, message: "User not found" });
 
     const isMatch = await bcrypt.compare(oldPassword, user.password);
-    if (!isMatch)
+    if (isMatch)
       return res.status(401).json({ success: false, message: "Old password incorrect" });
 
killedBy: changePassword() method should update password successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Survived] BooleanLiteral
controllers/UserController.js:91:46
 
     const isMatch = await bcrypt.compare(oldPassword, user.password);
     if (!isMatch)
-      return res.status(401).json({ success: false, message: "Old password incorrect" });
+      return res.status(401).json({ success: true, message: "Old password incorrect" });
 
     const hashed = await bcrypt.hash(newPassword, 10);

[Survived] BooleanLiteral
controllers/UserController.js:98:44
 
     await user.save();
 
-    return res.status(200).json({ success: true, message: "Password updated successfully" });
+    return res.status(200).json({ success: false, message: "Password updated successfully" });
   } catch (err) {
     console.error("changePassword error:", err);

[Survived] ObjectLiteral
controllers/UserController.js:98:33
 
     await user.save();
 
-    return res.status(200).json({ success: true, message: "Password updated successfully" });
+    return res.status(200).json({});
   } catch (err) {
     console.error("changePassword error:", err);

[Killed] BlockStatement
controllers/UserController.js:99:17
     await user.save();
 
     return res.status(200).json({ success: true, message: "Password updated successfully" });
-  } catch (err) {
-    console.error("changePassword error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
-  }
+  } catch (err) {}
 };
 
killedBy: changePassword() method should return 500 on internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/UserController.js:100:19
 
     return res.status(200).json({ success: true, message: "Password updated successfully" });
   } catch (err) {
-    console.error("changePassword error:", err);
+    console.error("", err);
     return res.status(500).json({ success: false, message: "Internal server error" });
   }

[Survived] BooleanLiteral
controllers/UserController.js:101:44
     return res.status(200).json({ success: true, message: "Password updated successfully" });
   } catch (err) {
     console.error("changePassword error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
+    return res.status(500).json({ success: true, message: "Internal server error" });
   }
 };

[Survived] ObjectLiteral
controllers/UserController.js:101:33
     return res.status(200).json({ success: true, message: "Password updated successfully" });
   } catch (err) {
     console.error("changePassword error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
+    return res.status(500).json({});
   }
 };

[Killed] ArrowFunction
controllers/UserController.js:105:18
   }
 };
 
-const sanitize = (str = "") => str.replace(/[<>]/g, "").trim();
+const sanitize = () => undefined;
 
 export const updateProfile = async (req, res) => {
killedBy: updateProfile() method should return 400 on bio too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Survived] MethodExpression
controllers/UserController.js:105:32
   }
 };
 
-const sanitize = (str = "") => str.replace(/[<>]/g, "").trim();
+const sanitize = (str = "") => str.replace(/[<>]/g, "");
 
 export const updateProfile = async (req, res) => {

[Killed] StringLiteral
controllers/UserController.js:110:22
 export const updateProfile = async (req, res) => {
   try {
     const { userId } = req;
-    const allowed = ["title", "bio", "location", "github", "linkedin", "twitter"];
+    const allowed = ["", "bio", "location", "github", "linkedin", "twitter"];
     const updates = {};
     for (const key of allowed) {
killedBy: updateProfile() method should return 400 on title too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] StringLiteral
controllers/UserController.js:110:31
 export const updateProfile = async (req, res) => {
   try {
     const { userId } = req;
-    const allowed = ["title", "bio", "location", "github", "linkedin", "twitter"];
+    const allowed = ["title", "", "location", "github", "linkedin", "twitter"];
     const updates = {};
     for (const key of allowed) {
killedBy: updateProfile() method should return 400 on bio too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BlockStatement
controllers/UserController.js:112:32
     const { userId } = req;
     const allowed = ["title", "bio", "location", "github", "linkedin", "twitter"];
     const updates = {};
-    for (const key of allowed) {
-      if (key in req.body && typeof req.body[key] === 'string') {
-        updates[key] = key === 'bio' ? sanitize(req.body[key]) : req.body[key].trim();
-      }
-    }
+    for (const key of allowed) {}
 
     if (updates.title && updates.title.length > 100) {
killedBy: updateProfile() method should return 400 on title too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1
