[Killed] BlockStatement
controllers/UserController.js:113:65
     const allowed = ["title", "bio", "location", "github", "linkedin", "twitter"];
     const updates = {};
     for (const key of allowed) {
-      if (key in req.body && typeof req.body[key] === 'string') {
-        updates[key] = key === 'bio' ? sanitize(req.body[key]) : req.body[key].trim();
-      }
+      if (key in req.body && typeof req.body[key] === 'string') {}
     }
 
killedBy: updateProfile() method should return 400 on title too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:113:11
     const allowed = ["title", "bio", "location", "github", "linkedin", "twitter"];
     const updates = {};
     for (const key of allowed) {
-      if (key in req.body && typeof req.body[key] === 'string') {
+      if (false) {
         updates[key] = key === 'bio' ? sanitize(req.body[key]) : req.body[key].trim();
       }
killedBy: updateProfile() method should return 400 on title too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Survived] ConditionalExpression
controllers/UserController.js:114:24
     const updates = {};
     for (const key of allowed) {
       if (key in req.body && typeof req.body[key] === 'string') {
-        updates[key] = key === 'bio' ? sanitize(req.body[key]) : req.body[key].trim();
+        updates[key] = false ? sanitize(req.body[key]) : req.body[key].trim();
       }
     }

[Survived] ConditionalExpression
controllers/UserController.js:114:24
     const updates = {};
     for (const key of allowed) {
       if (key in req.body && typeof req.body[key] === 'string') {
-        updates[key] = key === 'bio' ? sanitize(req.body[key]) : req.body[key].trim();
+        updates[key] = true ? sanitize(req.body[key]) : req.body[key].trim();
       }
     }

[Killed] ConditionalExpression
controllers/UserController.js:118:9
       }
     }
 
-    if (updates.title && updates.title.length > 100) {
+    if (true) {
       return res.status(400).json({ success: false, message: "Title too long (max 100)." });
     }
killedBy: updateProfile() method should update profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] EqualityOperator
controllers/UserController.js:118:26
       }
     }
 
-    if (updates.title && updates.title.length > 100) {
+    if (updates.title && updates.title.length <= 100) {
       return res.status(400).json({ success: false, message: "Title too long (max 100)." });
     }
killedBy: updateProfile() method should update profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Survived] BooleanLiteral
controllers/UserController.js:119:46
     }
 
     if (updates.title && updates.title.length > 100) {
-      return res.status(400).json({ success: false, message: "Title too long (max 100)." });
+      return res.status(400).json({ success: true, message: "Title too long (max 100)." });
     }
     if (updates.bio && updates.bio.length > 1000) {

[Killed] LogicalOperator
controllers/UserController.js:121:9
     if (updates.title && updates.title.length > 100) {
       return res.status(400).json({ success: false, message: "Title too long (max 100)." });
     }
-    if (updates.bio && updates.bio.length > 1000) {
+    if (updates.bio || updates.bio.length > 1000) {
       return res.status(400).json({ success: false, message: "Bio too long (max 1000)." });
     }
killedBy: updateProfile() method should update profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] EqualityOperator
controllers/UserController.js:121:24
     if (updates.title && updates.title.length > 100) {
       return res.status(400).json({ success: false, message: "Title too long (max 100)." });
     }
-    if (updates.bio && updates.bio.length > 1000) {
+    if (updates.bio && updates.bio.length <= 1000) {
       return res.status(400).json({ success: false, message: "Bio too long (max 1000)." });
     }
killedBy: updateProfile() method should update profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:122:46
       return res.status(400).json({ success: false, message: "Title too long (max 100)." });
     }
     if (updates.bio && updates.bio.length > 1000) {
-      return res.status(400).json({ success: false, message: "Bio too long (max 1000)." });
+      return res.status(400).json({ success: true, message: "Bio too long (max 1000)." });
     }
     if (updates.location && updates.location.length > 100) {
killedBy: updateProfile() method should return 400 on bio too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Bio too long (max 1000).",
-   "success": false,

[Killed] ConditionalExpression
controllers/UserController.js:124:9
     if (updates.bio && updates.bio.length > 1000) {
       return res.status(400).json({ success: false, message: "Bio too long (max 1000)." });
     }
-    if (updates.location && updates.location.length > 100) {
+    if (false) {
       return res.status(400).json({ success: false, message: "Location too long (max 100)." });
     }
killedBy: updateProfile() method should return 400 on location too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BlockStatement
controllers/UserController.js:124:60
     if (updates.bio && updates.bio.length > 1000) {
       return res.status(400).json({ success: false, message: "Bio too long (max 1000)." });
     }
-    if (updates.location && updates.location.length > 100) {
-      return res.status(400).json({ success: false, message: "Location too long (max 100)." });
-    }
+    if (updates.location && updates.location.length > 100) {}
     const linkFields = ["github", "linkedin", "twitter"];
     for (const lf of linkFields) {
killedBy: updateProfile() method should return 400 on location too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:125:46
       return res.status(400).json({ success: false, message: "Bio too long (max 1000)." });
     }
     if (updates.location && updates.location.length > 100) {
-      return res.status(400).json({ success: false, message: "Location too long (max 100)." });
+      return res.status(400).json({ success: true, message: "Location too long (max 100)." });
     }
     const linkFields = ["github", "linkedin", "twitter"];
killedBy: updateProfile() method should return 400 on location too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Location too long (max 100).",
-   "success": false,

[Killed] StringLiteral
controllers/UserController.js:125:62
       return res.status(400).json({ success: false, message: "Bio too long (max 1000)." });
     }
     if (updates.location && updates.location.length > 100) {
-      return res.status(400).json({ success: false, message: "Location too long (max 100)." });
+      return res.status(400).json({ success: false, message: "" });
     }
     const linkFields = ["github", "linkedin", "twitter"];
killedBy: updateProfile() method should return 400 on location too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Location too long (max 100).",
+   "message": "",

[Killed] StringLiteral
controllers/UserController.js:127:25
     if (updates.location && updates.location.length > 100) {
       return res.status(400).json({ success: false, message: "Location too long (max 100)." });
     }
-    const linkFields = ["github", "linkedin", "twitter"];
+    const linkFields = ["", "linkedin", "twitter"];
     for (const lf of linkFields) {
       if (updates[lf] && updates[lf].length > 200) {
killedBy: updateProfile() method should return 400 when github link is too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Survived] StringLiteral
controllers/UserController.js:127:47
     if (updates.location && updates.location.length > 100) {
       return res.status(400).json({ success: false, message: "Location too long (max 100)." });
     }
-    const linkFields = ["github", "linkedin", "twitter"];
+    const linkFields = ["github", "linkedin", ""];
     for (const lf of linkFields) {
       if (updates[lf] && updates[lf].length > 200) {

[Killed] BlockStatement
controllers/UserController.js:128:34
       return res.status(400).json({ success: false, message: "Location too long (max 100)." });
     }
     const linkFields = ["github", "linkedin", "twitter"];
-    for (const lf of linkFields) {
-      if (updates[lf] && updates[lf].length > 200) {
-        return res.status(400).json({ success: false, message: `${lf} link too long (max 200).` });
-      }
-    }
+    for (const lf of linkFields) {}
 
     const user = await User.findById(userId);
killedBy: updateProfile() method should return 400 when github link is too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:129:11
     }
     const linkFields = ["github", "linkedin", "twitter"];
     for (const lf of linkFields) {
-      if (updates[lf] && updates[lf].length > 200) {
+      if (true) {
         return res.status(400).json({ success: false, message: `${lf} link too long (max 200).` });
       }
killedBy: updateProfile() method should update profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] EqualityOperator
controllers/UserController.js:129:26
     }
     const linkFields = ["github", "linkedin", "twitter"];
     for (const lf of linkFields) {
-      if (updates[lf] && updates[lf].length > 200) {
+      if (updates[lf] && updates[lf].length <= 200) {
         return res.status(400).json({ success: false, message: `${lf} link too long (max 200).` });
       }
killedBy: updateProfile() method should return 400 when github link is too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 404

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:130:48
     const linkFields = ["github", "linkedin", "twitter"];
     for (const lf of linkFields) {
       if (updates[lf] && updates[lf].length > 200) {
-        return res.status(400).json({ success: false, message: `${lf} link too long (max 200).` });
+        return res.status(400).json({ success: true, message: `${lf} link too long (max 200).` });
       }
     }
killedBy: updateProfile() method should return 400 when github link is too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "github link too long (max 200).",
-   "success": false,

[Killed] ObjectLiteral
controllers/UserController.js:130:37
     const linkFields = ["github", "linkedin", "twitter"];
     for (const lf of linkFields) {
       if (updates[lf] && updates[lf].length > 200) {
-        return res.status(400).json({ success: false, message: `${lf} link too long (max 200).` });
+        return res.status(400).json({});
       }
     }
killedBy: updateProfile() method should return 400 when github link is too long
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "github link too long (max 200).",
-   "success": false,

[Killed] BooleanLiteral
controllers/UserController.js:135:9
     }
 
     const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: "User not found" });
+    if (user) return res.status(404).json({ success: false, message: "User not found" });
 
     Object.assign(user, updates);
killedBy: updateProfile() method should update profile successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Survived] BooleanLiteral
controllers/UserController.js:141:44
     await user.save();
 
     const safeUser = await User.findById(userId).select('-password');
-    return res.status(200).json({ success: true, data: safeUser });
+    return res.status(200).json({ success: false, data: safeUser });
   } catch (err) {
     console.error("updateProfile error:", err);

[Killed] BlockStatement
controllers/UserController.js:142:17
 
     const safeUser = await User.findById(userId).select('-password');
     return res.status(200).json({ success: true, data: safeUser });
-  } catch (err) {
-    console.error("updateProfile error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
-  }
+  } catch (err) {}
 };
 
killedBy: updateProfile() method should return 500 on internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] BooleanLiteral
controllers/UserController.js:144:44
     return res.status(200).json({ success: true, data: safeUser });
   } catch (err) {
     console.error("updateProfile error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
+    return res.status(500).json({ success: true, message: "Internal server error" });
   }
 };

[Survived] ObjectLiteral
controllers/UserController.js:144:33
     return res.status(200).json({ success: true, data: safeUser });
   } catch (err) {
     console.error("updateProfile error:", err);
-    return res.status(500).json({ success: false, message: "Internal server error" });
+    return res.status(500).json({});
   }
 };

[Killed] BlockStatement
controllers/UserController.js:148:49
   }
 };
 
-export const uploadAvatar = async (req, res) => {
-  try {
-    const { userId } = req;
-    const { dataUri } = req.body || {};
-    if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
-      return res.status(400).json({ success: false, message: 'Invalid image data' });
-    }
-
-    const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: 'User not found' });
-
-    const result = await uploadImage(dataUri, { folder: 'avatars' });
-
-    user.avatar = result.secure_url;
-    user.avatarPublicId = result.public_id;
-    await user.save();
-
-    const safe = await User.findById(userId).select('-password');
-    return res.status(200).json({ success: true, data: safe });
-  } catch (err) {
-    console.error('uploadAvatar error:', err);
-    return res.status(500).json({ success: false, message: 'Failed to upload avatar' });
-  }
-};
+export const uploadAvatar = async (req, res) => {};
 
 export const getAllNotes = async (req, res) => {
killedBy: uploadAvatar() method should upload avatar successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/UserController.js:149:7
 };
 
 export const uploadAvatar = async (req, res) => {
-  try {
-    const { userId } = req;
-    const { dataUri } = req.body || {};
-    if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
-      return res.status(400).json({ success: false, message: 'Invalid image data' });
-    }
-
-    const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: 'User not found' });
-
-    const result = await uploadImage(dataUri, { folder: 'avatars' });
-
-    user.avatar = result.secure_url;
-    user.avatarPublicId = result.public_id;
-    await user.save();
-
-    const safe = await User.findById(userId).select('-password');
-    return res.status(200).json({ success: true, data: safe });
-  } catch (err) {
+  try {} catch (err) {
     console.error('uploadAvatar error:', err);
     return res.status(500).json({ success: false, message: 'Failed to upload avatar' });
killedBy: uploadAvatar() method should upload avatar successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] LogicalOperator
controllers/UserController.js:151:25
 export const uploadAvatar = async (req, res) => {
   try {
     const { userId } = req;
-    const { dataUri } = req.body || {};
+    const { dataUri } = req.body && {};
     if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
       return res.status(400).json({ success: false, message: 'Invalid image data' });
killedBy: uploadAvatar() method should upload avatar successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:151:25
 export const uploadAvatar = async (req, res) => {
   try {
     const { userId } = req;
-    const { dataUri } = req.body || {};
+    const { dataUri } = false;
     if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
       return res.status(400).json({ success: false, message: 'Invalid image data' });
killedBy: uploadAvatar() method should upload avatar successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:152:9
   try {
     const { userId } = req;
     const { dataUri } = req.body || {};
-    if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
+    if (dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
       return res.status(400).json({ success: false, message: 'Invalid image data' });
     }
killedBy: uploadAvatar() method should upload avatar successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] MethodExpression
controllers/UserController.js:152:53
   try {
     const { userId } = req;
     const { dataUri } = req.body || {};
-    if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
+    if (!dataUri || typeof dataUri !== 'string' || !dataUri.endsWith('data:')) {
       return res.status(400).json({ success: false, message: 'Invalid image data' });
     }
killedBy: uploadAvatar() method should upload avatar successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 400

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:153:46
     const { userId } = req;
     const { dataUri } = req.body || {};
     if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
-      return res.status(400).json({ success: false, message: 'Invalid image data' });
+      return res.status(400).json({ success: true, message: 'Invalid image data' });
     }
 
killedBy: uploadAvatar() method should return 400 when req.body is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid image data",
-   "success": false,

[Killed] ObjectLiteral
controllers/UserController.js:153:35
     const { userId } = req;
     const { dataUri } = req.body || {};
     if (!dataUri || typeof dataUri !== 'string' || !dataUri.startsWith('data:')) {
-      return res.status(400).json({ success: false, message: 'Invalid image data' });
+      return res.status(400).json({});
     }
 
killedBy: uploadAvatar() method should return 400 when req.body is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Invalid image data",
-   "success": false,

[Killed] ConditionalExpression
controllers/UserController.js:157:9
     }
 
     const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: 'User not found' });
+    if (true) return res.status(404).json({ success: false, message: 'User not found' });
 
     const result = await uploadImage(dataUri, { folder: 'avatars' });
killedBy: uploadAvatar() method should upload avatar successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:157:9
     }
 
     const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: 'User not found' });
+    if (false) return res.status(404).json({ success: false, message: 'User not found' });
 
     const result = await uploadImage(dataUri, { folder: 'avatars' });
killedBy: uploadAvatar() method should return 404 if user not found
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 500

Number of calls: 1

[Survived] BooleanLiteral
controllers/UserController.js:166:44
     await user.save();
 
     const safe = await User.findById(userId).select('-password');
-    return res.status(200).json({ success: true, data: safe });
+    return res.status(200).json({ success: false, data: safe });
   } catch (err) {
     console.error('uploadAvatar error:', err);

[Killed] BlockStatement
controllers/UserController.js:167:17
 
     const safe = await User.findById(userId).select('-password');
     return res.status(200).json({ success: true, data: safe });
-  } catch (err) {
-    console.error('uploadAvatar error:', err);
-    return res.status(500).json({ success: false, message: 'Failed to upload avatar' });
-  }
+  } catch (err) {}
 };
 
killedBy: uploadAvatar() method should return 500 on internal error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/UserController.js:168:19
     const safe = await User.findById(userId).select('-password');
     return res.status(200).json({ success: true, data: safe });
   } catch (err) {
-    console.error('uploadAvatar error:', err);
+    console.error("", err);
     return res.status(500).json({ success: false, message: 'Failed to upload avatar' });
   }

[Survived] BooleanLiteral
controllers/UserController.js:169:44
     return res.status(200).json({ success: true, data: safe });
   } catch (err) {
     console.error('uploadAvatar error:', err);
-    return res.status(500).json({ success: false, message: 'Failed to upload avatar' });
+    return res.status(500).json({ success: true, message: 'Failed to upload avatar' });
   }
 };

[Survived] StringLiteral
controllers/UserController.js:169:60
     return res.status(200).json({ success: true, data: safe });
   } catch (err) {
     console.error('uploadAvatar error:', err);
-    return res.status(500).json({ success: false, message: 'Failed to upload avatar' });
+    return res.status(500).json({ success: false, message: "" });
   }
 };

[Killed] BlockStatement
controllers/UserController.js:173:48
   }
 };
 
-export const getAllNotes = async (req, res) => {
-  try {
-    const { userId } = req;
-    if (!userId) return res.status(401).json({ success: false, message: 'Unauthorized' });
-
-    const notes = await Note.find({ userId }).lean();
-    return res.status(200).json({ success: true, data: notes });
-  } catch (err) {
-    console.error('getAllNotes error:', err);
-    return res.status(500).json({ success: false, message: 'Internal server error' });
-  }
-};
+export const getAllNotes = async (req, res) => {};
 
 export const purgeUserData = async (req, res) => {
killedBy: getAllNotes() method should return notes successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] BlockStatement
controllers/UserController.js:174:7
 };
 
 export const getAllNotes = async (req, res) => {
-  try {
-    const { userId } = req;
-    if (!userId) return res.status(401).json({ success: false, message: 'Unauthorized' });
-
-    const notes = await Note.find({ userId }).lean();
-    return res.status(200).json({ success: true, data: notes });
-  } catch (err) {
+  try {} catch (err) {
     console.error('getAllNotes error:', err);
     return res.status(500).json({ success: false, message: 'Internal server error' });
killedBy: getAllNotes() method should return notes successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200

Number of calls: 0

[Killed] ConditionalExpression
controllers/UserController.js:176:9
 export const getAllNotes = async (req, res) => {
   try {
     const { userId } = req;
-    if (!userId) return res.status(401).json({ success: false, message: 'Unauthorized' });
+    if (true) return res.status(401).json({ success: false, message: 'Unauthorized' });
 
     const notes = await Note.find({ userId }).lean();
killedBy: getAllNotes() method should return notes successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:176:9
 export const getAllNotes = async (req, res) => {
   try {
     const { userId } = req;
-    if (!userId) return res.status(401).json({ success: false, message: 'Unauthorized' });
+    if (false) return res.status(401).json({ success: false, message: 'Unauthorized' });
 
     const notes = await Note.find({ userId }).lean();
killedBy: getAllNotes() method should return 401 if no userId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 200

Number of calls: 1

[Survived] BooleanLiteral
controllers/UserController.js:179:44
     if (!userId) return res.status(401).json({ success: false, message: 'Unauthorized' });
 
     const notes = await Note.find({ userId }).lean();
-    return res.status(200).json({ success: true, data: notes });
+    return res.status(200).json({ success: false, data: notes });
   } catch (err) {
     console.error('getAllNotes error:', err);

[Survived] ObjectLiteral
controllers/UserController.js:179:33
     if (!userId) return res.status(401).json({ success: false, message: 'Unauthorized' });
 
     const notes = await Note.find({ userId }).lean();
-    return res.status(200).json({ success: true, data: notes });
+    return res.status(200).json({});
   } catch (err) {
     console.error('getAllNotes error:', err);

[Killed] BlockStatement
controllers/UserController.js:180:17
 
     const notes = await Note.find({ userId }).lean();
     return res.status(200).json({ success: true, data: notes });
-  } catch (err) {
-    console.error('getAllNotes error:', err);
-    return res.status(500).json({ success: false, message: 'Internal server error' });
-  }
+  } catch (err) {}
 };
 
killedBy: getAllNotes() method should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] BooleanLiteral
controllers/UserController.js:182:44
     return res.status(200).json({ success: true, data: notes });
   } catch (err) {
     console.error('getAllNotes error:', err);
-    return res.status(500).json({ success: false, message: 'Internal server error' });
+    return res.status(500).json({ success: true, message: 'Internal server error' });
   }
 };

[Killed] BooleanLiteral
controllers/UserController.js:189:20
 export const purgeUserData = async (req, res) => {
   try {
     const { userId, email } = req;
-    if (!userId || !email) return res.status(401).json({ success: false, message: 'Unauthorized' });
+    if (!userId || email) return res.status(401).json({ success: false, message: 'Unauthorized' });
 
     const user = await User.findById(userId);
killedBy: purgeUserData() method should purge user data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Killed] ConditionalExpression
controllers/UserController.js:189:9
 export const purgeUserData = async (req, res) => {
   try {
     const { userId, email } = req;
-    if (!userId || !email) return res.status(401).json({ success: false, message: 'Unauthorized' });
+    if (true) return res.status(401).json({ success: false, message: 'Unauthorized' });
 
     const user = await User.findById(userId);
killedBy: purgeUserData() method should purge user data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 401

Number of calls: 1

[Killed] BooleanLiteral
controllers/UserController.js:192:9
     if (!userId || !email) return res.status(401).json({ success: false, message: 'Unauthorized' });
 
     const user = await User.findById(userId);
-    if (!user) return res.status(404).json({ success: false, message: 'User not found' });
+    if (user) return res.status(404).json({ success: false, message: 'User not found' });
 
     const [roadmapResult, chatResult, noteResult] = await Promise.all([
killedBy: purgeUserData() method should purge user data successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1
