[Survived] StringLiteral
controllers/UserController.js:201:18
     ]);
 
 
-    user.title = '';
+    user.title = "Stryker was here!";
     user.bio = '';
     user.location = '';

[Survived] StringLiteral
controllers/UserController.js:207:21
     user.avatar = '';
     user.avatarPublicId = '';
     user.github = '';
-    user.linkedin = '';
+    user.linkedin = "Stryker was here!";
     user.twitter = '';
     user.streakCount = 0;

[Survived] ArrayDeclaration
controllers/UserController.js:211:23
     user.twitter = '';
     user.streakCount = 0;
     user.maxStreak = 0;
-    user.loginDates = [];
+    user.loginDates = ["Stryker was here"];
     await user.save();
 

[Survived] ObjectLiteral
controllers/UserController.js:218:13
     return res.status(200).json({
       success: true,
       message: 'All user data purged successfully',
-      meta: {
-        roadmapsDeleted: roadmapResult.deletedCount,
-        chatsDeleted: chatResult.deletedCount,
-        notesDeleted: noteResult.deletedCount,
-      },
+      meta: {},
       data: safeUser,
     });

[Killed] BlockStatement
controllers/UserController.js:225:17
       },
       data: safeUser,
     });
-  } catch (err) {
-    console.error('purgeUserData error:', err);
-    return res.status(500).json({ success: false, message: 'Failed to purge user data' });
-  }
+  } catch (err) {}
 };
 
killedBy: purgeUserData() method should return 500 on error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Survived] StringLiteral
controllers/UserController.js:226:19
       data: safeUser,
     });
   } catch (err) {
-    console.error('purgeUserData error:', err);
+    console.error("", err);
     return res.status(500).json({ success: false, message: 'Failed to purge user data' });
   }

[Survived] BooleanLiteral
controllers/UserController.js:227:44
     });
   } catch (err) {
     console.error('purgeUserData error:', err);
-    return res.status(500).json({ success: false, message: 'Failed to purge user data' });
+    return res.status(500).json({ success: true, message: 'Failed to purge user data' });
   }
 };

[Survived] StringLiteral
controllers/UserController.js:227:60
     });
   } catch (err) {
     console.error('purgeUserData error:', err);
-    return res.status(500).json({ success: false, message: 'Failed to purge user data' });
+    return res.status(500).json({ success: false, message: "" });
   }
 };
