[Killed] ArrowFunction
middlewares/validate.js:1:25
-export const validate = schema => (req, res, next) => {
-    try {
-        const result = schema.safeParse(req.body);
-        console.log("Request body:", req.body);
-        console.log("Validation result:", result);
-        if (!result.success) {
-            const message = JSON.parse(result.error.message)[0].message;
-            return res.status(400).json({ success: false, message });
-        }
-        req.validatedData = req.body;
-        next();
-    } catch (err) {
-        next(err);
-    }
-};
+export const validate = () => undefined;
 
killedBy: validate middleware calls next() when validation succeeds
statusReason: TypeError: middleware is not a function

[Killed] BlockStatement
middlewares/validate.js:1:55
-export const validate = schema => (req, res, next) => {
-    try {
-        const result = schema.safeParse(req.body);
-        console.log("Request body:", req.body);
-        console.log("Validation result:", result);
-        if (!result.success) {
-            const message = JSON.parse(result.error.message)[0].message;
-            return res.status(400).json({ success: false, message });
-        }
-        req.validatedData = req.body;
-        next();
-    } catch (err) {
-        next(err);
-    }
-};
+export const validate = schema => (req, res, next) => {};
 
killedBy: validate middleware calls next() when validation succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"name": "Hello"}

Number of calls: 0

[Killed] BlockStatement
middlewares/validate.js:2:9
 export const validate = schema => (req, res, next) => {
-    try {
-        const result = schema.safeParse(req.body);
-        console.log("Request body:", req.body);
-        console.log("Validation result:", result);
-        if (!result.success) {
-            const message = JSON.parse(result.error.message)[0].message;
-            return res.status(400).json({ success: false, message });
-        }
-        req.validatedData = req.body;
-        next();
-    } catch (err) {
+    try {} catch (err) {
         next(err);
     }
killedBy: validate middleware calls next() when validation succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"name": "Hello"}

Number of calls: 0

[Killed] BooleanLiteral
middlewares/validate.js:6:13
         const result = schema.safeParse(req.body);
         console.log("Request body:", req.body);
         console.log("Validation result:", result);
-        if (!result.success) {
+        if (result.success) {
             const message = JSON.parse(result.error.message)[0].message;
             return res.status(400).json({ success: false, message });
killedBy: validate middleware calls next() when validation succeeds
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"name": "Hello"}
Received: undefined

[Killed] ConditionalExpression
middlewares/validate.js:6:13
         const result = schema.safeParse(req.body);
         console.log("Request body:", req.body);
         console.log("Validation result:", result);
-        if (!result.success) {
+        if (false) {
             const message = JSON.parse(result.error.message)[0].message;
             return res.status(400).json({ success: false, message });
killedBy: validate middleware returns 400 when validation fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BooleanLiteral
middlewares/validate.js:8:52
         console.log("Validation result:", result);
         if (!result.success) {
             const message = JSON.parse(result.error.message)[0].message;
-            return res.status(400).json({ success: false, message });
+            return res.status(400).json({ success: true, message });
         }
         req.validatedData = req.body;
killedBy: validate middleware returns 400 when validation fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid input",
-   "success": false,

[Killed] ObjectLiteral
middlewares/validate.js:8:41
         console.log("Validation result:", result);
         if (!result.success) {
             const message = JSON.parse(result.error.message)[0].message;
-            return res.status(400).json({ success: false, message });
+            return res.status(400).json({});
         }
         req.validatedData = req.body;
killedBy: validate middleware returns 400 when validation fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "Invalid input",
-   "success": false,

[Killed] BlockStatement
middlewares/validate.js:12:19
         }
         req.validatedData = req.body;
         next();
-    } catch (err) {
-        next(err);
-    }
+    } catch (err) {}
 };
 
killedBy: validate middleware calls next(err) when JSON.parse(result.error.message) fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
