[Killed] StringLiteral
utils/mapping.js:4:11
 export const langMap = {
       js: "javascript",
       ts: "typescript",
-      py: "python",
+      py: "",
       java: "java",
       c: "c",
killedBy: langMap utility maps each shorthand to its correct full language name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "python"
Received: ""

[Killed] StringLiteral
utils/mapping.js:5:13
       js: "javascript",
       ts: "typescript",
       py: "python",
-      java: "java",
+      java: "",
       c: "c",
       cpp: "cpp",
killedBy: langMap utility maps each shorthand to its correct full language name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "java"
Received: ""

[Killed] StringLiteral
utils/mapping.js:6:10
       ts: "typescript",
       py: "python",
       java: "java",
-      c: "c",
+      c: "",
       cpp: "cpp",
       cs: "csharp",
killedBy: langMap utility maps each shorthand to its correct full language name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "c"
Received: ""

[Killed] StringLiteral
utils/mapping.js:19:12
       scala: "scala",
       pl: "perl",
       hs: "haskell",
-      lua: "lua",
+      lua: "",
       dart: "dart",
       sh: "bash"
killedBy: langMap utility maps each shorthand to its correct full language name
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "lua"
Received: ""
