[Killed] StringLiteral
utils/emailTemplates.js:3:14
 export const verificationEmail = (email, verifyUrl) => {
   return {
-    subject: 'Welcome to this website',
+    subject: "",
     html: `<!DOCTYPE html>
       <html lang="en">
killedBy: emailTemplates utils verificationEmail() returns the correct subject
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Welcome to this website"
Received: ""
