[Survived] ObjectLiteral
utils/cloudinary.js:4:19
 import { v2 as cloudinary } from 'cloudinary';
 
 
-cloudinary.config({
-	cloud_name: process.env.CLOUDINARY_CLOUD_NAME,
-	api_key: process.env.CLOUDINARY_API_KEY,
-	api_secret: process.env.CLOUDINARY_API_SECRET,
-	secure: true,
-});
+cloudinary.config({});
  
 export async function uploadImage(source, options = {}) {

[Survived] BooleanLiteral
utils/cloudinary.js:8:10
 	cloud_name: process.env.CLOUDINARY_CLOUD_NAME,
 	api_key: process.env.CLOUDINARY_API_KEY,
 	api_secret: process.env.CLOUDINARY_API_SECRET,
-	secure: true,
+	secure: false,
 });
  

[Killed] BlockStatement
utils/cloudinary.js:11:57
 	secure: true,
 });
  
-export async function uploadImage(source, options = {}) {
-	return cloudinary.uploader.upload(source, {
-		resource_type: 'image',
-		folder: options.folder,
-	});
-}
+export async function uploadImage(source, options = {}) {}
 
 export { cloudinary };
killedBy: cloudinary utils uploads an image with folder option
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "file123", {"folder": "abc", "resource_type": "image"}

Number of calls: 0

[Killed] ObjectLiteral
utils/cloudinary.js:12:44
 });
  
 export async function uploadImage(source, options = {}) {
-	return cloudinary.uploader.upload(source, {
-		resource_type: 'image',
-		folder: options.folder,
-	});
+	return cloudinary.uploader.upload(source, {});
 }
 
killedBy: cloudinary utils uploads an image with folder option
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "file123",
- Object {
-   "folder": "abc",
