[Survived] ObjectLiteral
utils/generate.js:3:31
 import { GoogleGenAI } from '@google/genai';
 
-const genAI = new GoogleGenAI({
-    apiKey: process.env.GOOGLE_GENAI_API_KEY,
-});
+const genAI = new GoogleGenAI({});
 
 export const geminiModel = genAI.models.generateContent.bind(genAI.models);

[Killed] BlockStatement
utils/generate.js:8:82
 });
 
 export const geminiModel = genAI.models.generateContent.bind(genAI.models);
-export async function generateWithGemini(prompt, model = 'gemini-2.0-flash-001') {
-    try {
-        const response = await genAI.models.generateContent({
-            model,
-            contents: prompt,
-        });
-
-        return response.text;
-    } catch (error) {
-        console.error('Gemini API Error:', error);
-        throw new Error('Failed to generate content with Gemini');
-    }
-}
+export async function generateWithGemini(prompt, model = 'gemini-2.0-flash-001') {}
killedBy: generate.js Gemini utilities returns text from generateWithGemini()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"contents": "Hello", "model": "gemini-2.0-flash-001"}

Number of calls: 0

[Killed] BlockStatement
utils/generate.js:9:9
 
 export const geminiModel = genAI.models.generateContent.bind(genAI.models);
 export async function generateWithGemini(prompt, model = 'gemini-2.0-flash-001') {
-    try {
-        const response = await genAI.models.generateContent({
-            model,
-            contents: prompt,
-        });
-
-        return response.text;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Gemini API Error:', error);
         throw new Error('Failed to generate content with Gemini');
killedBy: generate.js Gemini utilities returns text from generateWithGemini()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"contents": "Hello", "model": "gemini-2.0-flash-001"}

Number of calls: 0

[Killed] BlockStatement
utils/generate.js:16:21
         });
 
         return response.text;
-    } catch (error) {
-        console.error('Gemini API Error:', error);
-        throw new Error('Failed to generate content with Gemini');
-    }
+    } catch (error) {}
 }
killedBy: generate.js Gemini utilities throws custom error on Gemini API failure
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
utils/generate.js:17:23
 
         return response.text;
     } catch (error) {
-        console.error('Gemini API Error:', error);
+        console.error("", error);
         throw new Error('Failed to generate content with Gemini');
     }

[Killed] StringLiteral
utils/generate.js:18:25
         return response.text;
     } catch (error) {
         console.error('Gemini API Error:', error);
-        throw new Error('Failed to generate content with Gemini');
+        throw new Error("");
     }
 }
killedBy: generate.js Gemini utilities throws custom error on Gemini API failure
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Failed to generate content with Gemini"
Received message:   ""

      73 |         stryCov_9fa48("1713");
      74 |         console.error(stryMutAct_9fa48("1714") ? "" : (stryCov_9fa48("1714"), 'Gemini API Error:'), error);
    > 75 |         throw new Error(stryMutAct_9fa48("1715") ? "" : (stryCov_9fa48("1715"), 'Failed to g
