[Killed] LogicalOperator
utils/prompt.js:53:22
 
 export const quizPrompt = (roadMap, chapterId, subtopicId) => {
 
-    const chapters = roadMap.roadmapData?.chapters || [];
+    const chapters = roadMap.roadmapData?.chapters && [];
 
     if (subtopicId) {
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Chapter not found

[Killed] ConditionalExpression
utils/prompt.js:53:22
 
 export const quizPrompt = (roadMap, chapterId, subtopicId) => {
 
-    const chapters = roadMap.roadmapData?.chapters || [];
+    const chapters = true;
 
     if (subtopicId) {
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: TypeError: chapters.find is not a function

[Killed] BlockStatement
utils/prompt.js:55:21
 
     const chapters = roadMap.roadmapData?.chapters || [];
 
-    if (subtopicId) {
-        // quiz for subtopic
-        const chapter = chapters.find(ch => ch.id === chapterId);
-        if (!chapter) throw new Error("Chapter not found");
-
-        const subtopic = chapter.subtopics.find(st => st.id === subtopicId);
-        if (!subtopic) throw new Error("Subtopic not found");
-
-        return `
-        You are an expert quiz generator.
-
-        Generate a 5-question multiple-choice quiz for:
-        Title: "${subtopic.title}"
-        Description: "${subtopic.description}"
-
-        Each question must have:
-        - 4 MCQ options (a, b, c, d)
-        - correctAnswer field
-        - explanation field (3-4 lines)
-
-        Return ONLY a JSON array.
-      `;
-    }
+    if (subtopicId) {}
 
     // quiz for whole chapter
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "5-question multiple-choice quiz"
Received string:    "
    You are an expert educational quiz generator.·
    Generate a quiz covering the chapter and its subtopics.·
    Chapter Title: \"Basics\"
    Chapter Description: \"undefined\"·

[Killed] ConditionalExpression
utils/prompt.js:55:9
 
     const chapters = roadMap.roadmapData?.chapters || [];
 
-    if (subtopicId) {
+    if (true) {
         // quiz for subtopic
         const chapter = chapters.find(ch => ch.id === chapterId);
killedBy: prompt.js utility tests quizPrompt() generates whole-chapter quiz prompt when no subtopicId
statusReason: Error: Subtopic not found

[Killed] ArrowFunction
utils/prompt.js:57:39
 
     if (subtopicId) {
         // quiz for subtopic
-        const chapter = chapters.find(ch => ch.id === chapterId);
+        const chapter = chapters.find(() => undefined);
         if (!chapter) throw new Error("Chapter not found");
 
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Chapter not found

[Killed] ConditionalExpression
utils/prompt.js:57:45
 
     if (subtopicId) {
         // quiz for subtopic
-        const chapter = chapters.find(ch => ch.id === chapterId);
+        const chapter = chapters.find(ch => false);
         if (!chapter) throw new Error("Chapter not found");
 
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Chapter not found

[Killed] BooleanLiteral
utils/prompt.js:58:13
     if (subtopicId) {
         // quiz for subtopic
         const chapter = chapters.find(ch => ch.id === chapterId);
-        if (!chapter) throw new Error("Chapter not found");
+        if (chapter) throw new Error("Chapter not found");
 
         const subtopic = chapter.subtopics.find(st => st.id === subtopicId);
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Chapter not found

[Killed] ConditionalExpression
utils/prompt.js:58:13
     if (subtopicId) {
         // quiz for subtopic
         const chapter = chapters.find(ch => ch.id === chapterId);
-        if (!chapter) throw new Error("Chapter not found");
+        if (true) throw new Error("Chapter not found");
 
         const subtopic = chapter.subtopics.find(st => st.id === subtopicId);
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Chapter not found

[Killed] EqualityOperator
utils/prompt.js:60:55
         const chapter = chapters.find(ch => ch.id === chapterId);
         if (!chapter) throw new Error("Chapter not found");
 
-        const subtopic = chapter.subtopics.find(st => st.id === subtopicId);
+        const subtopic = chapter.subtopics.find(st => st.id !== subtopicId);
         if (!subtopic) throw new Error("Subtopic not found");
 
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Subtopic not found

[Killed] ConditionalExpression
utils/prompt.js:60:55
         const chapter = chapters.find(ch => ch.id === chapterId);
         if (!chapter) throw new Error("Chapter not found");
 
-        const subtopic = chapter.subtopics.find(st => st.id === subtopicId);
+        const subtopic = chapter.subtopics.find(st => false);
         if (!subtopic) throw new Error("Subtopic not found");
 
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Subtopic not found

[Killed] ConditionalExpression
utils/prompt.js:61:13
         if (!chapter) throw new Error("Chapter not found");
 
         const subtopic = chapter.subtopics.find(st => st.id === subtopicId);
-        if (!subtopic) throw new Error("Subtopic not found");
+        if (false) throw new Error("Subtopic not found");
 
         return `
killedBy: prompt.js utility tests quizPrompt() throws error if subtopic not found
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Subtopic not found"
Received message:   "Cannot read properties of undefined (reading 'title')"

      120 |
      121 |         Generate a 5-question multiple-choice quiz for:
    > 122 |         Title: "${subtopic.title}"

[Killed] BooleanLiteral
utils/prompt.js:61:13
         if (!chapter) throw new Error("Chapter not found");
 
         const subtopic = chapter.subtopics.find(st => st.id === subtopicId);
-        if (!subtopic) throw new Error("Subtopic not found");
+        if (subtopic) throw new Error("Subtopic not found");
 
         return `
killedBy: prompt.js utility tests quizPrompt() creates subtopic quiz prompt
statusReason: Error: Subtopic not found

[Killed] ConditionalExpression
utils/prompt.js:80:41
     }
 
     // quiz for whole chapter
-    const chapter = chapters.find(ch => ch.id === chapterId);
+    const chapter = chapters.find(ch => false);
     if (!chapter) throw new Error("Chapter not found");
 
killedBy: prompt.js utility tests quizPrompt() generates whole-chapter quiz prompt when no subtopicId
statusReason: Error: Chapter not found

[Killed] EqualityOperator
utils/prompt.js:80:41
     }
 
     // quiz for whole chapter
-    const chapter = chapters.find(ch => ch.id === chapterId);
+    const chapter = chapters.find(ch => ch.id !== chapterId);
     if (!chapter) throw new Error("Chapter not found");
 
killedBy: prompt.js utility tests quizPrompt() generates whole-chapter quiz prompt when no subtopicId
statusReason: Error: Chapter not found

[Killed] ConditionalExpression
utils/prompt.js:81:9
 
     // quiz for whole chapter
     const chapter = chapters.find(ch => ch.id === chapterId);
-    if (!chapter) throw new Error("Chapter not found");
+    if (false) throw new Error("Chapter not found");
 
     const subtopics = chapter.subtopics || [];
killedBy: prompt.js utility tests quizPrompt() throws error if chapter missing (no subtopicId mode)
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Chapter not found"
Received message:   "Cannot read properties of undefined (reading 'subtopics')"

      137 |     if (stryMutAct_9fa48("1771") ? false : stryMutAct_9fa48("1770") ? true : stryMutAct_9fa48("1769") ? chapter : (stryCov_9fa48("1769", "1770", "1771"), !chapter)) throw new Error(stryMutAct_9fa48("1772") ? "" : (stryCov_9f

[Killed] ConditionalExpression
utils/prompt.js:83:23
     const chapter = chapters.find(ch => ch.id === chapterId);
     if (!chapter) throw new Error("Chapter not found");
 
-    const subtopics = chapter.subtopics || [];
+    const subtopics = true;
 
     return `
killedBy: prompt.js utility tests quizPrompt() generates whole-chapter quiz prompt when no subtopicId
statusReason: TypeError: subtopics.map is not a function

[Killed] LogicalOperator
utils/prompt.js:83:23
     const chapter = chapters.find(ch => ch.id === chapterId);
     if (!chapter) throw new Error("Chapter not found");
 
-    const subtopics = chapter.subtopics || [];
+    const subtopics = chapter.subtopics && [];
 
     return `
killedBy: prompt.js utility tests quizPrompt() generates whole-chapter quiz prompt when no subtopicId
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "AA"
Received string:    "
    You are an expert educational quiz generator.·
    Generate a quiz covering the chapter and its subtopics.·
    Chapter Title: \"Intro\"
    Chapter Description: \"Basics\"·

[Killed] StringLiteral
utils/prompt.js:85:12
 
     const subtopics = chapter.subtopics || [];
 
-    return `
-    You are an expert educational quiz generator.
-
-    Generate a quiz covering the chapter and its subtopics.
-
-    Chapter Title: "${chapter.title}"
-    Chapter Description: "${chapter.description}"
-
-    Subtopics:
-    ${subtopics.map((s, i) => `${i + 1}. ${s.title}: ${s.description}`).join("\n")}
-
-    Return ONLY JSON with:
-    {
-      "chapterTitle": "...",
-      "totalQuestions": <number>,
-      "quiz": [...]
-    }
-  `;
+    return ``;
 };
 
killedBy: prompt.js utility tests quizPrompt() generates whole-chapter quiz prompt when no subtopicId
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Chapter Title: \"Intro\""
Received string:    ""

[Killed] ArrowFunction
utils/prompt.js:94:21
     Chapter Description: "${chapter.description}"
 
     Subtopics:
-    ${subtopics.map((s, i) => `${i + 1}. ${s.title}: ${s.description}`).join("\n")}
+    ${subtopics.map(() => undefined).join("\n")}
 
     Return ONLY JSON with:
killedBy: prompt.js utility tests quizPrompt() generates whole-chapter quiz prompt when no subtopicId
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "AA"
Received string:    "
    You are an expert educational quiz generator.·
    Generate a quiz covering the chapter and its subtopics.·
    Chapter Title: \"Intro\"
    Chapter Description: \"Basics\"·

[Survived] ArithmeticOperator
utils/prompt.js:94:34
     Chapter Description: "${chapter.description}"
 
     Subtopics:
-    ${subtopics.map((s, i) => `${i + 1}. ${s.title}: ${s.description}`).join("\n")}
+    ${subtopics.map((s, i) => `${i - 1}. ${s.title}: ${s.description}`).join("\n")}
 
     Return ONLY JSON with:

[Killed] BlockStatement
utils/prompt.js:162:52
 }`
 };
 
-export const getTitlePrompt = (userDescription) => {
-  return `You are an AI chat assistant that ONLY answers technical, coding, software development, debugging, architecture, or programming-related questions.
-
-  Given this user description or question: "${userDescription}".
-
-  Rules:
-  - If the question is technical/programming-related, generate a helpful answer.
-  - If it is NOT related to coding or technology (but general talk is allowed), do NOT answer it directly. Instead:
-      * Generate a generic technical title: "General Tech Query"
-      * Tell them politely that you are only here to answer tech queries
-
-  Tasks:
-  1. Generate a concise and engaging title (max 5 words) summarizing the user's question ONLY if it is technical.
-  2. Generate a helpful technical response ONLY if the question is technical.
-
-  Respond strictly in the following JSON format (no extra text, no markdown, no explanations, no newlines):
-
-  {
-    "title": "<generated_title_here>",
-    "response": "<ai_response_here>"
-  }`;
-}
+export const getTitlePrompt = (userDescription) => {}
 
 
killedBy: prompt.js utility tests getTitlePrompt() inserts userDescription
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
utils/prompt.js:186:60
 }
 
 
-export const getResponsePrompt = (userMessage, context) => {
-  return `You are an AI chat assistant that ONLY answers technical, coding, software development, debugging, architecture, or programming-related messages.
-
-  Given this user message: "${userMessage}".
-  And some past conversation for context: "${context}".
-
-  Rules:
-  - If the user's message is technical/programming-related, generate a helpful technical response.
-  - If the user's message is NOT technical or coding-related, do NOT answer it directly. Instead:
-      * Politely tell them that you are only here to answer technical and programming-related queries.
-
-  Additional guidelines:
-  - Use the context only to craft a better answer, but NEVER mention the context explicitly.
-  - Do NOT say things like "as previously discussed", "in our last conversation", or "according to the context".
-  - JUST answer naturally within the allowed domain.
-
-  Respond with only the final answer, no markdown, no extra formatting, no explanations.`;
-}
+export const getResponsePrompt = (userMessage, context) => {}
 
 
killedBy: prompt.js utility tests getResponsePrompt() inserts message and context
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
utils/prompt.js:206:47
 }
 
 
-export const getTopicGuardPrompt = (topic) => {
-  return `
-    You are a topic classifier for a programming education platform.
-    The topic must be related to programming, software engineering, computer science, data science, or IT.
-    
-    Topic: "${topic}"
-    
-    Is this topic valid for a programming learning platform?
-    Respond with only the single word "true" or "false".
-  `;
-};
+export const getTopicGuardPrompt = (topic) => {};
killedBy: prompt.js utility tests getTopicGuardPrompt() contains topic and instructions
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
utils/prompt.js:207:10
 
 
 export const getTopicGuardPrompt = (topic) => {
-  return `
-    You are a topic classifier for a programming education platform.
-    The topic must be related to programming, software engineering, computer science, data science, or IT.
-    
-    Topic: "${topic}"
-    
-    Is this topic valid for a programming learning platform?
-    Respond with only the single word "true" or "false".
-  `;
+  return ``;
 };
killedBy: prompt.js utility tests getTopicGuardPrompt() contains topic and instructions
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Machine Learning"
Received string:    ""
