[Killed] ObjectLiteral
utils/schemaHelpers.js:6:20
     return {
         type: Type.OBJECT,
         properties: {
-            title: { type: Type.STRING },
+            title: {},
             description: { type: Type.STRING },
             estimatedDuration: { type: Type.STRING },
killedBy: buildRoadmapSchema() contains all top-level properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: undefined

[Killed] ObjectLiteral
utils/schemaHelpers.js:7:26
         type: Type.OBJECT,
         properties: {
             title: { type: Type.STRING },
-            description: { type: Type.STRING },
+            description: {},
             estimatedDuration: { type: Type.STRING },
             difficulty: { type: Type.STRING },
killedBy: buildRoadmapSchema() contains all top-level properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: undefined

[Killed] ObjectLiteral
utils/schemaHelpers.js:8:32
         properties: {
             title: { type: Type.STRING },
             description: { type: Type.STRING },
-            estimatedDuration: { type: Type.STRING },
+            estimatedDuration: {},
             difficulty: { type: Type.STRING },
             chapters: {
killedBy: buildRoadmapSchema() contains all top-level properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: undefined

[Killed] ObjectLiteral
utils/schemaHelpers.js:9:25
             title: { type: Type.STRING },
             description: { type: Type.STRING },
             estimatedDuration: { type: Type.STRING },
-            difficulty: { type: Type.STRING },
+            difficulty: {},
             chapters: {
                 type: Type.ARRAY,
killedBy: buildRoadmapSchema() contains all top-level properties
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: undefined

[Killed] ObjectLiteral
utils/schemaHelpers.js:14:33
                 type: Type.ARRAY,
                 items: {
                     type: Type.OBJECT,
-                    properties: {
-                        id: { type: Type.NUMBER },
-                        title: { type: Type.STRING },
-                        description: { type: Type.STRING },
-                        estimatedTime: { type: Type.STRING },
-                        subtopics: {
-                            type: Type.ARRAY,
-                            items: {
-                                type: Type.OBJECT,
-                                properties: {
-                                    id: { type: Type.NUMBER },
-                                    title: { type: Type.STRING },
-                                    description: { type: Type.STRING },
-                                    estimatedTime: { type: Type.STRING },
-                                    completed: { type: Type.BOOLEAN },
-                                },
-                            },
-                        },
-                    },
+                    properties: {},
                 },
             },
killedBy: buildRoadmapSchema() defines chapter schema correctly
statusReason: Error: expect(received).toHaveProperty(path)

Expected path: "id"
Received path: []

Received value: {}

[Killed] ObjectLiteral
utils/schemaHelpers.js:15:29
                 items: {
                     type: Type.OBJECT,
                     properties: {
-                        id: { type: Type.NUMBER },
+                        id: {},
                         title: { type: Type.STRING },
                         description: { type: Type.STRING },
killedBy: buildRoadmapSchema() defines chapter schema correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "number"
Received: undefined

[Killed] ObjectLiteral
utils/schemaHelpers.js:25:44
                                 type: Type.OBJECT,
                                 properties: {
                                     id: { type: Type.NUMBER },
-                                    title: { type: Type.STRING },
+                                    title: {},
                                     description: { type: Type.STRING },
                                     estimatedTime: { type: Type.STRING },
killedBy: buildRoadmapSchema() defines subtopic schema correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: undefined

[Killed] ObjectLiteral
utils/schemaHelpers.js:27:52
                                     id: { type: Type.NUMBER },
                                     title: { type: Type.STRING },
                                     description: { type: Type.STRING },
-                                    estimatedTime: { type: Type.STRING },
+                                    estimatedTime: {},
                                     completed: { type: Type.BOOLEAN },
                                 },
killedBy: buildRoadmapSchema() defines subtopic schema correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "string"
Received: undefined

[Killed] ObjectLiteral
utils/schemaHelpers.js:28:48
                                     title: { type: Type.STRING },
                                     description: { type: Type.STRING },
                                     estimatedTime: { type: Type.STRING },
-                                    completed: { type: Type.BOOLEAN },
+                                    completed: {},
                                 },
                             },
killedBy: buildRoadmapSchema() defines subtopic schema correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "boolean"
Received: undefined
