[Survived] StringLiteral
utils/search.js:8:20
 const API_BASE_URL = 'https://www.googleapis.com/customsearch/v1';
 
 const SERPER_API_KEY = process.env.SERPER_API_KEY;
-const SERPER_URL = "https://google.serper.dev/search";
+const SERPER_URL = "";
 
 

[Killed] LogicalOperator
utils/search.js:41:17
  Fetching articles using SERPER*/ 
 export const getArticleLinks = async (mainTopic, subtopic) => {
   const query = `${mainTopic} ${subtopic.title}`;
-  const sites = subtopic.recommendedArticleSites || [];
+  const sites = subtopic.recommendedArticleSites && [];
 
   const siteFilter = sites.length
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] ConditionalExpression
utils/search.js:41:17
  Fetching articles using SERPER*/ 
 export const getArticleLinks = async (mainTopic, subtopic) => {
   const query = `${mainTopic} ${subtopic.title}`;
-  const sites = subtopic.recommendedArticleSites || [];
+  const sites = true;
 
   const siteFilter = sites.length
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Survived] ArrowFunction
utils/search.js:44:17
   const sites = subtopic.recommendedArticleSites || [];
 
   const siteFilter = sites.length
-    ? sites.map(site => `site:${site}`).join(" OR ")
+    ? sites.map(() => undefined).join(" OR ")
     : "";
 

[Survived] StringLiteral
utils/search.js:44:25
   const sites = subtopic.recommendedArticleSites || [];
 
   const siteFilter = sites.length
-    ? sites.map(site => `site:${site}`).join(" OR ")
+    ? sites.map(site => ``).join(" OR ")
     : "";
 

[Survived] ObjectLiteral
utils/search.js:54:18
       SERPER_URL,
       { q: fullQuery, num: 10 },
       {
-        headers: {
-          "X-API-KEY": SERPER_API_KEY,
-          "Content-Type": "application/json",
-        },
+        headers: {},
         timeout: 8000,
       }

[Survived] StringLiteral
utils/search.js:56:27
       {
         headers: {
           "X-API-KEY": SERPER_API_KEY,
-          "Content-Type": "application/json",
+          "Content-Type": "",
         },
         timeout: 8000,

[Killed] ConditionalExpression
utils/search.js:61:21
         timeout: 8000,
       }
     );
-    const results = data.organic || [];
+    const results = true;
 
     const siteCount = {};
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] LogicalOperator
utils/search.js:61:21
         timeout: 8000,
       }
     );
-    const results = data.organic || [];
+    const results = data.organic && [];
 
     const siteCount = {};
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] BlockStatement
utils/search.js:66:30
     const siteCount = {};
     const filteredLinks = [];
 
-    for (const r of results) {
-      try {
-        //check the domain name
-        const domain = new URL(r.link).hostname.replace("www.", "");
-        if (!sites.includes(domain)) continue;
-
-        siteCount[domain] = (siteCount[domain] || 0) + 1;
-        if (siteCount[domain] <= 3) {
-          filteredLinks.push(r.link);
-        }
-      } catch {
-        continue;
-      }
-    }
+    for (const r of results) {}
 
     return filteredLinks;
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] BlockStatement
utils/search.js:67:11
     const filteredLinks = [];
 
     for (const r of results) {
-      try {
-        //check the domain name
-        const domain = new URL(r.link).hostname.replace("www.", "");
-        if (!sites.includes(domain)) continue;
-
-        siteCount[domain] = (siteCount[domain] || 0) + 1;
-        if (siteCount[domain] <= 3) {
-          filteredLinks.push(r.link);
-        }
-      } catch {
+      try {} catch {
         continue;
       }
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Survived] StringLiteral
utils/search.js:69:65
     for (const r of results) {
       try {
         //check the domain name
-        const domain = new URL(r.link).hostname.replace("www.", "");
+        const domain = new URL(r.link).hostname.replace("www.", "Stryker was here!");
         if (!sites.includes(domain)) continue;
 

[Killed] ConditionalExpression
utils/search.js:70:13
       try {
         //check the domain name
         const domain = new URL(r.link).hostname.replace("www.", "");
-        if (!sites.includes(domain)) continue;
+        if (true) continue;
 
         siteCount[domain] = (siteCount[domain] || 0) + 1;
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] BooleanLiteral
utils/search.js:70:13
       try {
         //check the domain name
         const domain = new URL(r.link).hostname.replace("www.", "");
-        if (!sites.includes(domain)) continue;
+        if (sites.includes(domain)) continue;
 
         siteCount[domain] = (siteCount[domain] || 0) + 1;
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] ConditionalExpression
utils/search.js:72:30
         const domain = new URL(r.link).hostname.replace("www.", "");
         if (!sites.includes(domain)) continue;
 
-        siteCount[domain] = (siteCount[domain] || 0) + 1;
+        siteCount[domain] = (false) + 1;
         if (siteCount[domain] <= 3) {
           filteredLinks.push(r.link);
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
    "https://gfg.com/a1",
    "https://gfg.com/a2",

[Killed] LogicalOperator
utils/search.js:72:30
         const domain = new URL(r.link).hostname.replace("www.", "");
         if (!sites.includes(domain)) continue;
 
-        siteCount[domain] = (siteCount[domain] || 0) + 1;
+        siteCount[domain] = (siteCount[domain] && 0) + 1;
         if (siteCount[domain] <= 3) {
           filteredLinks.push(r.link);
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] EqualityOperator
utils/search.js:73:13
         if (!sites.includes(domain)) continue;
 
         siteCount[domain] = (siteCount[domain] || 0) + 1;
-        if (siteCount[domain] <= 3) {
+        if (siteCount[domain] > 3) {
           filteredLinks.push(r.link);
         }
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

  Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Killed] BlockStatement
utils/search.js:73:37
         if (!sites.includes(domain)) continue;
 
         siteCount[domain] = (siteCount[domain] || 0) + 1;
-        if (siteCount[domain] <= 3) {
-          filteredLinks.push(r.link);
-        }
+        if (siteCount[domain] <= 3) {}
       } catch {
         continue;
killedBy: search.js utility tests returns filtered article links for allowed domains (max 3 per domain)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   "https://gfg.com/a1",
-   "https://gfg.com/a2",

[Survived] BlockStatement
utils/search.js:76:15
         if (siteCount[domain] <= 3) {
           filteredLinks.push(r.link);
         }
-      } catch {
-        continue;
-      }
+      } catch {}
     }
 

[Killed] BlockStatement
utils/search.js:82:19
     }
 
     return filteredLinks;
-  } catch (error) {
-    console.error("Serper API error:", error.message);
-    return [];
-  }
+  } catch (error) {}
 };
 
killedBy: search.js utility tests returns [] on SERPER API failure
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
utils/search.js:103:54
 // };
 
 /* Fetching video using serper api */
-const getVideoLinks = async (mainTopic, subtopic) => {
-  const query = `${subtopic.title}  ${mainTopic} tutorial site:youtube.com`;
-  const { data } = await axios.post(
-    SERPER_URL,
-    { q: query, num: 10 },
-    {
-      headers: {
-        "X-API-KEY": SERPER_API_KEY,
-        "Content-Type": "application/json",
-      },
-      timeout: 8000,
-    }
-  );
-  const results = data.organic || [];
-  return results.map(result => result.link);
-}
+const getVideoLinks = async (mainTopic, subtopic) => {}
 
 
killedBy: search.js utility tests returns structured video links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 2

  Array [
    Object {
      "chapterId": 5,

[Survived] StringLiteral
utils/search.js:104:17
 
 /* Fetching video using serper api */
 const getVideoLinks = async (mainTopic, subtopic) => {
-  const query = `${subtopic.title}  ${mainTopic} tutorial site:youtube.com`;
+  const query = ``;
   const { data } = await axios.post(
     SERPER_URL,

[Killed] ArrowFunction
utils/search.js:117:22
     }
   );
   const results = data.organic || [];
-  return results.map(result => result.link);
+  return results.map(() => undefined);
 }
 
killedBy: search.js utility tests returns structured video links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
    Object {
      "chapterId": 5,

[Killed] BlockStatement
utils/search.js:121:51
 }
 
 
-export const getArticles = async (roadmapText) => {
-  const mainTopic = roadmapText.title;
-  const promises = [];
-
-  for (const chapter of roadmapText.chapters) {
-    for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000));
-      promises.push(
-        getArticleLinks(mainTopic, subtopic).then(articleLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          articles: articleLinks,
-        }))
-      );
-    }
-  }
-
-  return Promise.all(promises);
-};
+export const getArticles = async (roadmapText) => {};
 
 
killedBy: search.js utility tests returns article links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"articles": ["https://gfg.com/x"], "chapterId": 1, "subtopicId": 10}, {"articles": ["https://gfg.com/x"], "chapterId": 1, "subtopicId": 11}]
Received: undefined

[Killed] BlockStatement
utils/search.js:125:47
   const mainTopic = roadmapText.title;
   const promises = [];
 
-  for (const chapter of roadmapText.chapters) {
-    for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000));
-      promises.push(
-        getArticleLinks(mainTopic, subtopic).then(articleLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          articles: articleLinks,
-        }))
-      );
-    }
-  }
+  for (const chapter of roadmapText.chapters) {}
 
   return Promise.all(promises);
killedBy: search.js utility tests returns article links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  1

- Array [
-   Object {
-     "articles": Array [

[Killed] BlockStatement
utils/search.js:126:47
   const promises = [];
 
   for (const chapter of roadmapText.chapters) {
-    for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000));
-      promises.push(
-        getArticleLinks(mainTopic, subtopic).then(articleLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          articles: articleLinks,
-        }))
-      );
-    }
+    for (const subtopic of chapter.subtopics) {}
   }
 
killedBy: search.js utility tests returns article links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  1

- Array [
-   Object {
-     "articles": Array [

[Killed] ArrowFunction
utils/search.js:127:25
 
   for (const chapter of roadmapText.chapters) {
     for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000));
+      await new Promise(() => undefined);
       promises.push(
         getArticleLinks(mainTopic, subtopic).then(articleLinks => ({
killedBy: search.js utility tests returns article links for each subtopic
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrowFunction
utils/search.js:129:51
     for (const subtopic of chapter.subtopics) {
       await new Promise(resolve => setTimeout(resolve, 1000));
       promises.push(
-        getArticleLinks(mainTopic, subtopic).then(articleLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          articles: articleLinks,
-        }))
+        getArticleLinks(mainTopic, subtopic).then(() => undefined)
       );
     }
killedBy: search.js utility tests returns article links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  2

  Array [
-   Object {
-     "articles": Array [

[Killed] BlockStatement
utils/search.js:142:49
 };
 
 
-export const getVideos = async (roadmapText) => {
-  const mainTopic = roadmapText.title;
-  const promises = [];
-
-  for (const chapter of roadmapText.chapters) {
-    for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000)); // Adding delay to avoid rate limiting
-      promises.push(
-        getVideoLinks(mainTopic, subtopic).then(videoLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          videos: videoLinks,
-        }))
-      );
-    }
-  }
-
-  return Promise.all(promises);
-};
+export const getVideos = async (roadmapText) => {};
 
killedBy: search.js utility tests returns structured video links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"chapterId": 5, "subtopicId": 1, "videos": ["https://youtube.com/a", "https://youtube.com/b"]}, {"chapterId": 5, "subtopicId": 2, "videos": ["https://youtube.com/a", "https://youtube.com/b"]}]
Received: undefined

[Killed] BlockStatement
utils/search.js:146:47
   const mainTopic = roadmapText.title;
   const promises = [];
 
-  for (const chapter of roadmapText.chapters) {
-    for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000)); // Adding delay to avoid rate limiting
-      promises.push(
-        getVideoLinks(mainTopic, subtopic).then(videoLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          videos: videoLinks,
-        }))
-      );
-    }
-  }
+  for (const chapter of roadmapText.chapters) {}
 
   return Promise.all(promises);
killedBy: search.js utility tests returns structured video links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  1

- Array [
-   Object {
-     "chapterId": 5,

[Killed] BlockStatement
utils/search.js:147:47
   const promises = [];
 
   for (const chapter of roadmapText.chapters) {
-    for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000)); // Adding delay to avoid rate limiting
-      promises.push(
-        getVideoLinks(mainTopic, subtopic).then(videoLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          videos: videoLinks,
-        }))
-      );
-    }
+    for (const subtopic of chapter.subtopics) {}
   }
 
killedBy: search.js utility tests returns structured video links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 18
+ Received  +  1

- Array [
-   Object {
-     "chapterId": 5,

[Killed] ArrowFunction
utils/search.js:148:25
 
   for (const chapter of roadmapText.chapters) {
     for (const subtopic of chapter.subtopics) {
-      await new Promise(resolve => setTimeout(resolve, 1000)); // Adding delay to avoid rate limiting
+      await new Promise(() => undefined); // Adding delay to avoid rate limiting
       promises.push(
         getVideoLinks(mainTopic, subtopic).then(videoLinks => ({
killedBy: search.js utility tests returns structured video links for each subtopic
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrowFunction
utils/search.js:150:49
     for (const subtopic of chapter.subtopics) {
       await new Promise(resolve => setTimeout(resolve, 1000)); // Adding delay to avoid rate limiting
       promises.push(
-        getVideoLinks(mainTopic, subtopic).then(videoLinks => ({
-          chapterId: chapter.id,
-          subtopicId: subtopic.id,
-          videos: videoLinks,
-        }))
+        getVideoLinks(mainTopic, subtopic).then(() => undefined)
       );
     }
killedBy: search.js utility tests returns structured video links for each subtopic
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 16
+ Received  +  2

  Array [
-   Object {
-     "chapterId": 5,
